Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: I don't think that's a very good idea. I've heard 90 percent of restaurants fail in their first year...
es: No creo que sea una buena idea. Escuché que el 90 porciento de los restaurantes fallan en su primer año...

source: Hmm maybe? I don't know the first thing about opening a restaurant.
es: Hmm, ¿tal vez? No se nada sobre abrir restaurantes.

source: Like... Isn't it really risky? I've heard 90 percent of restaurants fail in their first year...
es: Aparte... ¿No es algo riesgoso? Escuché que el 90 porciento de los restaurantes fallan en su primer año...

source: Ahha ha ha! Yes, well. With our concentrated effort and a little luck, maybe we can bring that up to 91 percent.
es: ¡Jajaja! Sí, bueno. Si trabajamos juntos y con un poco de suerte, tal vez podamos cambiar ese porcentaje a un 91 porciento.

source: Yeah! ...Hey wait...
es: ¡Sí! ...No, espera...

source: Do you mind? That's very annoying.
es: ¿Te importa? Eso es muy molesto.

source: Sorry! I'm sorry I knocked so many times, but you didn't answer. You're Turbo?
es: ¡Perdón! Perdón por golpear mucho tu puerta, pero no respondías. ¿Eres Turbo?

source: Mmm yes, of course. I'm Turbo. And your name is...?
es: Mmm sí, por supuesto. Soy Turbo. ¿Y tu nombre es...?

source: My name is #player#! This may sound weird, but I had a dream about you.
es: ¡Mi nombre es #player#! Se que puede sonar raro, pero soñé contigo.

source: ...I think you're supposed to teach me how to be a great chef!
es: ...¡Creo que tienes que enseñarme a ser un gran chef!

source: Yes yes, I see. My name is Turbo and your name is #player#. That's nice. Goodbye.
es: Sí sí, ya veo. Mi nombre es Turbo y tu nombre es #player#. Claro. Adiós.

source: Sorry, I don't have the energy for this today.
es: Perdón, pero hoy no tengo la energía para esto.

source: Turbo, you were much nicer in my dream.
es: Turbo, eras más agradable en mi sueño.

source: First of all, you should address me as Fat Sensei.
es: Primero lo primero, debes dirigirte a mí como Fat Sensei.

source: Second, I was only nice in your dream because we hadn't met before.
es: Segundo, solo era agradable en tu sueño porque todavía no nos habíamos conocido.

source: I'll be meaner now that I know how annoying you are.
es: Voy a ser más fastidioso ahora que se lo molesto que eres.

source: Fat Sensei, I need your help! Being a chef is my dream but I'm terrible at it.
es: ¡Fat Sensei, necesito tu ayuda! Ser chef es mi sueño, pero soy un pésimo cocinero.

source: My roommate's the only one who will eat my cooking, but I think they're only doing it to be nice.
es: Mi compañero de cuarto es el único que come mi comida, y creo que lo hace para no quedar mal conmigo.

source: Everyone else says I should let my hobby be my hobby.
es: Otros dicen que deje mi hobby solo como hobby.

source: Even my close friends are pushing me into office jobs, saying I should cook in my free time.
es: Incluso mis amigos más cercanos me presionan con trabajos de oficina, que solo cocine en mi tiempo libre.

source: My parents won't pay for culinary school because they say I won't make a career from it.
es: Mis padres no me pagan una escuela culinaria porque dicen que no puedo hacer una carrera de esto.

source: But cooking's the only thing I've ever been passionate about.
es: Pero cocinar es lo único que me apasiona.

source: If I can't pursue my dream of cooking I think I just won't pursue any dreams at all.
es: Si no puedo seguir mi sueño de ser un chef, entonces no puedo seguir ningún sueño.

source: I'll just sit on my butt all day reminiscing of days where I also sat on my butt.
es: Estaría sentado sin hacer nada todo el día recordando días donde también no hacía nada.

source: Well. ...It would be a shame for someone like you to sit on your butt.
es: Bueno. ...Sería una lástima que alguien como tú se la pase sentado sin hacer nada.

source: (sigh) This is probably a mistake. But why don't you show me what you've learned so far.
es: (suspiro) Puede que esto sea un error. Por qué no me enseñas lo que aprendiste hasta ahora.

source: Really? Do you mean it?
es: ¿En serio? ¿Lo dices de verdad?

source: After waking from a weirdly informative cooking dream, #player# left in a hurry to find the chef they dreamt about.
es: Después de despertarse de un extrañamente informativo sueño sobre cocina, #player# sale apurado a encontrar el chef de su sueño.

source: Oh! Wait! ...You're leaving without making your breakfast?
es: ¡Oh, espera! ...¿Te estás yendo sin preparar el desayuno?

source: Oh, sure! I'm not really hungry.
es: ¡Oh, sí! No tengo mucha hambre.

source: ...So I guess... You're leaving without making my breakfast too?
es: ...Entonces supongo... ¿Que también te estás yendo sin preparar mi desayuno?

source: ...Um that's okay! ...Because you're not really hungry?
es: ...Um, ¡Sí!... Porque tampoco tienes hambre, ¿No?

source: Sorry, I'll make it up to you! I'll make an extra big lunch as a thank you for being such an awesome roommate.
es: Perdón, ¡Ya lo hago! También voy a hacer un almuerzo extra grande como agradecimiento por ser un compañero de cuarto genial.

source: ...It's just, I had a dream last night where a chef taught me some advanced cooking techniques...
es: ...Es que, en la última noche tuve un sueño donde un chef me enseñaba técnicas avanzadas de cocina...

source: Ooooooh! ...So who is this mystery man? ...Do they have a name?
es: ¡Ooooooh! ...¿Quién es ese hombre misterioso? ...¿Tiene nombre?

source: The man was...
es: El hombre era...

source: The woman was...
es: La mujer era...

source: The man, um, woman was...
es: El hombre, um, mujer era...

source: Slow down, nosy!
es: ¡Pero que curioso eres!

source: ...So their name was 'Turbo', and I THINK they were a man! ...But I have this weird intuition -
es: ...Su nombre era "Turbo", ¡y CREO que era un hombre! ...Pero tengo esta rara sensación -

source: I think if I run into the forest in a random direction for a long time, I might be lucky enough to bump into them? I guess!
es: Creo que si corro por el bosque en una dirección aleatoria por mucho tiempo, ¿podría tener suerte y cruzármelo? ¡Supongo!

source: Well gosh hurry along then! I wouldn't want to get in between you and the man of your dreams!
es: ¡Bueno, está bien, entonces apúrate! ¡No me gustaría entrometerme entre tú y el hombre de tus sueños!

source: ...So their name was 'Turbo', and I THINK they were a woman! ...But I have this weird intuition -
es: ...Su nombre era "Turbo", ¡y CREO que era una mujer! ...Pero tengo esta rara sensación -

source: Well gosh hurry along then! I wouldn't want to get in between you and the woman of your dreams!
es: ¡Bueno, está bien, entonces apúrate! ¡No me gustaría entrometerme entre tú y la mujer de tus sueños!

source: ...So their name was 'Turbo', and I don't actually know if they were a man or woman! ...But I have this weird intuition -
es: ...Su nombre era "Turbo", ¡y no estoy seguro si era un hombre o una mujer! ...Pero tengo esta rara sensación -

source: Well gosh hurry along then! I wouldn't want to get in between you and the man slash woman of your dreams!
es: ¡Bueno, está bien, entonces apúrate! ¡No me gustaría entrometerme entre tú y el hombre o mujer de tus sueños!

source: ...Okay, nosy! I barely know anything about them, except their name was 'Turbo'. ...But I have this weird intuition -
es: ...¡Cálmate, curioso! Apenas se algo sobre este chef, excepto que se llama "Turbo". ...Pero tengo esta rara sensación -

source: What! Don't say it like that...
es: ¡Qué! No lo digas así...

source: Don't get lost in the forest! Have fun on your timber date.
es: ¡No te pierdas en el bosque! Que te diviertas con tu cita no completamente a ciegas.

source: ...Ugh. ...Come to think of it, you can make your own lunch.
es: ...Ugh. ...Pensándolo bien, puedes hacer tu propio almuerzo.

source: Wow Tunathy, you brought a sketchbook to the table? I'd be worried about getting food on it...
es: Wow Tunathy, ¿trajiste una libreta de dibujo a la mesa? Estaría preocupado si le cae algo de comida...

source: Oh this isn't my good sketchbook. I just draw in it for practice...
es: Oh esta no es mi libreta buena. Solo dibujo aquí para practicar...

source: Anyway, it's okay. ...You don't need to feign interest in my personal life. I'm really just here to eat...
es: De cualquier modo, está bien. No necesitas fingir interés en mi vida personal. Solo estoy acá para comer...

source: Are these your drawings?
es: ¿Estos son tus dibujos?

source: They're pretty good
es: Son muy buenos

source: They're so messy
es: Son confusos

source: Wow! They're amazing
es: ¡Wow! Son geniales

source: It's like those gorillas
es: Es como esos gorilas

source: Wow, these look amazing!!
es: ¡¡Wow, se ven asombrosos!!

source: What? ...Really?
es: ¿Qué? ...¿De verdad?

source: I had no idea you were this talented! Do you have anything else I can look at?
es: ¡No tenía idea de lo talentoso que eras! ¿Tienes algo más que pueda ver?

source: I... I don't know how to react to positive attention, can you say something mean?
es: Yo... Yo no se como reaccionar a una atención positiva, ¿puedes decir algo malo?

source: I wish I could draw like that...
es: Me encantaría dibujar así...

source: Ack! ...Can't ...breathe!
es: ¡Ack! ...No ...Puedo ...¡Respirar!

source: They're pretty good! I especially like that one.
es: ¡Son muy buenos! Me gusta en especial ese de ahí.

source: I mean it's obvious these are just for practice, but the underlying technique is there. You have such a cool style!
es: Es obvio que son solo de práctica, pero se ve que hay técnica. ¡Tienes un estilo muy bueno!

source: Ohhhh okay, so it's just like... a bunch of messy sketches! Do you have any actual drawings in here?
es: Ohhhh sí, es como... ¡un montón de dibujos confusos sin terminar! ¿Tienes algún dibujo terminado ahí?

source: Oh! ...Yeah, I'm sorry. This one's just for me. There's nothing finished.
es: ¡Oh! ...Sí, perdón. Son solo para mi. No tengo nada terminado.

source: It's just I've seen sketchbooks from like... REAL artists where it's these elaborately detailed pages...
es: Es que vi libretas de dibujos de... artistas DE VERDAD donde elaboraban páginas más detalladas...

source: Y-yeahhhh, I know. ...This is just something I sketch in for practice.
es: S-síiiiii, ya se... Esto es solo una libreta donde dibujo para practicar.

source: I'm kind of surprised you showed this to me! These just look like something you'd throw away. ...No offense!
es: ¡Estoy muy sorprendido que me hayas mostrado esto! Esto parece algo que tirarías a la basura. ...¡Sin ofender!

source: Right, no! Um... None taken...
es: ¡Claro! Um... Sin ofender...

source: Oh wow, this reminds me of -- not to change the subject! But I read about this zoo where they had a donation of paintbrushes,
es: Oh wow, esto me recuerda a -- ¡No quiero cambiar el tema! Pero recuerdo leer que a un zoológico le habían donado pinceles,

source: And they put them in the primate enclosure and let the gorillas paint. Did you ever hear about that?
es: Y los pusieron en las instalaciones de los primates y dejaron a los gorilas pintar. ¿Alguna vez escuchaste eso?

source: Oh, hmmmmm! ...Yeah I think that rings a bell.
es: ¡Oh, hmmmmm! ...Sí, creo que me suena.

source: I mean their paintings were just complete and utter garbage, obviously! Because they're just gorillas.
es: ¡Recuerdo que sus dibujos eran un completo desastre, obviamente! Porque solo eran gorilas.

source: Well yeah, that makes sense.
es: Bueno sí, eso tiene sentido.

source: They don't have the same kind of dexterity or spatial awareness that we take for granted.
es: Ellos no tienen el mismo nivel de destreza o conciencia espacial que nosotros tenemos.

source: Well anyway... I don't know why that came to mind all of a sudden! Thanks for showing me your sketchbook.
es: Como sea... ¡No se porqué se me vino eso a la cabeza de la nada! Gracias por mostrarme tu libreta.

source: Oh it's you, Mara! Don't worry, this one will be on the house~
es: ¡Oh, Mara, eres tú! No te preocupes, esta vez, invita la casa~

source: No that's alright, I don't mind paying! I just love that you're hitting it off so well with Fat Sensei.
es: ¡No, está bien, no me importa pagar! Solo me encanta ver que te estés llevando tan bien con Fat Sensei.

source: So... When are you going to introduce me to your boyfriend?
es: Entonces... ¿Cuándo vas a presentarme a tu novio?

source: So... When are you going to introduce me to your girlfriend?
es: Entonces... ¿Cuándo vas a presentarme a tu novia?

source: So... When are you going to introduce me to your boyfriend and/or girlfriend?
es: Entonces... ¿Cuándo vas a presentarme a tu novio y/o novia?

source: What!? We're not dating...
es: ¿¡Qué!? No estamos saliendo...

source: Oh it's fine, I can introduce myself. Hello, I'm Fat Sensei, #player.possessive# partner.
es: Oh está bien, puedo presentarme por mi cuenta. Hola, soy Fat Sensei, compañero de #player#.

source: My BUSINESS partner.
es: Compañero DE NEGOCIOS.

source: ...Uhh but anyways Fat Sensei, this is my roommate Mara! Well, I don't know if we're technically roommates?
es: ...Bueno, Fat Sensei, ¡este es mi compañero de cuarto Mara! ¿Aunque no se si técnicamente seguimos siendo compañeros de cuarto?

source: I cook for them sometimes, and in exchange they let me sleep in their guest room for free.
es: Le cocinaba a veces, y como agradecimiento me dejaba dormir gratis en su cuarto de invitados.

source: Wait. ...Are you serious!?!
es: Espera. ¡¿¡Hablas en serio!?!

source: Mara, I mean this in the nicest way possible. I've tasted #player.possessive# cooking. ...They should be paying rent.
es: Mara, lo voy a decir de la forma más amable posible. Yo probé la comida de #player#. ...Y creo que debió pagar renta.

source: Oh? ...Th-thank you!
es: ¿Oh? ...¡Gr-gracias!

source: WHAT?! Don't thank them for that!
es: ¡¿QUÉ?! ¡No le des las gracias por eso!

source: I'm sorry! You have a very nice boyfriend. ...Sorry! I mean, 'Partner'.
es: ¡Perdón! Tienes un novio muy amable. ...¡Perdón! Digo, "Compañero".

source: I'm sorry! You have a very nice girlfriend. ...Sorry! I mean, 'Partner'.
es: ¡Perdón! Tienes una novia muy amable. ...¡Perdón! Digo, "Compañero".

source: I'm sorry! You have a very nice boyfriend and/or girlfriend. ...Sorry! I mean, 'Partner'.
es: ¡Perdón! Tienes un/a novio/a muy amable. ...¡Perdón! Digo, "Compañero".

source: ... (grumble) ...
es: ... (refunfuño) ...

source: So each table should have their food done all at once. Which means when you're cooking it, you should-
es: Así que deberías de servir todo junto a cada mesa cuando la comida esté hecha. Lo que significa que, cuando cocines, tú deberías-

source: You don't gotta train me, I've got plenty of experience with this sorta thing.
es: No necesitas entrenarme, tengo mucha experiencia en este tema.

source: Oh, like... restaurant experience?
es: Oh... ¿experiencia en restaurantes?

source: Nah nah, failed business experience.
es: Nah nah, experiencia en negocios fallidos.

source: Failed business experience!?
es: ¿¡Experiencia en negocios fallidos!?

source: But we just started!
es: ¡Pero si acabamos de comenzar!

source: You've never worked in a kitchen?
es: ¿Nunca trabajaste en una cocina?

source: ...Wait, can you cook?
es: ...Espera, ¿puedes cocinar?

source: We're not failing!
es: ¡No vamos a fallar!

source: We just got started! We're not failing...
es: ¡Pero si acabamos de comenzar! No vamos a fallar...

source: Oh sure sure! I'm sure your first million is just around the corner. Take my advice though-
es: ¡Oh claro claro! Estoy seguro que tu primer millón está a la vuelta de la esquina. Toma mi consejo-

source: What, you think a kitchen's any different than working a call center or mortuary? Take my advice-
es: ¿Que, crees que hay diferencia en trabajar en una cocina y en un call center o una morgue? Toma mi consejo-

source: Wait... do you know how to cook?
es: Espera... ¿Sabes cocinar?

source: I'm not the best, but I'll pick up what I need to. It's not the cooking that's the important part! Take my advice-
es: No soy el mejor, pero agarro lo que necesito. ¡La parte importante no es la cocina! Toma mi consejo-

source: Pshh! Our business isn't failing!
es: ¡Pshh! ¡Nuestro negocio no está fallando!

source: The secret is to half-ass your job, take on JUST enough responsibility to look busy while staying out of trouble.
es: El secreto es hacer todo a medias, solo toma la responsabilidad JUSTA para parecer ocupado y así no te metes en líos.

source: That way when things start to go south, you look like a team player and not a liability! It's a delicate balance.
es: ¡Así, cuando las cosas empiecen a salir mal, te verás como un miembro del equipo y no como una verdadera carga! Es un delicado equilibrio.

source: At least let me teach you the BASICS of cooking...
es: Déjame enseñarte al menos lo BÁSICO de la cocina.

source: Pshh look at you, you little try-hard! You're not gonna last three weeks at a place like this...
es: Pshh ¡mírate, cómo te esfuerzas! No vas a durar ni tres semanas en un lugar como este...

source: Hey Tunathy! ...So how's your art doing?
es: ¡Hey Tunathy! ...¿Cómo va tu arte?

source: Ohh well... I'm still struggling to find customers.
es: Ohh bien... Todavía me cuesta encontrar clientes.

source: But on the bright side, having no work to do gives me plenty of free time to succumb to my irrepressible ennui...
es: Pero en el lado bueno, no tener trabajo me deja mucho tiempo libre para entregarme a mi aburrimiento infinito...

source: Marketing yourself is tough
es: El marketing es difícil

source: Enjoy the free time
es: Disfruta de tu tiempo libre

source: All art is subjective, but...
es: Todo arte es subjetivo, pero...

source: Well, marketing yourself is tough. I hate doing that kind of stuff, it almost feels arrogant you know?
es: Bueno, hacer marketing propio es difícil. Odio hacer todo ese tipo de cosas, hasta se siente arrogante ¿sabes?

source: One trick some people use is to pretend they're talking about someone else, instead of talking about themselves!
es: Un truco que la gente usa es pretender que están hablando de alguien más, ¡cuando en realidad hablan de ellos mismos!

source: But even then, it just takes practice really.
es: Pero aún así, solo se necesita práctica.

source: Free time's kind of a blessing in itself! It gives you more time to practice and hone your skills.
es: ¡El tiempo libre es una bendición! Te da más tiempo para practicar y mejorar tus habilidades.

source: In a few years when you're bombarded with customers, I'm sure you'll wish you had this kind of opportunity again.
es: En algunos años cuando estés bombardeado con clientes, estoy seguro que vas a desear tener esta oportunidad otra vez.

source: Well... All art is subjective.
es: Bueno... Todo arte es subjetivo.

source: ...If people don't like your art, then that means your art is subjectively bad! I wouldn't take it too personally.
es: ...Si la gente no le gusta tu arte, ¡entonces significa que tu arte es subjetivamente malo! No deberías tomártelo personal.

source: I don't... ...Why are you paying attention to me? Is it because you want me to tip more?
es: Yo no... ¿Por qué me estás prestando atención? ¿Es porque quieres más propina?

source: What's this? I only heard half of the conversation. But yes, we want you to give us more money.
es: ¿Qué pasó? Solo escuché la mitad de la conversación. Pero sí, queremos que nos des más dinero.

source: No we don't! Tunathy, I'm just trying to...
es: ¡No, no queremos! Tunathy, solo estoy tratando de...

source: Cheer you up
es: Animarte

source: Help you out
es: Ayudarte

source: Be your friend
es: Ser tu amigo

source: I'm just trying to be your friend!
es: ¡Solo estoy tratando de ser tu amigo!

source: Wait... so you're expressing a genuine interest in my personal life? I'm so confused...
es: Espera... ¿Entonces estás expresando interés genuino en mi vida personal? Estoy tan confundido...

source: I'm just trying to help you out.
es: Solo estoy tratando de ayudarte.

source: Wait... you're expressing a genuine interest in my well-being? I'm so confused...
es: Espera... ¿Entonces estás expresando interés genuino en mi bienestar? Estoy tan confundido...

source: I'm just trying to cheer you up!
es: ¡Solo estoy tratando de animarte!

source: Sorry. ...What #player# is trying to explain is, hmm....
es: Perdón. ...Lo que #player# trata de explicar es, hmm...

source: Friends, TRUE friends. True friends give each other money all the time! They don't even think about it.
es: Amigos, VERDADEROS amigos. ¡Los verdaderos amigos le dan dinero a otros amigos todo el tiempo! Ni siquiera lo piensan.

source: You should give us more money, and maybe we'll like you more.
es: Deberías darnos más dinero, y tal vez nos agradarías más.

source: Well... Sure, that seems fair, let's see how much I got...
es: Bueno... Sí, parece justo, déjame ver cuánto tengo...

source: That's not right at all!!! Get out of here.
es: ¡¡¡Eso no está nada bien!!! Sal de aquí.

source: (sigh) Don't listen to Fat Sensei! They don't know what they're talking about. Anyways where were we...
es: (suspiro) ¡No escuches a Fat Sensei! No sabe de lo que está hablando. De todas formas, estábamos en...

source: Is five dollars okay?
es: ¿Cinco dólares está bien?

source: So how are you two related? Are you siblings, or...
es: ¿Entonces, cuál es la relación entre ustedes? Son familiares, o...

source: Oh, no! We're not related.
es: ¡Oh, no! No somos familiares.

source: Really? Because the resemblance is uncanny.
es: ¿En serio? Porque el parecido es asombroso.

source: No no. No relation, we're just partners.
es: No no. Sin relación, solo somos compañeros.

source: BUSINESS partners.
es: Compañeros DE NEGOCIOS.

source: Well, that seems redundant...
es: Bueno, eso parece redundante...

source: It ISN'T.
es: NO lo es.

source: Hmm, so long have you been together?
es: Hmm, ¿y hace cuánto están juntos?

source: Been together IN BUSINESS.
es: Juntos EN EL NEGOCIO.

source: Umm well anyway, I'm going to take off! Good luck with your... ...business.
es: Umm bueno no importa, ¡Me tengo que ir! Buena suerte con su... ...negocio.

source: Our BUSINESS business.
es: Nuestro negocio DE NEGOCIOS.

source: Wait -- nope. That one was okay.
es: Espera -- no. Esa estaba bien.

source: Ahhh Sidger, we had a complaint at table three. Apparently the fudge drops were overdone.
es: Ahhh Sidger, tenemos una queja en la mesa tres. Aparentemente el mousse de chocolate estaba muy cocinado.

source: Nuh-uh, that wasn't me. That was #player.possessive# fault.
es: Nuh-uh, no fui yo. Fue la culpa de #player#.

source: What? No it wasn't!
es: ¿Qué? ¡No es cierto!

source: Hmm, I see. #player#, try to focus more. These careless mistakes of yours are making you a real liability.
es: Hmm, ya veo. #player#, trata de concentrarte más. Estos pequeños errores te están convirtiendo en una verdadera carga.

source: Sidger, you're so conniving!
es: ¡Sidger, eres un mentiroso!

source: Sensei, you're so gullible!
es: ¡Sensei, eres muy crédulo!

source: This has nothing to do with me
es: Yo no tengo nada que ver en esto

source: Look who's at the stove!
es: ¡Mira quien está en el horno!

source: Sidger, you conniving little... munch!
es: Sidger, manipulador mentiroso pedazo de... ¡Mermelada!

source: If you're gonna lie, at least lie about something that matters! Not just, overcooking this one stupid-
es: ¡Si vas a mentir, al menos miente con algo que si importe! Algo como, quién cocinó de más el estúpido-

source: Sensei, how are you this gullible!?
es: Sensei, ¿cómo puedes ser tan crédulo?
