Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: Stop me if you've heard this one before...
es: Pueden hacer mucho daño cuando quieren...

source: Slow Service
es: Servicio Lento

source: May... I... take... your... order...?
es: ¿Puedo... Tomar... Su... Orden...?

source: Slower Service
es: Servicio Más Lento

source: Snack Box Blitz
es: Bombardeo De Snacks

source: Everyone's in a hurry today. Get those cakes out!
es: Hoy todos están apurados. ¡Saca las tortas del horno!

source: Square Curse
es: Maldición Cuadrada

source: ...And they don't stop coming!
es: ...¡Y no paran de venir!

source: It says in this cookbook it takes a long time to rise.
es: Dice en la receta que va a seguir levándose por mucho tiempo.

source: Strawberry Shortcut
es: Postres Rellenos

source: Surprise Guests
es: Invitados Sorpresa

source: Tempting Jellies
es: Gelatinas Tentadoras

source: Throw caution to the wind this once!
es: ¡El que no arriesga, no gana!

source: The Last ¥100
es: Los Últimos ¥100

source: Why is the last mile the hardest mile?
es: ¿Por qué los últimos metros son los más difíciles?

source: Three Course Meal
es: Tres Platos De Comida

source: It's important to bring out all three courses at once! ...Or is that something else...
es: ¡Es importante llevar los tres platos al mismo tiempo! ...O eso era otra cosa...

source: Three Nights
es: Tres Noches

source: I'm not afraid of the dark! It's just very annoying...
es: ¡No le tengo miedo a la oscuridad! Solo que es muy molesta...

source: Traffic Jam
es: Trágate El Tráfico

source: Nobody knows what the 'H' stands for! We just know it is annoying and gets in the way...
es: ¡Nadie sabe lo que significa la "H"! Solo sabemos que es molesta y está en medio del camino...

source: Another Traffic Jam
es: Trágate El Tráfico Otra Vez

source: An even bigger, and even slower H! ...But what does the H stand for?
es: ¡Ahora la H es más grande e incluso más lenta! ...¿Pero qué significa la H?

source: Triangle Curse
es: Maldición Triangular

source: Squares and triangles. Together at last!
es: Cuadrados y triángulos ¡Juntos al fin!

source: Tulip
es: Tulipán

source: It belongs in a museum! Or maybe on the refrigerator.
es: ¡Merece estar en un museo! O tal vez en un refrigerador.

source: Tunnel Snakes
es: Serpientes de Túnel

source: Asparagus. Why'd it have to be asparagus?
es: Espárragos. ¿Por qué tenían que ser espárragos?

source: Two Box Buffet
es: Buffet Dos Cajas

source: Surely, six columns should be enough for anybody!
es: ¡De seguro seis columnas debe ser suficiente para todos!

source: Up In Smoke
es: Humo Arriba

source: I don't love carrots, but I promise to hate them slightly less if they stay over there...
es: No me gustan las zanahorias, pero prometo odiarlas un poco menos si se quedan de ese lado...

source: Wall Greens
es: Paredes Verdes

source: Asparagus evolved its disgusting spines as a defense against being eaten.
es: Los espárragos evolucionaron sus espinas asquerosas como defensa para que no se los coman.

source: Wedge
es: Tope

source: A fun shape to climb, if only it wasn't so sticky...
es: Una forma divertida para escalar, si solo no fuese tan pegajosa...

source: Marathon: Expert (300 lines)
es: Maratón: Experto (300 líneas)

source: A grueling test of endurance ramping up to instant gravity! Can you clear 300 lines?
es: ¡Una agotadora prueba de resistencia llegando a gravedad instantánea! ¿Puedes limpiar 300 líneas?

source: Marathon: Hard (200 lines)
es: Maratón: Difícil (200 líneas)

source: A true test of endurance with faster pieces than before! Can you clear 200 lines?
es: ¡Una dura prueba de resistencia con piezas aún más rápidas! ¿Puedes limpiar 200 líneas?

source: Marathon: Master (500 lines)
es: Maratón: Maestro (500 líneas)

source: An impossible test of endurance for true Turbo Fat masters! Can you clear 500 lines?
es: ¡Una imposible prueba de resistencia para los maestros de Turbo Fat! ¿Puedes limpiar 500 líneas?

source: Marathon: Normal (100 lines)
es: Maratón: Normal (100 líneas)

source: A test of endurance against faster and faster pieces! Can you clear 100 lines?
es: ¡Una prueba de resistencia contra piezas cada vez más rápidas! ¿Puedes limpiar 100 líneas?

source: Sandbox: Expert
es: Libre: Experto

source: Practice with faster pieces! There is no way to win or lose this mode.
es: ¡Practica con piezas rápidas! No hay forma de ganar o perder en este modo.

source: Sandbox: Master
es: Libre: Maestro

source: Practice with instant gravity! There is no way to win or lose this mode.
es: ¡Practica con gravedad instantánea! No hay forma de ganar o perder en este modo.

source: Sandbox: Normal
es: Libre: Normal

source: Just relax! There is no way to win or lose this mode.
es: ¡Solo relájate! No hay forma de ganar o perder en este modo.

source: Sprint: Expert (3:00)
es: Carrera: Experto (3:00)

source: Earn as much money as you can in 3:00. Use the faster pieces to set a high score!
es: Consigue todo el dinero que puedas en 3:00. ¡Usa piezas rápidas para conseguir una mejor puntuación!

source: Sprint: Normal (2:30)
es: Carrera: Normal (2:30)

source: Earn as much money as you can in 2:30!
es: ¡Consigue todo el dinero que puedas en 2:30!

source: Ultra: Expert (¥3,000)
es: Ultra: Experto (¥3.000)

source: Earn ¥3,000 as fast as possible, with faster piece movement!
es: ¡Consigue ¥3.000 lo más rápido posible, con piezas muy rápidas!

source: Ultra: Hard (1,000¥)
es: Ultra: Difícil (1.000¥)

source: Earn ¥1,000 as fast as possible!
es: ¡Consigue ¥1.000 lo más rápido posible!

source: Earn ¥200 as fast as possible!
es: ¡Consigue ¥200 lo más rápido posible!

source: An escalating set of challenges. Finish in 6:00 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina en 6:00 para conseguir este rango!

source: An escalating set of challenges. Finish with ¥1,200 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥1.200 para conseguir este rango!

source: An escalating set of challenges. Finish with ¥1,000 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥1.000 para conseguir este rango!

source: An escalating set of challenges. Finish in 5:00 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina en 5:00 para conseguir este rango!

source: An escalating set of challenges. Finish in 3:00 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina en 3:00 para conseguir este rango!

source: An escalating set of challenges. Finish with ¥999 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥999 para conseguir este rango!

source: An escalating set of challenges. Finish with ¥2,000 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥2.000 para conseguir este rango!

source: An escalating set of challenges. Finish with ¥200 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥200 para conseguir este rango!

source: An escalating set of challenges. Finish with ¥2,500 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥2.500 para conseguir este rango!

source: An escalating set of challenges. Finish with ¥500 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥500 para conseguir este rango!

source: An escalating set of challenges. Finish with ¥5,000 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥5.000 para conseguir este rango!

source: An escalating set of challenges. Finish with in 5:00 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina en 5:00 para conseguir este rango!

source: An escalating set of challenges. Finish with ¥3,000 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥3.000 para conseguir este rango!

source: Master
es: Maestro

source: An escalating set of challenges. Finish with ¥10,000 to achieve this rank!
es: Una serie de retos cada vez más difíciles. ¡Termina con ¥10.000 para conseguir este rango!

source: Basic Techniques
es: Técnicas básicas

source: Learn to clear lines, to make snack boxes and to squish pieces.
es: Aprenda a limpiar líneas, hacer cajas de snacks y aplastar piezas.

source: Make Cakes
es: Hacer Tortas

source: Learn all eight different cake box recipes.
es: Aprenda todas las ocho recetas de caja de tortas.

source: Build Combos
es: Construir Combos

source: Learn how combos work, and learn to make snack boxes and cake boxes during your combos.
es: Aprenda como funcionan los combos y a hacer cajas de snacks y tortas durante tus combos.

source: Meet Spins
es: Conoce Los Giros

source: Learn to spin and flip pieces in tight spaces.
es: Aprenda a rotar y girar piezas en espacios chicos.

source: Squish and Recover
es: Aplastar y Recuperación

source: Learn how squish moves work and when to use them.
es: Aprenda como funciona la mecánica de aplastar piezas y cuando usarla.

source: Space
es: Espacio

source: QuoteDbl
es: Comillas

source: NumberSign
es: Numeral

source: Dollar
es: Dolar

source: Percent
es: Porcentaje

source: Ampersand
es: Ycomercial

source: Apostrophe
es: Apóstrofe

source: ParenLeft
es: ParénIzq

source: ParenRight
es: ParénDer

source: Asterisk
es: Asterisco

source: Plus
es: Más

source: Comma
es: Coma

source: Minus
es: Menos

source: Period
es: Punto

source: Slash
es: Guion

source: Colon
es: DosPuntos

source: Semicolon
es: PuntoComa

source: Less
es: Menor

source: Equal
es: Igual

source: Greater
es: Mayor

source: Question
es: Interr

source: At
es: Arroba

source: BracketLeft
es: CorcheteIzq

source: BackSlash
es: BarraInv

source: BracketRight
es: CorcheteDer

source: AsciiCircum
es: Circunflejo

source: UnderScore
es: GuionBajo

source: QuoteLeft
es: ComillaIzq

source: BraceLeft
es: LlaveIzq

source: Bar
es: Barra

source: BraceRight
es: LlaveDer

source: NoBreakSpace
es: CajaAbierta

source: ExclamDown
es: ExclamInv

source: Sterling
es: LibraEst

source: Currency
es: DolarPeso

source: BrokenBar
es: BarraVert

source: Section
es: Sección

source: Diaeresis
es: Diéresis

source: Ordfeminine
es: OrdFemenino

source: GuillemotLeft
es: AngularIzq

source: NotSign
es: Negación

source: Hyphen
es: Guion

source: Registered
es: Reg

source: Macron
es: Macrón

source: Degree
es: Grado

source: PlusMinus
es: MásMenos

source: TwoSuperior
es: DosSuperior

source: ThreeSuperior
es: TresSuperior

source: Acute
es: Agudo

source: Paragraph
es: Calderón

source: PeriodCentered
es: PuntoCentr

source: OneSuperior
es: UnoSuperior

source: Masculine
es: Masculino

source: GuillemotRight
es: AngularDer

source: OneQuarter
es: UnCuarto

source: OneHalf
es: UnMitad

source: ThreeQuarters
es: TresCuartos

source: QuestionDown
es: InterrInv

source: Aacute
es: Aagudo

source: AcircumFlex
es: Acircunflejo

source: Adiaeresis
es: Adiéresis

source: Aring
es: Aanillo

source: Eacute
es: Eagudo

source: Ecircumflex
es: Ecircunflejo

source: Ediaeresis
es: Ediéresis

source: Iacute
es: Iagudo

source: Icircumflex
es: Icircunflejo

source: Idiaeresis
es: Idiéresis

source: Oacute
es: Oagudo

source: Ocircumflex
es: Ocircunflejo

source: Odiaeresis
es: Odiéresis

source: Multiply
es: Miltiplicación

source: Ooblique
es: Ooblicua

source: Uacute
es: Uagudo

source: Ucircumflex
es: Ucircunflejo

source: Udiaeresis
es: Udiéresis

source: Yacute
es: Ytilde

source: Division
es: División

source: Ydiaeresis
es: Ydiéresis

source: BackSpace
es: Retroceso

source: Enter
es: Intro

source: Kp Enter
es: Numpad Intro

source: Delete
es: Suprimir

source: Pause
es: Pausa

source: Print
es: ImprPant

source: SysReq
es: PetSis

source: Clear
es: Supr

source: Home
es: Inicio

source: End
es: Fin

source: Left
es: Izquierda

source: Up
es: Arriba

source: Right
es: Derecha

source: Down
es: Abajo

source: PageUp
es: AvPág

source: PageDown
es: RePág

source: CapsLock
es: BloqMayus

source: NumLock
es: BloqNum

source: ScrollLock
es: BloqDespl

source: Super L
es: Super Izq

source: Super R
es: Super Der

source: Menu
es: Menú

source: Hyper L
es: Hiper Izq

source: Hyper R
es: Hiper Der

source: Help
es: Ayuda

source: Direction L
es: Dirección Izq

source: Direction R
es: Dirección Der

source: Back
es: Atrás

source: Forward
es: Avanzar

source: Stop
es: Detener

source: Refresh
es: Refrescar

source: MediaPrevious
es: MediaPrev

source: HomePage
es: PágInicio

source: Favorites
es: Favoritos

source: Search
es: Buscar

source: StandBy
es: Suspensión

source: Kp Multiply
es: Numpad Asterisco

source: Kp Divide
es: Numpad Barra

source: Kp Subtract
es: Numpad Menos

source: Kp Period
es: Numpad Punto

source: Kp Add
es: Numpad Más

source: Kp 0
es: Numpad 0

source: Kp 1
es: Numpad 1

source: Kp 2
es: Numpad 2

source: Kp 3
es: Numpad 3

source: Kp 4
es: Numpad 4

source: Kp 5
es: Numpad 5

source: Kp 6
es: Numpad 6

source: Kp 7
es: Numpad 7

source: Kp 8
es: Numpad 8

source: Kp 9
es: Numpad 9

source: Chapter Select
es: Selección de Capítulo

source: LOOK WHAT WE DID
es: MIRA LO QUE HICIMOS

source: Served:
es: Servidos:

source: Steps:
es: Pasos:

source: Earned:
es: Ganado:

source: Time:
es: Tiempo:

source: CONGRATULATIONS
es: FELICIDADES

source: WE DID IT
es: LO HICIMOS

source: HOORAY
es: HURRA

source: FANTASTIC
es: FANTÁNTISCO

source: YAHOO FOR US
es: BIEN POR NOSOTROS

source: GOSH! WE'RE SO COOL
es: ¡WOW! SOMOS GENIALES

source: WELL HOORAY
es: HURRA HURRA

source: AMAZING
es: INCREÍBLE

source: OH! WHAT A DAY
es: ¡OH! QUE DÍA

source: THAT'S FINE
es: ESTÁ BIEN

source: LET'S GO HOME
es: VAMOS A CASA

source: OH DEAR WHAT HAPPENED
es: OH QUE PASÓ

source: OH! NO! GO ON TRYING
es: ¡OH! ¡NO! SIGUE INTENTANDO

source: GOSH THAT'S NOT GOOD
es: ¡WOW! ESO NO ESTÁ BIEN

source: Oh bother
es: Oh hermano

source: Hello
es: Hola

source: Most of the Turbo Fat locations gradually developed a loyal following of hungry customers, except for Merrymellow Marsh where business was unusually slow. Fat Sensei and Spira were on their way to get to the bottom of this mystery.
es: La mayoría de las sucursales de Turbo Fat ganaron leales seguidores de hambrientos clientes, excepto en Ciénaga de Malvaviscos donde el negocio estaba inusualmente lento. Fat Sensei y Spira están en camino a descubrir el origen de este misterio.

source: Completion:
es: Completado:

source: Overall grade:
es: Grado promedio:

source: Proudly made with
es: Orgullosamente hecho con

source: Created by:
es: Creado por:

source: Game design, programming, graphics and sound:
es: Diseño de juego, programación, gráficos y sonido:

source: Music:
es: Música:

source: Spanish Localization:
es: Localización al Español:

source: Testing:
es: Testeo:

source: Special thanks:
es: Agradecimientos especiales:

source: #wall_of_text# #player# and #sensei# started this journey with just one moderately successful restaurant and a dream. But after a long tireless journey, they had several more moderately successful restaurants. ...And a plaque.
es: #wall_of_text# #player# y #sensei# comenzaron su aventura con solo un restaurante moderadamente exitoso y un sueño. Pero luego de un largo e incansable viaje, obtuvieron más restaurantes moderadamente exitosos. ...Y una placa.

source: #wall_of_text# As #player# looked out across the sea of loving friends and loyal customers, they reflected on those special individuals. ...Without whom, they may have never thought to purchase a plaque!
es: #wall_of_text# #player# miró al mar de grandes amigos y leales clientes, y se reflejó en aquellos individuos especiales. ...¡Sin ellos, #player# nunca podría haber pensado en comprar la placa!

source: Third party assets:
es: Recursos de terceros:

source: "2000 Game SFX Collection" by GameBurp at Soniss
es: "2000 Game SFX Collection" por GameBurp at Soniss

source: "Blogger Sans" by Sergiy Tkachenko
es: "Blogger Sans" por Sergiy Tkachenko

source: "Bosca Ceoil" by Terry Cavanagh
es: "Bosca Ceoil" por Terry Cavanagh

source: "Cartoon Voices" by Dawid Moroz, Soundholder Studio
es: "Cartoon Voices" por Dawid Moroz, Soundholder Studio

source: "Cooking Game" by Epic Stock Media at Soniss
es: "Cooking Game" por Epic Stock Media en Soniss

source: "Doorbell Pull Store Bell" by Maisonsonique at FreeSound.org
es: "Doorbell Pull Store Bell" por Maisonsonique en FreeSound.org

source: "FilmCow Royalty Free Sound Effects Library" by FilmCow
es: "FilmCow Royalty Free Sound Effects Library" por FilmCow

source: "Fredoka One" by Milena Brandao
es: "Fredoka One" por Milena Brandao

source: "GodotSteam" by GP Garcia
es: "GodotSteam" por GP Garcia

source: "Gut" by Tom "Butch" Wesley
es: "Gut" por Tom "Butch" Wesley

source: "Hanna Barbera SoundFX Library" by Hanna Barbera
es: "Hanna Barbera SoundFX Library" por Hanna Barbera

source: "Modak" by Ek Type
es: "Modak" por Ek Type

source: "Nikumaru" by Kato Masashi
es: "Nikumaru" por Kato Masashi

source: "Schoolbell" by Font Diner
es: "Schoolbell" por Font Diner

source: "TS-808 emulator" by Jonathan Murphy/Tactile Sounds
es: "TS-808 emulator" por Jonathan Murphy/Tactile Sounds

source: "Tracery" by Kate Compton
es: "Tracery" por Kate Compton

source: Settings
es: Configuración

source: Quit
es: Salir

source: Export Creature
es: Exportar Criatura

source: Save
es: Guardar

source: Goal
es: Meta

source: Good!
es: ¡Bien!

source: Start
es: Empezar

source: %s frame drops
es: frame drops: %s

source: %s step drops
es: step drops: %s

source: Customers
es: Clientes

source: Lines
es: Líneas

source: Pieces
es: Piezas

source: Money
es: Dinero

source: Time
es: Tiempo

source: All Clear!
es: ¡Todo Limpio!

source: Give Up
es: Rendirse

source: Skip
es: Omitir

source: Practice
es: Practicar

source: Retry
es: Reintentar

source: Ready?
es: ¿Listo?

source: Regret...
es: Que Pena...

source: Game over
es: Fin Del Juego

source: Finish!
es: ¡Se acabó!

source: You win!
es: ¡Victoria!

source: Continue
es: Continuar

source: Customer #%s
es: Cliente: #%s

source: Build a snack box by arranging a pentomino and a tetromino into a square!
es: ¡Haz una caja de snacks haciendo un cuadrado con un pentominó y un tetrominó!

source: Build a cake box by arranging 3 pentominos into a rectangle!
es: ¡Haz una caja de torta haciendo un rectángulo con 3 pentominós!

source: Build a cake box by arranging 3 tetrominos into a rectangle!
es: ¡Haz una caja de torta haciendo un rectángulo con 3 tetrominós!

source: Two different pieces with the same color can always make a square!
es: ¡Dos piezas diferentes del mismo color siempre pueden hacer un cuadrado!

source: A snack box scores 5 points per line, a cake box scores 10. Make lots of cakes!
es: Una caja de snacks son 5 puntos por línea, una caja de torta son 10. ¡Haz muchas tortas!

source: Combos can give you 20 bonus points for completing a line. Make lots of combos!
es: Los combos pueden darte 20 puntos extra por completar una línea. ¡Haz muchos combos!

source: Build a big combo by making boxes and clearing lines!
es: ¡Haz un combo grande haciendo cajas y limpiando líneas!

source: Making boxes keeps your combo going. You can keep your combo going forever!
es: Hacer cajas aumentan tu combo. ¡Puedes extender tu combo para siempre!

source: Clear lines to keep your combo going. Combos get you lots of money!
es: Limpiar líneas aumentan tu combo. ¡Los combos te dan mucho dinero!

source: When a piece locks, hold left or right to quickly move the next piece!
es: Cuando una pieza se asegure, ¡mantén izquierda o derecha para mover rápido la siguiente pieza!

source: When a piece locks, hold a rotate key to quickly rotate the next piece!
es: Cuando una pieza se asegure, ¡mantén el botón rotar para rotar rápido la siguiente pieza!

source: When a piece locks, hold both rotate keys to quickly flip the next piece!
es: Cuando una pieza se asegure, ¡mantén ambos botones de rotación para girar la siguiente pieza!

source: When a piece locks, hold up to quickly hard-drop the next piece!
es: Cuando una pieza se asegure, ¡mantén arriba para hacer una caída rápida con la siguiente pieza!

source: After a hard drop, tap 'down' to delay the piece from locking!
es: ¡Después de una caída rápida, toca "abajo" para que la pieza tarde en asegurarse!

source: Press 'down' to squish pieces past other blocks!
es: ¡Presiona "abajo" para aplastar piezas entre otras piezas!

source: Hardcore level cleared. Extra life awarded!
es: Nivel difícil completado. ¡Ganaste una vida extra!

source: Hint: %s
es: Pista: %s

source: Speed: %d
es: Velocidad: %d

source: Pieces: %d
es: Piezas: %d

source: Lines: %d
es: Líneas: %d

source: Boxes: %d
es: Cajas: %d

source: Pickups: %d
es: Recolectados: %d

source: Overall:
es: Promedio:

source: Single
es: Simple

source: Double
es: Doble

source: Quad
es: Cuádruple

source: Spin
es: Giro

source: Squish
es: Aplastado

source: Move
es: Mover

source: Soft Drop
es: Caída Lenta

source: Hard Drop
es: Caída Rápida

source: Rotate
es: Rotar

source: Arrows
es: Flechas

source: DPAD Left
es: DPAD Izquierdo

source: DPAD Right
es: DPAD Derecho

source: What have you done!? Click 'Settings' to reconfigure your controls, you silly goose!
es: ¿¡Qué has hecho!? Haz clic en 'Configuración' para reconfigurar tus controles, ¡tonto!

source: description
es: descripción

source: name
es: nombre

source: Move Left
es: Mover a la Izquierda

source: Move Right
es: Mover a la Derecha

source: Rotate Left
es: Rotar a la Izquierda

source: Rotate Right
es: Rotar a la Derecha

source: Line Clear
es: Limpiar Lineas

source: Snack Box
es: Caja de Snacks

source: Box Clear
es: Limpiar Caja

source: Squish Move
es: Aplastar Piezas

source: Snack Stack
es: Caja de Snacks

source: Cake Box
es: Caja de Torta

source: Make Box
es: Cajas Hechas

source: Welcome to Turbo Fat! You seem to already be familiar with this sort of game, so let's dive right in.
es: ¡Bienvenido a Turbo Fat! Parece que ya estás familiarizado con este tipo de juego, así que vamos a comenzar.

source: Try making a snack box by arranging two pieces into a square.
es: Intenta hacer una caja de snacks haciendo un cuadrado con dos piezas.

source: Next, try holding soft drop to squish pieces through these gaps.
es: Ahora, intenta mantener caída lenta para aplastar piezas entre estos espacios.

source: One last lesson! Try holding soft drop to squish and complete these boxes.
es: ¡Una última lección! Intenta mantener caída lenta para aplastar y completar estas cajas.

source: You're a remarkably quick learner. I think I hear some customers! See if you can earn ¥100.
es: Eres un aprendiz remarcablemente rápido ¡Creo que escucho algunos clientes! Veamos si puedes conseguir ¥100.

source: OH, MY!!!
es: ¡¡¡WOW!!!

source: Good job!
es: ¡Buen trabajo!

source: Nicely done!
es: ¡Bien hecho!

source: Impressive!
es: ¡Impresionante!

source: Oh! I thought that would be more difficult...
es: ¡Oh! Pensé que iba a ser más difícil...

source: Well done! Line clears earn ¥1. Maybe more if you can build a combo.
es: ¡Muy bien! Al limpiar líneas ganas ¥1. Tal vez más si consigues hacer un combo.

source: Clear a row by filling it with blocks.
es: Limpia una fila llenándola con bloques.

source: Try clearing a few box lines.
es: Intenta limpiar algunas líneas de cajas.

source: Well done! Box clears earn you five times as much money. Maybe more than that if you're clever.
es: ¡Muy bien! Al limpiar cajas ganas cinco veces más dinero. Tal vez más que eso si eres listo.

source: Oh my, you're not supposed to know how to do that! ...But yes, squish moves can help you out of a jam.
es: ¡Wow, se supone que no deberías saber eso! ...Pero sí, aplastar piezas puede ayudarte en un apuro.

source: Well done! Squish moves can help you out of a jam. They're also good for certain boxes.
es: ¡Bien hecho! Aplastar piezas puede ayudarte en un apuro. También son buenas para ciertas cajas.
