Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: A dumpy place like this? ...Are you talking about Fat Sensei?
es: ¿Un basurero? ...¿Te refieres a Fat Sensei?

source: Why would I be talking about Fat Sensei!?
es: ¿¡Por qué me estaría refiriendo a Fat Sensei!?

source: What!? ...I'm not a place! And I'm certainly not dumpy.
es: ¿¡Qué!? ...¡Yo no soy un lugar! Y mucho menos un basurero.

source: Yeah, they're not dumpy! ...And since when am I popular? I'm honestly surprised you've even heard of me!
es: ¡Sí, no es un basurero! ...¿Y desde cuándo soy popular? ¡Honestamente estoy sorprendido que hayas escuchado acerca de mi!

source: Heard of you!? After the whole Desert Q thing you're actually pretty legendary in certain circles!
es: ¿¡Escuchar acerca de ti!? ¡Después de la Ola del Desierto, eres casi legendario en algunos círculos!

source: ...You should get your name out there more. How do you feel about filming a cooking show? Just a few episodes! No pressure.
es: ...Deberías de mostrar más tu nombre. ¿Qué te parece hacer un show de cocina? ¡Solo unos episodios! Sin presión.

source: Yeah, let's do it
es: Sí, hagámoslo

source: I'll think about it
es: Debería pensarlo

source: No, I'm not interested
es: No, no estoy interesado

source: Sure, I'd love to do a cooking show! Well, when I'm here anyways.
es: ¡Claro, me encantaría hacer un show de cocina! Bueno, siempre que esté aquí.

source: When you're here? ...I mean... were you planning to be somewhere else?
es: ¿Siempre que estés aquí? ...Bueno... ¿Estabas pensando ir a otro lugar?

source: Well we've got a bunch of other locations! But I'll set aside the time whenever we're nearby.
es: ¡Es que tenemos muchas sucursales! Pero cuando esté por aquí podría darle tiempo.

source: Hmm I'll think about it. It sounds like a lot of work...
es: Hmm, debería de pensarlo. Suena a mucho trabajo...

source: Hmm no thanks, I'm already busy enough as is. I don't know where I'd find the time!
es: Hmm, no gracias, ya estoy muy ocupado con el restaurante. ¡No se dónde voy a encontrar el tiempo para eso!

source: Hmph yeah, figured as much. Why commit to something when you can just float through life? You're just like that tennis player...
es: Hmph, sí, ya entendí. ¿Para qué comprometerse a algo si puedes vivir en las nubes, no? Eres como ese jugador de tenis...

source: WHAT!? #player#, you should never let ANYBODY call you a tennis player!!! Stand up for yourself!
es: ¿¡QUÉ!? ¡¡¡#player#, nunca dejes que NADIE te llame un jugador de tenis!!! ¡¡¡Defiéndete!!!

source: I... ...what!?
es: Yo... ...¿¡Qué!?

source: You're doing this cooking show. No matter what!!! That will show them who's a tennis player!
es: ¡¡¡Pase lo que pase, vas a hacer ese show de cocina!!! ¡Vamos a mostrarle quién es un jugador de tenis!

source: I... I am!?!?!
es: ¡¿¡¿¡Yo... Lo voy a hacer!?!?!

source: I... I was already planning to!?!?!
es: ¡¿¡¿¡Yo... Ya lo estaba planeando!?!?!

source: So how did Turbo Fat get so popular anyway? ...Was it anything we can imitate here?
es: ¿Como es que Turbo Fat se hizo tan popular? ...¿Hay algo aquí que podamos imitar?

source: Oh just the usual stuff, marketing, word of mouth... Patience...
es: Oh, solo lo usual, marketing, el boca a boca... Paciencia...

source: Mmm, yes, marketing! King Frungle's been umm... reaching out to people! It's been going... alright.
es: ¡Mmm, sí, marketing! King Frungle ya está umm... ¡Llegando a la gente! Creo que va... Bien.

source: Yes yes, we're OBVIOUSLY already doing that stuff! We're not stupid, you know.
es: ¡Sí sí, nosotros OBVIAMENTE comenzamos a hacer todo eso! No somos estúpidos, sabes.

source: Perhaps you could try some kind of a fun banana mascot? You obviously like bananas...
es: ¿Quizás podrían intentar con una mascota divertida hecha de banana? Obviamente les gustan las bananas...

source: Ugh, I HATE bananas!
es: ¡Ugh, ODIO las bananas!

source: You're a banana
es: Tú eres una banana

source: But they're everywhere
es: Pero están por doquier

source: But you're sitting on one
es: Pero estás sentado en una

source: But... but you're sitting on a banana!
es: Pero... ¡Pero estás sentado en una banana!

source: Does this banana look COMFORTABLE to you!? Do you want to sit on my banana and tell me how comfortable it is!?!
es: ¿¡Esta banana te parece CONFORTABLE!? ¡¿¡Quieres sentarte en mi banana y decirme qué tan confortable es!?!

source: It's rough, and it's coarse, and it gets everywhere!!
es: ¡¡Es áspera, tosca, y se mete por todas partes!!

source: But... they're so pervasive here!
es: Pero... ¡Son tan persistentes aquí!

source: Oh of course! How could I hate them when they're everywhere?? I bet you're also a big fan of mosquitos and... and sand!
es: ¡Por supuesto! ¿¿Cómo podría odiarlas si están por todas partes?? Apuesto que también eres un fanático de los mosquitos y... ¡y de la arena!

source: Well, I hate bananas!! They're rough, and they're coarse, and they get everywhere!!
es: ¡¡Bueno, yo odio las bananas!! Son ásperas, toscas, y se meten por todas partes!!

source: But... YOU'RE a banana! ...You've been a banana this whole time!
es: Pero... ¡TÚ eres una banana! ...¡Fuiste una banana todo este tiempo!

source: What!? I'm not a banana!
es: ¿¡Qué!? ¡Yo no soy una banana!

source: Kendall, don't listen to #player#, they're calling me a banana! I think THEY'RE secretly a banana!!
es: Kendall, no escuches a #player#, ¡me están llamando banana! ¡¡Creo que ELLOS son secretamente unas bananas!!

source: Okay, that's enough. You're not a banana. Nobody's a banana. ... ...Bananas aren't real.
es: Bueno, suficiente. Tú no eres una banana. Nadie es una banana. ...Las bananas no son reales.

source: Was there anything else? What about your Poki Desert location, you were mentioning that earlier.
es: ¿Había algo más? Que tal sobre la sucursal del Desierto Poki, lo estabas mencionando antes.

source: Ah-ha hahaha. Yes, the success of our Poki Desert location.
es: Ah, ajajaja. Sí, el éxito de la sucursal del Desierto Poki.

source: Well, that one was more a matter of falling rump-first into serendipitous circumstances.
es: Bueno, eso fue más que nada por circunstancias fortuitas, pudimos usar una cola a nuestro favor.

source: Oh we haven't done THAT yet. ...Which body part did you mention?
es: Oh todavía no intentamos ESO. ...¿Qué parte del cuerpo mencionaste?

source: So, I'm slightly confused by the name Kflab... After all, your names are Kendall and King Frumble Lumps III.
es: Emm, estoy un poco confundido con el nombre Kflab... Sus nombres son Kendall y King Frumble Lumps III.

source: Yeah I was thinking that too. Shouldn't it be...
es: Sí, también estaba pensando eso. No debería ser...

source: Kkfliab
es: Kkflillab

source: Shouldn't it be Kkflab? For 'Kendall' and 'King Frungle Lumps'?
es: ¿No debería ser Kkflab? Por "Kendall" y "King Frungle Lumps"?

source: Shouldn't it be Kkfliab? For 'Kendall' and 'King Frungle Lumps Ihh'?
es: ¿No debería ser Kkflillab? Por "Kendall" y "King Frungle Lumps ill"?

source: King Frungle Lumps 'IHH'? What the heck is 'Ihh'!?
es: ¿King Frungle Lump "ILL"? ¿¡Qué se supone que signifique "ill"!?

source: III is a roman numeral, it means 'The Third'! You're saying it like it's a word...
es: ¡III es un numero romano, significa "El Tercero"! Lo estás diciendo como si fuese una palabra...

source: It isn't!? I thought it was just three letter I's! 'Ihh!' I kind of like it that way better.
es: ¿No lo es? ¡Pensé que era una i mayúscula seguido de dos eles minúsculas! Lo prefiero de esa forma.

source: Shouldn't it be Kkfliiiab? For 'Kendall' and 'King Frungle Lumps III'?
es: ¿No debería ser Kkfliiiab? Por "Kendall" y "King Frungle Lumps III"?

source: Yeah! ...That's what I said!
es: ¡Sí! ...¡Eso es lo que dije!

source: Shouldn't it be Kkab? for 'Kendall' and 'King'?
es: ¿No debería ser Kkab? Por "Kendall" y "King"?

source: #player#, 'King' is just an honorific. It's not technically a part of their name.
es: #player#, "King" es un honorífico, significa rey. No es técnicamente parte de su nombre.

source: 'King' is an honorific AND a part of my name!
es: ¡"King" es un honorífico Y parte de mi nombre!

source: Your... Your parents named you 'King'?
es: ¿Tus... Tus padres te llamaron "King"?

source: Yes! 'Frungle' is an honorific too. And 'Lumps' is even more honorific! And the 'III' is the cherry on the honor cake!
es: ¡Sí! "Frungle" también es un honorífico. ¡Y "Lumps" es aún más honorífico! ¡Y el "III" es la frutilla del postre de honor!

source: Come to think of it, you should be WAY more honored to say my name!
es: ¡Ahora que lo pienso, deberías de ser MAS honrado cuando digas mi nombre!

source: Ahh yes. I'm starting to fully appreciate your... onerousness.
es: Ahh sí. Ya comienzo a apreciar tu... Onerosidad.

source: Well, King Frungle Lumps III has such an... ample name! We decided to just use the 'Fl' from their name, and the 'K' from my name.
es: Bueno, King Frungle Lumps III tiene un nombre tan... ¡Amplio! Que solo decidimos usar "Fl" de su nombre, y la "K" de mi nombre.

source: Anyways, King Frungle Lumps III has such an... ample name! We decided to just use the 'Fl' from their name, and the 'K' from my name.
es: Como sea, King Frungle Lumps III tiene un nombre tan... ¡Amplio! Que solo decidimos usar "Fl" de su nombre, y la "K" de mi nombre.

source: The 'K' is from my name too!!!
es: ¡¡¡La "K" también es de mi nombre!!!

source: Oh sure – well that's true! The 'K' is from both our names. We both share the 'K' part of 'Kflab'.
es: Oh, claro - ¡Sí, es cierto! La "K" es de ambos nombres. Compartimos la "K" de "Kflab".

source: No! The 'K' is from my name, and NOT yours! Your 'K' isn't in the name.
es: ¡No! ¡La "K" es de mi nombre, y NO de tu nombre! Tu "K" no está en el nombre de la isla.

source: It... Ohhhhh...
es: Pero... Ohhhhh...

source: So these sugary globs have a little fruit and sugar, or sometimes cream cheese...
es: Y estas masas dulces tienen un poco de fruta y azúcar, o a veces queso crema...

source: Ugh cream cheese! In desserts!?
es: ¡Ugh, queso crema! ¿¡En postres!?

source: I can't stand cream cheese, it tastes like armpits! ...And not in the cute way.
es: ¡No soporto el queso crema, sabe a axilas! ...Y no de la forma linda.

source: Should we cut?
es: ¿Deberíamos hacer un corte?

source: What do you mean 'cut'? ...This isn't a 20th century sitcom where we're trying to skimp on film.
es: ¿A qué te refieres con hacer un "corte"? ...Esto no es una comedia del siglo 20 donde estamos ahorrando película.

source: We just record everything and cut stuff out afterward!
es: ¡Ahora podemos grabar todo y hacer los cortes después!

source: I see...
es: Ya veo...

source: If you'd like me to cut the cheese later, you can-
es: Si quieres que después corte el queso, podrías-

source: N-no! No thank you, that won't be necessary.
es: ¡N-no! No gracias, pero eso no será necesario.

source: Anyway keep going, what other ingredients?
es: Como sea, continúa, ¿hay más ingredientes?

source: There's a cute way!?
es: ¿¡Hay una forma linda!?

source: You tell me if there's a cute way, you're the one using armpit cheese in your desserts!
es: Tú dime si hay una forma linda, ¡tú eres el que está usando queso de axila en tus postres!

source: Please tell me this part isn't going on the internet?
es: Por favor, dime que esta parte no va a ir al internet.

source: Don't worry about that, just keep going. What other ingredients?
es: No te preocupes sobre eso, solo continúa. ¿Hay más ingredientes?

source: Hey, I like cream cheese!
es: ¡Hey, me gusta el queso crema!

source: Okay, no thanks. I'm not going down THAT rabbit hole right now.
es: No, gracias. No voy a empezar a discutir sobre ESE tema ahora mismo.

source: Just because I like cream cheese doesn't mean I like armpits!
es: ¡Solo porque me gusta el queso crema no quiere decir que me gusten las axilas!

source: I'm not here to judge! I'm just here to film, just keep going. What other ingredients?
es: ¡No estoy aquí para juzgar! Estoy aquí para filmar, así que continua. ¿Hay más ingredientes?

source: Um yeah, a little butter, and sometimes this semisweet chocolate, for the...
es: Ah, sí, un poco de manteca, a veces un poco de chocolate semiamargo, y para la...

source: Ugh, no way! I know that chocolate. You know what my friends call that brand? Dog vomit chocolate.
es: ¡Ugh, en serio! Conozco ese chocolate. ¿Sabes como mis amigos le dicen a ese chocolate? Chocolate vómito de perro.

source: I can't belieeeeve such good food has such bad content! Eyeuucchh.
es: ¡No puedo creer que tan buena comida tenga tan malos contenidos! Guácala.

source: Is this your first time doing this?
es: ¿Es tu primera vez haciendo esto?

source: Maybe this was a bad idea
es: Creo que fue una mala idea

source: Please don't insult our food
es: Por favor no insultes nuestra comida

source: I take it this is your first time doing this sort of thing. ...Can you NOT talk about our food's bad content?
es: Voy a suponer que es tu primera vez con este tipo de cosas. ...¿Podrías NO hablar sobre los malos contenidos de nuestra comida?

source: Maybe this was a bad idea! I didn't know you had such strong objections to our food's bad content...
es: ¡Creo que esto fue una mala idea! No sabía que tenías tan fuertes objeciones sobre el malo contenido de nuestra comida...

source: Can you take it easy on the insults? I don't think our food has bad content...
es: ¿Podrías calmarte con los insultos? No creo que nuestra comida tenga tan malos contenidos...

source: Oh don't worry, this is all going great! ...I can see the arguments in the comment sections now, it'll make for good content.
es: ¡Oh, no te preocupes, esto va muy bien! ...Ya puedo ver todos los argumentos en la sección de comentarios, esto va a hacer buen contenido.

source: Bad content is good content!?
es: ¿¡Malos contenidos hacen buen contenido!?

source: King Frungle seems... difficult to get along with.
es: King Frungle parece... algo difícil de llevarse bien.

source: Ohhh hmm... how can I put this into words. Are you a cat person?
es: Ohhh hmm... Como pongo esto en palabras. ¿Eres una persona que le gustan los gatos?

source: Don't you dare drag cats into this!
es: ¡No te atrevas a involucrar gatos en esto!

source: Well I'm a cat person, and I have a few cats at home.
es: Bueno, a mi me gustan, y tengo un par de gatos en casa.

source: And I have one cat in particular who scratches me every time I pet it. Every time!
es: Y tengo un gato particular que me rasguña cada vez que lo acaricio. ¡Siempre lo hace!

source: But I love all my cats and I still pet that cat anyway, even if it scratches me.
es: Pero amo a todos mis gatos, e igual sigo acariciando a ese gato, incluso si me rasguña.

source: Mmm... Maybe you shouldn't pet that cat.
es: Mmh... Creo que no deberías de acariciar a ese gato.

source: What! That's the saddest thing I ever heard.
es: ¡Qué! Eso es lo más triste que escuché.

source: Is that how you live your life? Not petting cats because they might scratch you?
es: ¿Es así como vives tu vida? ¿No acariciando gatos porque te podrían rasguñar?

source: ...What will you do when you run out of things to pet!?
es: ...¿¡Qué harías cuando ya no tengas cosas que acariciar!?

source: Oh, Fat Sensei! We just finished up our daily council meeting.
es: ¡Oh, Fat Sensei! Justo acabamos la reunión diaria de nuestro consejo.

source: Ah yes! Nice to see you again, Kendall. ...Alyssa. ...Bart. ...And, umm... really weird named person.
es: ¡Ah sí! Un gusto verlos otra vez, Kendall. ...Alyssa. ...Bart. ...Y, umm... persona de nombre raro.

source: ...WEIRD NAMED PERSON??
es: ...¿¿PERSONA DE NOMBRE RARO??

source: It started with an F didn't it? I think it was...
es: Comienza con una F, ¿no? Creo que era...

source: Flumble Lonks
es: Fruty Lups

source: Flumgle Lomps
es: Frumpa Lumpa

source: Flabbo
es: Fabio

source: I think it was Frumble Lunks?
es: ¿Creo que era Frumble Lunks?

source: I think it was Flabbo?
es: ¿Creo que era Fabio?

source: I think it was Flumble Lonks?
es: ¿Creo que era Fruty Lups?

source: I think it was Frungle Lumps?
es: ¿Creo que era Frungle Lumps?

source: I think it was Flumgle Lomps?
es: ¿Creo que era Frumpa Lumpa?

source: My name is King Frungle Lumps III!
es: ¡Mi nombre es King Frungle Lumps III!

source: And you're just pretending to forget it!! ...You're probably just jealous it's so much bigger than yours!!!
es: ¡¡Y solo estás pretendiendo que te olvidas!! ...¡¡¡Probablemente solo estés celoso que es más largo que el tuyo!!!

source: What King Frungle Lumps III means is umm, it's nice to see you too!
es: Lo que King Frungle Lumps III quiere decir es umm, ¡Un gusto verlos otra vez!

source: No they don't.
es: No, no es cierto.

source: No I don't! And stop doing that, I HATE when you translate for me.
es: ¡No lo hago! Y deja de hacer eso, ODIO cuando me traduces.

source: How am I supposed to hurt people's feelings when you keep cushioning my insults!
es: ¡Como se supone que voy a herir los sentimientos de las personas si suavizas mis insultos!

source: Ohh ha ha! They umm... they mean well.
es: ¡Ohh jaja! Es que... No lo haces a propósito.

source: Nope, no they don't.
es: Nope, no es cierto.

source: They're ummm... an acquired taste?
es: Ummm... ¿Es de un gusto adquirido?

source: Aaand that's strike three. Trust me I've known them forever? Same icky taste.
es: Y ya son tres strikes. ¿Creo que lo conozco desde siempre? Siempre tuvo el mismo sabor asqueroso.

source: Haw haw, three strikes! Serves you right for sticking up for me, Kendall. Go ahead and take your stupid base.
es: ¡Haw haw, tres strikes! Te lo mereces por tratar de defenderme, Kendall. Ve y agarra tu estúpida base.

source: I don't think that's how baseball works...
es: No creo que así funcione el baseball...

source: So Fat Senseiiiii! ...Did you want to share with Alyssa that one idea we brainstormed?
es: ¡Así que, Fat Senseiiiiii! ...¿Quieres compartir con Alyssa esa idea del otro día?

source: You remember, that one ummm... serendipitous rump idea?
es: Recuerdas, esa idea umm... sobre usar fortuitamente la cola?

source: Kendall what's wrong with you!?
es: ¿¡Kendall, qué te pasa!?

source: Fat Sensei what's wrong with you!?
es: ¿¡Fat Sensei, qué te pasa!?

source: I remember that idea!
es: ¡Recuerdo esa idea!

source: Oh yeah! The serendipitous rump idea. I remember that one!
es: ¡Oh sí! La idea fortuita con la cola. ¡Recuerdo eso!

source: No you don't!!! ...What serendipitous rump idea!?
es: ¡¡¡No, no es cierto!!! ...¿¡Qué idea fortuita con la cola!?

source: Kendall, what's wrong with you!?
es: ¿¡Kendall, qué es lo que pasa contigo!?

source: That's what I remember! Something about serendipity? ...And rumps?
es: ¡Es lo que recuerdo! ¿Algo sobre usar fortuitamente una cola?

source: Fat Sensei, what's wrong with you!?
es: ¿¡Fat Sensei, qué es lo que pasa contigo!?

source: That's not what I said!!! ...What serendipitous rump idea!?
es: ¡¡¡Eso no fue lo que dije!!! ...¿¡Qué idea fortuita con la cola!?

source: Kendall, are you talking about our 'serendipitous circumstances' in Poki Desert?
es: Kendall, ¿estás hablando sobre las "circunstancias fortuitas" del Desierto Poki?

source: That was tongue in cheek. ...Serendipitous circumstances is a long-winded way of saying we got lucky.
es: Fue una forma de decir. ...Apareció una fila de clientes que no esperábamos. Tuvimos suerte.

source: Sure - something like that would be great! But I don't think we can count on it.
es: Claro - ¡Algo así nos vendría muy bien! Pero no creo que podamos contar con algo así.

source: Ah yes, thank you!! ...See? That's sound advice from the person who thinks I'm rude, poorly grammared, and thin skinned.
es: ¡¡Gracias!! ...¿Ves? Eso viene de la persona que piensa que soy descortés, injusto, muy sensible y que mi gramática es mala.

source: Ah yes, thank you!! ...See? That's sound advice from the person who thinks I'm rude, dumpy, poorly grammared, and thin skinned.
es: ¡¡Gracias!! ...¿Ves? Eso viene de la persona que piensa que soy descortés, un basurero, injusto, muy sensible y que mi gramática es mala.

source: Wh-what!? Is it something I said!?
es: ¿¡Q-qué!? ¿¡Es algo que dije!?

source: Sorry, what was that? I couldn't understand your perfect grammar through your remarkably fat skin.
es: Perdón, ¿dijiste algo? No pude entender tu gramática perfecta por tu remarcable piel grasa.

source: What did I do to you...
es: Pero qué te he hecho...

source: So before we start shooting today, I wanted to show you something. Look at all these views you're getting!
es: Antes de que empecemos a grabar hoy, quiero mostrarte algo. ¡Mira todas las visitas que estás teniendo!

source: Wow! It's really taking off.
es: ¡Wow! Realmente soy popular.

source: Yeah! And look, your most popular episode was this one, where you had a big eye booger the whole time.
es: ¡Sí! Y mira, este es tu episodio más popular, en donde tienes una lagaña gigante todo el tiempo.

source: Big eye booger!?
es: ¿¡Una lagaña gigante!?

source: That's embarrassing
es: Eso es embarazoso

source: That's amazing
es: Eso es increible

source: That's the internet
es: Eso es el internet

source: That's disgusting
es: Eso es asqueroso

source: That's really weird
es: Eso es muy raro

source: That's kind of embarrassing, actually...
es: En realidad, eso es algo embarazoso...

source: That's kind of amazing, actually...
es: En realidad, eso es algo increíble...

source: That's the internet for you...
es: Y en resumen, eso es el internet...

source: That's kind of disgusting, actually...
es: En realidad, eso es algo asqueroso...

source: That's umm... really weird.
es: Eso es umm... muy raro.

source: Yeah, people in the comment section named her Bella!
es: ¡Sí, la gente en la sección de comentarios le puso nombre, Bella!

source: I made an entire followup episode about her with nothing but close-ups of the booger.
es: Hice un episodio sobre ella en donde solo hay acercamientos a la lagaña.

source: Hah hah, you should see it! Hold on, I'll show you.
es: ¡Jajaja, deberías verlo! Espera, ahora te lo muestro.

source: I don't want to see that!!!
es: ¡¡¡No quiero ver eso!!!

source: Hah hah! So I was thinking about a followup episode, maybe if, hmmm... Hey come here, can I see something real quick?
es: ¡Jaja! Pensaba hacer otro episodio, creo que sí, hmmm... Ven aquí, ¿puedo ver algo rápido?

source: I'm going to go wash my face...
es: Voy a lavarme la cara...

source: So... How was your food? It looks like you enjoyed it~
es: Entonces... ¿Cómo estuvo la comida? Parece que le gustó~

source: Don't tell me what I enjoyed! The food was terrible. Everything is terrible!!! You're both terrible!
es: ¡No me digas lo que me puede gustar! La comida estuvo terrible. ¡¡¡Todo es terrible!!! ¡Ustedes son terribles!

source: ...I have some advice for you, King Frungle Lumps III. You're not going to like it, but it's important that you hear it from me first.
es: ...Tengo un consejo para ti, King Frungle Lumps III. No te va a gustar, pero es importante que lo escuches primero de mí.

source: Hmph, well fine. Give me your stupid advice.
es: Hmph, está bien. Dame tu estúpido consejo.

source: You see, King Frungle, the thing is, how do I put this...
es: Mira, King Frungle, la cosa es, como lo digo...

source: The word 'Boob' looks like boobs in three different ways.
es: La palabra "Banco" puede verse de tres formas diferentes.

source: WHAT!? You're right, I didn't like that advice at ALL! Get out of here, you filthy jagoon!!!
es: ¿¡QUÉ!? ¡Tenías razón, no me gustó ese consejo para NADA! ¡¡¡Ahora vete, gran fantoche!!!

source: Umm. Okay. I have some ACTUAL advice.
es: Umm. Bien. Ahora un consejo DE VERDAD.

source: It's no fun being alone
es: No es divertido estar solo

source: WHERE do I BEGIN!
es: ¡POR DONDE COMIENZO!

source: Be nicer to people
es: Trata mejor a las personas
