Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: That food should be coming out like pap-|pap-|pap-|pap-|pap!| Right now you're more like pappap,|| pappa| pap.
es: La comida debería de salir algo como pap-|pap-|pap-|pap-|¡pap!|. Ahora mismo lo haces como pappap,|| pappa| pap.

source: You don't want to give your customers any break. Eating should become an unconscious reflex to them, like blinking!
es: No tienes que darle ningún descanso a los clientes. Comer debe ser un reflejo inconsciente para ellos, ¡como pestañar!

source: What I think #player# is trying to say is your technique is ahhh... a little strange.
es: Lo que #player# intenta decirte es que tu técnica es ahhh... Algo rara.

source: Hey hey! Don't worry, we'll work on that. Good work everybody!
es: ¡Hey hey! No te preocupes, vamos a trabajar en eso. ¡Buen trabajo todos!

source: Fat Sensei, #player# -- see what you can do to drum up more business!
es: Fat Sensei, #player# -- ¡Vean lo que puedan hacer para mejorar el negocio!

source: We'll be here when you feel like training us up again. No hurry!
es: Nosotros estaremos aquí cuando quieran entrenarnos más. ¡Sin apuros!

source: So explain again why my beloved restaurant is very, very empty?
es: Entonces, explícame otra vez ¿por qué mi querido restaurante está muy, muy vacío?

source: Aw come on now! It's not empty, we got the two line cooks here...
es: ¡Oh, vamos! No está vacío, tenemos a los dos cocineros de línea aquí...

source: And as far as customers, we got Chonkers McRhonkers over there! What more could you need?
es: Y en lo que respecta a clientes, ¡tenemos a Chonkers McRhonkers por ahí! ¿Qué más podrías necesitar?

source: Hm. Mhm... Well ideally you'd have at least TWO customers...
es: Hm. Mhm... Bueno, idealmente tendrías al menos DOS clientes...

source: Oh Chonkers eats plenty! Even with just them, they're doing a lot to keep us afloat.
es: ¡Oh Chonkers come mucho! Incluso solo con Chonkers, es suficiente para seguir a flote.

source: I mean, afloat might be a strong word. They're makin' us sink a little slower I guess.
es: Creo que a flote es una palabra fuerte. Supongo que nos hace hundirnos más lento.

source: Maybe kind of like a, hmm... Like a anchor made of something slightly buoyant.
es: Quizás como un, hmm... Como un ancla hecha de algo ligeramente flotante.

source: An anchor made of... Boats?
es: ¿Un ancla hecha de... Barcos?

source: Nope. Not that buoyant!
es: No. ¡No tan flotante!

source: Walnuts?
es: ¿Cáscaras de nuez?

source: Rotting flesh?
es: ¿Una alfombra de piel?

source: Slightly smaller boats?
es: ¿Barcos más pequeños?

source: This isn't a helpful avenue of discussion.
es: Esto no es nada útil para la discusión.

source: There you go, well put! Like a anchor made of walnuts.
es: ¡Eso es, bien dicho! Como un ancla hecha de cáscaras de nuez en el mar.

source: There you go, well put! Like a anchor made of... wait what!?
es: ¡Eso es, bien dicho! Como un ancla hecha de una suavecita alfombra de... ¿¡Espera qué!?

source: ...I mean, maybe? ...Hold up, are you on some kind of watchlist I should know about?
es: ... Es que, ¿quizás? ...No debería de preocuparme y llamar a la policía, ¿no?

source: There you go, well put! Like a anchor made of slightly smaller boats.
es: ¡Eso es, bien dicho! Como un ancla hecha de barcos un poco más pequeños.

source: Oh sure, I'm with you. ...We'll come back to that one later.
es: Oh, claro, estoy contigo. ...Volveremos a esto más tarde.

source: Well, anyway... I know you said you were following our recipes to a tee. But just in case...
es: Bueno, de todos modos... Sé que dijiste que estaban siguiendo nuestras recetas a la perfección. Pero por si acaso...

source: You want us to show you, right?
es: Quieres que te mostremos, ¿cierto?

source: I mean... well...
es: Es que... bueno...

source: Go ahead, Skins! Why don't you show 'em what you got.
es: ¡Adelante, Skins! Demuéstrales de qué estás hecho.

source: Can do! Mowr!
es: ¡Puedo hacerlo! ¡Mowr!

source: At the Merrymellow Marsh Turbo Fat location, business was once again unusually slow. This situation was starting to feel familiar...
es: En la sucursal de Turbo Fat en Ciénaga de Malvaviscos, el negocio era otra vez inusualmente lento. Esta situación ya se siente familiar...

source: ...However unlike the other Turbo Fat locations, there were plenty of people around! It just seemed like none of them were very hungry.
es: ...Pero a diferencia de otras sucursales de Turbo Fat, ¡Aquí hay mucha gente alrededor! Solo parece que nadie está realmente hambriento.

source: So we're supposed to get more customers to show up? Like, with advertising or specials or something?
es: ¿Entonces se supone que tenemos que atraer a más clientes? ¿Cómo, con publicidades o especiales?

source: ...Fat Sensei, I don't know anything about that stuff!
es: ...Fat Sensei, ¡No se nada sobre esas cosas!

source: Oh don't worry, it's probably just something simple they messed up.
es: No te preocupes, probablemente sea algo simple en que se estén equivocando.

source: Maybe they're not following our recipes, or they're treating their customers poorly.
es: Puede que no estén siguiendo las recetas, o que no tratan bien a la clientela.

source: ...Or there's a skunk cemetery?
es: ...¿O hay un cementerio de zorrinos?

source: ...Or they're faking it?
es: ...¿O lo hacen a propósito?

source: ...Or they hate sweets?
es: ...¿O ellos odian lo dulce?

source: Or maybe they built the restaurant on a desecrated skunk burial ground!
es: ¡O tal vez construyeron el restaurante en un antiguo cementerio de zorrinos!

source: An unscrupulous realtor sold them the property sight unseen! And... smell unsmelt!
es: ¡Un extraño agente inmobiliario les vendió la propiedad! ¡Y hasta el agente tenía un olor fuerte!

source: Umm... it's probably not that.
es: Umm... No creo que sea eso.

source: Once we get there, you smell around for skunks! And I'll look for ghosts.
es: ¡Una vez que lleguemos, puedes oler si hay algún zorrino! Y yo buscaré fantasmas.

source: Or maybe they're cooking poorly on purpose.
es: O tal vez están cocinando mal a propósito.

source: Oh, they're ruining their food for the insurance money! Frightening away customers so they can walk away millionaires.
es: ¡Oh, están arruinando la comida por el dinero del seguro! Ahuyentan a los clientes, así ellos pueden salir siendo millonarios.

source: And they'd have gotten away with it if not for us meddling kids!
es: ¡Y no se saldrán con la suya de no ser por estos muchachos entrometidos!

source: Or maybe all the townspeople there hate sweets.
es: O tal vez a la gente del pueblo odia lo dulce.

source: Oh! Maybe they're fructose intolerant! The merest thought of sugar makes their stomach turn and ruins their poos.
es: ¡Oh! ¡Puede que sean intolerantes a la fructosa! Un simple pensamiento del azúcar hace que arruinen sus estómagos y sus... excrementos.

source: I'll design a new healthy menu! Instead of fudge brownies and cheesecake... Pita wedges! And barley bites!
es: ¡Voy a diseñar un nuevo menú saludable! En lugar de brownies y cheesecakes... ¡Pan pita! ¡Y salteado de cebada!

source: You know what, I think I'll take the lead on this one.
es: ¿Sabes qué? Creo que yo voy a encargarme de todo.

source: What? ...Why?
es: ¿Qué? ...¿Por qué?

source: My stomach hurts, but I want to keep eating... Ohhhhh.... This might be my new favorite restaurant...
es: Mi estómago duele, pero quiero seguir comiendo... Ohhhh... Creo que este va a ser mi nuevo restaurante favorito...

source: Oooof.... I'm gonna leave an online review! Right after I deal with the aftermath of my own terrible, terrible decisions...
es: Uuf.... ¡Voy a dejar una reseña online! Justo después de ocuparme de las consecuencias de mis terribles, terribles decisiones...

source: ...See? Our food's good enough to cancel out whatever weird leaps of morality you have to justify to yourself.
es: ...¿Viste? Nuestra comida es lo suficientemente buena como para cancelar cualquier duda moral que tenías.

source: So, don't overthink it. At the end of the meal, we're happy and our customers are happy. It's win/win.
es: Así que, no te compliques. Al final de cada comida, nuestros clientes son felices. Es un ganar-ganar.

source: I still don't like it
es: Todavía no me gusta

source: I didn't get to lie
es: No pude mentir

source: I should have told them
es: Debería de haberles dicho

source: Hey sorry, I know we said we'd save your places in line but we didn't do that. I hope you're not mad...
es: Ah, y perdón. Dijimos que les íbamos a guardar el lugar en la fila, pero no lo hicimos. Espero que no se enojen...

source: Our places in... what? Ohhhh yeah we gotta get back in line, dude.
es: Nuestros lugares en... ¿Qué? Ohhhh, sí, tenemos que volver a la fila.

source: Probably gotta go back to the end again... Desert Q...
es: Probablemente al final de la fila otra vez... Ola del desierto...

source: I should have lied
es: Debería de haber mentido

source: I'm telling them again
es: Les voy a decir otra vez

source: Fine, you're right. But I still don't have to like it.
es: Está bien, tenías razón. Pero todavía no me gusta esto.

source: Well. ...You don't HAVE to like it. But you should try liking it! You'll sleep a little better~
es: Bueno... No TIENE que gustarte. ¡Pero deberías intentar que te guste! Dormirías mejor por las noches~

source: Aww but that's no fun! I wanted to make up a really cool lie.
es: ¡Aww, pero eso no fue divertido! Yo quería inventar una buena mentira.

source: Oh don't worry! You'll have plenty of other opportunities to lie to our customers, you... weird little sociopath.
es: ¡Oh, no te preocupes! Ya vas a tener muchas oportunidades para mentir a los clientes... pequeño y raro psicópata.

source: That wasn't as fun as I expected. Maybe I should have told them a really cool lie.
es: Eso no fue tan divertido como esperé. Creo que tenía que haberles dicho una buena mentira.

source: Maybe I should have told them the truth...
es: Creo que debería de decirles la verdad...

source: Oh don't worry, I'm sure you'll have plenty of other opportunities to ruin everything with the stupid truth.
es: Oh, no te preocupes. Estoy seguro que vas a tener otras oportunidades de arruinar todo con tu estúpida verdad.

source: Hmph, I'm going to go tell them the truth again! Maybe they didn't hear...
es: ¡Hmph, voy a decirles la verdad otra vez! Tal vez no me escucharon...

source: You're back!? ...Does this line go in a circle?
es: ¿¡Están de vuelta!? ...¿Esta fila hace alguna especie de círculo?

source: Tsk, we lost our place last time. We had to go back to the end.
es: Tsk, perdimos nuestros lugares. Tuvimos que ir al final de la fila.

source: Maaaaaan, I really liked your food too! But I don't wanna step out of line again. Desert Q...
es: ¡Y de verdad nos encantó su comida! Pero no podemos dejar la fila otra vez. Ola del Desierto...

source: ...Desert Q...
es: ...Ola del Desierto...

source: Mmmm, we'll save your place in line. Go on inside!
es: Mmmm, podemos guardarles el lugar en la fina. ¡Entren, tomen asiento!

source: Really, you'd do that? Sweet, it's on then!
es: ¿En serio, harías eso? ¡Perfecto, entremos!

source: I'm getting one of them chocolate puffs!!
es: ¡¡Quiero ordenar una de esas tortas de chocolate!!

source: You're really going to wait in line for them?
es: ¿De verdad vas a esperar en la fila por ellos?

source: No, and neither are you! ...Go cook.
es: ¡No, y tampoco lo harás tú! ...Ve a cocinar.

source: You think of a lie
es: Piensa en una mentira.

source: What lie should we make up?
es: ¿Qué mentira le vamos a decir?

source: Won't they be mad?
es: ¿No se enojarán?

source: That seems dishonest... Won't they be mad?
es: Eso parece deshonesto... ¿No se enojarán?

source: No they won't be mad. If you do your job they won't be anything!
es: No se van a enojar. ¡Si haces un buen trabajo, no lo van a estar!

source: Do you think they're going to remember any of our promises when their stomachs are full and their brains are empty?
es: ¿En serio crees que ellos van a recordar nuestras promesas cuando sus estómagos están llenos y sus cerebros vacíos?

source: Lying is fun
es: Mentir es divertido

source: I'm telling them
es: Les voy a decir

source: I don't like this
es: No me gusta esto

source: Well... We should think of some kind of a lie, right?
es: Bueno... Deberíamos de pensar en alguna mentira, ¿no?

source: Hmph. You're assuming they're going to remember anything that happened in the past thirty seconds.
es: Mmph. Estás asumiendo que ellos van a recordar lo que pasó hace treinta segundos.

source: ...If you do your job, they'll be sprawled out in their respective food comas and we won't have to make up a thing.
es: ...Si tú haces tu trabajo, ellos van a estar tendidos en sus respectivos comas alimenticios y nosotros no tenemos que inventar nada.

source: Okay, I'll cook! You think of a lie.
es: ¡Okay, voy a cocinar! Tú piensa en una mentira.

source: A lie? It's bold of you to assume they'll remember anything that happened in the past thirty seconds.
es: ¿Una mentira? Es algo atrevido asumir que ellos van a recordar algo de los últimos treinta segundos.

source: ...If you do your job, they'll be sprawled out in their respective food comas and we won't have to lie about a thing.
es: ...Si tú haces tu trabajo, ellos van a estar tendidos en sus respectivos comas alimenticios y nosotros no tenemos que mentir sobre nada.

source: Mmmm... Yeah. I don't like this.
es: Mmmm... Sí. No me gusta esto.

source: Fine whatever, go ahead and dislike whatever you want to dislike.
es: Bueno, como sea, ve y continua no gustándote lo que no te gusta.

source: I'm going to go hide in the back and put on my "I Told You So" pants.
es: Voy a esconderme atrás y me voy a poner mis pantalones de "Te lo dije".

source: Lying to customers is fun!
es: ¡Mentirles a los clientes es divertido!

source: Ahha ha ha ha, yes it is. But we're not going to have to lie, just wait and see!
es: Jajajaja, sí lo es. Pero no va a hacer falta mentir, ¡solo espera y mira!

source: You worry about the cooking, I'll go hide in the back and put on my "I Told You So" pants.
es: Encárgate de la cocina, yo voy a esconderme atrás y me voy a poner mis pantalones de "Te lo dije".

source: I'm telling them the truth!
es: ¡Les voy a decir la verdad!

source: Hmph, you can tell them whatever you want after you finish cooking for them.
es: Hmph, puedes decirles cualquier cosa que quieras después de que termines de cocinarles.

source: ...In the meantime, I'll go hide in the back and put on my "I Told You So" pants.
es: ...Mientras, voy a esconderme atrás y me voy a poner mis pantalones de "Te lo dije".

source: Heck yeah, those were some seriously choice chocolate puffs! Sorry for bugging you about the whole nut thing.
es: ¡Que rico, eso fueron unos deliciosos hojaldres de chocolate! Perdón por molestarlos sobre el tema de las nueces.

source: Ahhaha, trust me. It was no trouble~
es: Jajaja, créeme, no fue ninguna molestia~

source: Fat Sensei, that was still dangerous. You're lucky they didn't have an allergic reaction!
es: Fat Sensei, eso fue muy peligroso. ¡Tienes suerte que no tuvo una reacción alérgica!

source: Hmph. Here's a secret about food -- nobody's allergic to anything.
es: Hmph. Aquí tienes un secreto sobre la comida -- nadie es alérgico a algo.

source: "Allergic" is just a word people use for emphasis, like the word "literally". If you don't believe me, let's ask Raymon over here.
es: "Alérgico" es una palabra que se usa como énfasis, como la palabra "literal". Si no me crees, preguntémosle a Raymon aquí.

source: Raymon, I'm afraid there was a mix-up in the kitchen. This is important -- are you LITERALLY allergic to nuts?
es: Raymon, me temo que hubo un error en la cocina. Esto es importante -- ¿tú eres LITERAL alérgico a las nueces?

source: Nuts? Oh yeah, I'm literally allergic to them! Like, literally could not be more allergic.
es: ¿Nueces? ¡Oh sí, soy literal alérgico a las nueces! Algo como, literal no podría ser más alérgico.

source: Umm like I bit into this walnut brownie the other day and I LITERALLY had to brush my teeth afterwards.
es: Umm, el otro día le di una mordida a un brownie con nueces, y después LITERAL tuve que cepillarme los dientes.

source: I didn't actually brush my teeth 'cause my cat was in my lap! But you know how it is.
es: ¡Igual no pude cepillarme los dientes porque mi gato estaba en mis piernas! Ya sabes cómo es eso.

source: Yes, yes. Everyone's allergic to everything until a cat's in their lap.
es: Sí, sí. Todo el mundo es alérgico a algo hasta que un gato se sienta en tus piernas.

source: I'm allergic to cats
es: Soy alérgico a los gatos

source: Some day the cat will be in the other lap
es: ¡Así no funcionan las alergias!

source: You should brush your teeth
es: Deberías de cepillarte los dientes

source: Fat Sensei, some day the cat's going to be in the OTHER lap.
es: ¡Fat Sensei, así no funcionan las alergias, y sabes perfectamente como funcionan!

source: I... don't know what that means.
es: Yo... No se lo que dices.

source: You know EXACTLY what it means!
es: ¡Sabes EXACTAMENTE lo que dije!

source: I'm... allergic to cats.
es: Yo... Soy alérgico a los gatos.

source: Well see, now you're just being mean to cats!
es: ¡Pero bueno, ahora estás siendo rudo contra los gatos!

source: No I don't DISLIKE cats! I just... Ack, you're impossible!
es: ¡No, no es que NO ME GUSTAN los gatos! Solo que... Ack, ¡Eres imposible!

source: Cat or no cat, you should really brush your teeth...
es: Gato o no gato, deberías de cepillarte los dientes...

source: How is THAT being mean to cats!?
es: ¿¡Como es ESO ser rudo hacia los gatos?!

source: Hey so these chocolate puffs... They don't have nuts do they? 'Cause I'm allergic to nuts.
es: Así que estos hojaldres de chocolate... ¿No tienen nueces? Porque soy alérgico a las nueces.

source: Yes, they have nuts
es: Sí, tienen nueces

source: No, they don't have nuts
es: No, no tienen nueces

source: I'm not sure...
es: No estoy seguro...

source: Actually, they do have nuts!
es: ¡En realidad, sí, tienen nueces!

source: What? Why would you tell them they have nuts!?
es: ¿Qué? ¿¡Por qué le estás diciendo que tienen nueces!?

source: No, they don't have nuts.
es: No, no tienen nueces.

source: Hmmm, I'm not sure if they have nuts or not...
es: Hmmm. No estoy seguro si tienen o no nueces...

source: Don't worry. Everything on our menu is nut free. Our chef even wears an athletic cup.
es: No se preocupe. Todo en nuestro menú es sin nueces. Incluso nuestro chef no tiene nuez de Adán para minimizar alergias.

source: Oh okay! Right on.
es: ¡Oh okay! A comer.

source: Fat Sensei, is that actually true?
es: Fat Sensei, ¿lo que dijo es verdad?

source: What, you mean about the athletic cup?
es: Que, ¿sobre la nuez de Adán?

source: About everything!
es: ¡Me refería a todo!

source: Yes? No. I don't know. I don't really keep track of that sort of thing.
es: ¿Sí? No. No se. Realmente no le doy mucha importancia a estas cosas.

source: ...Besides, it's not like a food allergy ever killed anyone.
es: ...Aparte, no es como si alguna vez la alergia a ciertas comidas mató a alguien.

source: Don't look at me that way!
es: ¡No me mires de esa forma!

source: Lisk, nobody's going to pay you to see the big cactus...
es: Lisk, nadie te va a pagar para ver el cactus grande...

source: But it's a REALLY big cactus!
es: ¡Pero es un cactus MUY grande!

source: Are you two talking about the big cactus in front of our restaurant?
es: ¿Ustedes dos están hablando del cactus grande en frente de nuestro restaurante?

source: ...That's my cactus. But I'll sell it to you~
es: ...Ese es mi cactus. Pero se los puedo vender~

source: Seeeeee, Beats? Any idiot can say it's their cactus. And besides, I can talk way louder than THAT person.
es: ¿Veeeeees, Beats? Cualquier idiota puede decir que es su cactus. Y aparte, yo puedo hablar más fuerte que ESA persona.

source: (grumble...)
es: (quejidos...)

source: So your food must be amazing! I've had this place recommended to me by like... fiiiiive different people!
es: ¡La comida debe ser muy buena! Me recomendaron ese lugar como por... ¡Ciiiiinco personas diferentes!

source: Really? People are talking about us?
es: ¿En serio? ¿La gente habla sobre nosotros?

source: Yep! The place next to the big cactus. Is it ummmm.. Is it true you save people's place in line?
es: ¡Sí! El lugar al lado del cactus grande. Asi que ummmm.... ¿Es cierto que ustedes guardan los lugares en la fila?

source: Yes
es: Sí

source: Yes! That's... apparently true.
es: ¡Sí! Eso es... aparentemente cierto.

source: Oh okay, thank goodness! Because I already paid them outside, and I didn't want it to turn into this big thing.
es: Oh okay, ¡Gracias! Porque ya les pagué afuera, y no quería que esto fuese algo de mucha importancia.

source: Oooh then we may have a little problem, because I already paid them outside, so if I get back in line, hmm...
es: Oooh, entonces puede que tengamos un problema, porque ya les pagué afuera, así que si vuelvo a la fila, hmm...

source: Umm sorry, we don't do that...
es: Umm perdón, pero no hacemos eso...

source: Wait you paid... them? The... line people? You have to pay someone before you can wait in line?
es: Espera, ¿les pagaste a ellos? ¿A la gente de la fila? ¿Tienes que pagarles a alguien para esperar en la fila?

source: No no no -- it's not like you pay beforehand or anything. They have this online payment system.
es: No no no -- No es que tengas que pagar de antemano o algo parecido. Tienen un sistema de pago en línea.

source: Online payment?
es: ¿Pago en línea?

source: Yep. ... ...Someone walks up to you on the line, and you pay them! Ha ha ha~
es: Sí. ... ...Alguien se acerca a ti cuando esperas en la línea de afuera, ¡Y le pagas! Jajaja~

source: So is someone going to take my order? Orrrrrrr...
es: Así que... ¿Alguien va a tomar mi order? O sigo esperando...

source: I'll take your order
es: Yo voy a tomar su orden

source: If we have to
es: Si tengo que

source: Get out
es: Vete

source: They're allergic to puns
es: Es alérgico a los chistes

source: Get out.
es: Vete.

source: Ugh. If we have to...
es: Ugh. Si tengo que...

source: I'll take your order! Don't worry about Fat Sensei, they're umm... literally allergic to puns.
es: ¡Yo tomaré su orden! No se preocupe por Fat Sensei, es umm... literal alérgico a los chistes.

source: You'll have to excuse Fat Sensei, they're umm... literally allergic to puns.
es: Disculpe la actitud de Fat Sensei, es umm... literal alérgico a los chistes.

source: So this double chocolate cheesecake... Is this vegan? I've been trying to go vegan lately.
es: El cheesecake de doble chocolate... ¿Es vegano? Estoy intentando llevar una dieta vegana.

source: Yes yes, everything on the menu is vegan.
es: Sí sí, todo lo del menú es vegano.

source: Really? ...'cause it's a caaaaaake, so what do you use instead of eggs? And butter?
es: ¿En serio? ...Porque es una tooooooorta, ¿qué usan en lugar de huevos? ¿Y la manteca?

source: Oh yes our recipe doesn't use COW butter, it's hmm... GOAT butter!
es: Ah sí, nuestra receta no usa manteca de VACA, es de hmm... ¡manteca de CABRA!

source: Goats... aren't vegan.
es: Las cabras... no son veganas.

source: P-peanuts?
es: ¿M-maní?

source: Peanut... butter? Hmm that sounds healthy! ...What about the eggs?
es: ¿Manteca... Mantequilla de maní? ¡Eso suena saludable! ...¿Y los huevos?

source: Yes #player#, what ABOUT the eggs?
es: Sí #player#, ¿Y los huevos?

source: Rocks
es: Piedras

source: Smoke
es: Humo

source: Peanuts
es: Maní

source: Sand
es: Arena

source: Eggs
es: Huevos

source: Milkweed
es: Leche de alga

source: ...Peanut eggs?
es: ...¿Huevos de maní?

source: ...Sand eggs?
es: ...¿Huevos de arena?

source: ...Smoke eggs?
es: ...¿Huevos de humo?
