Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: Your life will improve when you learn how to treat people better.
es: Tu vida va a mejorar cuando aprendas a tratar mejor a las personas.

source: It hurts when nobody wants you around, doesn't it?
es: Duele cuando no hay nadie al rededor, ¿no?

source: But if people treated you the way you treat them, you wouldn't want them around either.
es: Pero si la gente te trata de la misma forma que los tratas a ellos, tampoco los quisieras al rededor.

source: I can't stand you. You're selfish, you complain and insult people all the time-
es: No te aguanto. Eres egoísta, te quejas e insultas a las personas todo el tiempo-

source: You're even rude to Kendall, the only friend you actually have! But they're kind of everyone's friend, so maybe they don't count-
es: ¡Incluso eres malo con Kendall, tu único amigo real que tienes! Pero es amigo de todos, así que creo que no cuenta-

source: Also you're an annoying customer, and umm your handwriting sucks and... did I miss anything?
es: También eres un cliente molesto, y umm, tu caligrafía apesta y... ¿Me olvido de algo?

source: Ahh... I think that covers it.
es: Ahh... Creo que eso es todo.

source: Oh yeah and what the heck is with your stupid name!? Your drivers license must be like a mile long.
es: Ah sí, ¿¡Y cuál es la idea de tu estúpido nombre!? Tu licencia de conducir debe ser muy larga.

source: ...You filthy jagoon.
es: ...¿Se entendió? Gran fantoche.

source: F-filthy jagoon!? Th-that was uncalled for! Oww! ...Owwwwww!!!
es: ¿¡G-gran fantoche!? ¡No había necesidad de eso! ¡Buaa! ...¡¡¡Buaaaaa!!!

source: Wait just a minute... Is THAT what I've been doing to people?
es: Esperen un minuto... ¿ESTO es lo que le hago a las personas?

source: ...Wow! ... ...I suck.
es: ...¡Wow! ... ...Doy asco.

source: Wow, this food is one-of-a-kind!
es: ¡Wow, esta comida es única!

source: Thanks, I practiced so much!
es: ¡Gracias, practiqué mucho!

source: Oh, anybody could do it...
es: Oh, cualquiera podría haberlo hecho...

source: Thanks, it's Sensei's recipes!
es: ¡Gracias, son las recetas de Sensei!

source: Thanks, it's all because of Fat Sensei's recipes!
es: ¡Le agradezco, pero es todo gracias a las recetas de Fat Sensei!

source: Thanks, I've put in a lot of practice!
es: ¡Gracias, puse mucha práctica en esto!

source: Oh, it's really nothing special... Anybody could do it!
es: Oh, no es nada especial... ¡Cualquiera podría haberlo hecho!

source: I'm being serious. These cakes are so soft and fluffy and cutting into them it's... it's like cutting into a kitten.
es: Hablo en serio. Estas tortas son tan suaves y esponjosas, es como cortar un... Es como cortar un gatito.

source: Ew. I mean... thank you. I think.
es: Ew. Bueno... gracias. Creo.

source: So you're really King Frungle Lumps III's dad?
es: ¿De verdad eres el padre de King Frungle Lumps III?

source: Mmm, I can see the resemblance. But your name... What happened to King Frungle Lumps II?
es: Mmm, puedo ver el parentesco. Pero su nombre... ¿Qué pasó con King Frungle Lumps II?

source: King Frungle Lumps II? Ha ha ha. No, no, there's a reason behind that silly name. Their mom wanted to name them Dillon!
es: ¿King Frungle Lumps II? Jajaja. No, no, hay una razón detrás de ese nombre raro. ¡Su madre quería ponerle Dillon!

source: But I thought, "King Frungle Lumps III", here's a name that'll toughen them up a little you know.
es: Pero pensé, "King Frungle Lumps III", ese es un nombre que lo hará más fuerte, saben.

source: If you can survive grade school with a name like that, you'll go on to do great things! It was just something I wanted to try.
es: Si puedes sobrevivir a la escuela primara con un nombre así, ¡podrás hacer lo que sea! Solo era algo que quería probar.

source: How did that work out?
es: ¿Todo eso sirvió?

source: What a fun experiment!
es: ¡Qué prueba divertida!

source: Congrats, you raised a jerk
es: Perfecto, criaste un fantoche

source: Do you regret it?
es: Dime que lo lamentas

source: Well, do you... regret putting them through that?
es: Bueno... ¿No te arrepientes del resultado?

source: Mmmm well, you know. They're wealthy and powerful, buuuut I don't think they have many friends.
es: Mmmm bueno, ya sabes. Es adinerado y poderoso, peeeero creo que no tiene muchos amigos.

source: Well, they're a total jerk now so... I mean, good job I guess.
es: Bueno, ahora es un completo fantoche, así que... Buen trabajo, supongo.

source: Ahhaha! Thank you. You're right, they're wealthy and powerful buuuut I don't think they have many friends.
es: ¡Ajaja! Gracias. Tienes razón, pero es adinerado y poderoso, peeeeeeero creo que no tiene muchos amigos.

source: Wow, what a fun experiment!
es: ¡Wow, suena a un experimento divertido!

source: Ahhaha! Thank you. As far as whether it worked, ahh...
es: ¡Ajaja! Gracias. Hasta ahora creo que funcionó, ahh...

source: ...They're wealthy and powerful, buuuut I don't think they have many friends.
es: ...Es adinerado y poderoso, peeeero creo que no tiene muchos amigos.

source: Ehh!? That seems great! I have friends out the ass, but what does that get you in life? I'll take wealth and power any day.
es: ¿¡Ehh!? ¡Eso parece genial! Yo tengo amigos hasta en la sopa, ¿y a dónde llegué en la vida? Tomaría el dinero y poder cualquier día.

source: Hmm. Maybe I should change my name...
es: Hmm. Creo que debería de cambiar mi nombre...

source: King Frungle... and Bart! Ahh hello! I didn't realize you'd brought a friend.
es: King Frungle... ¡Y Bart! ¡Ah, hola! No me di cuenta que trajiste a un amigo.

source: So Bart, how are things from this side of the kitchen? Ahha ha ha~
es: Asi que Bart, ¿cómo son las cosas de este lado de la cocina? Jajaja~

source: Oh you don't need to address me directly, I'm just here as a token indicator of King Frungle's personal growth.
es: Oh, no hace falta que me hables, solo estoy aquí como indicativo del crecimiento personal de King Frungle.

source: Wow, personal growth! Good for you, King Frungle~
es: ¡Wow, crecimiento personal! Bien por ti, King Frungle~

source: It IS good for me! I can't thank you enough, your advice was exactly what I needed to hear.
es: ¡Sí, ES bueno para mi! No podría agradecerte lo suficiente, tu consejo era exactamente lo que necesitaba escuchar.

source: Sorry I called you a filthy jagoon
es: Perdón por llamarte fantoche

source: I'm usually so bad at advice
es: Por lo general, soy malo con los consejos

source: You don't have to thank me
es: No tienes que darme las gracias

source: Advice? It was meant as an insult
es: ¿Consejo? Eso era un insulto

source: I'm sorry for calling you a filthy jagoon... But I'm glad you're doing better!
es: Perdón por llamarte un gran fantoche... ¡Pero me alegra que estés mejor!

source: That's great, I'm usually so bad at giving advice!
es: ¡Me alegro, y eso que soy malo dando consejos!

source: I was just saying what everyone else was thinking! You don't need to thank me for it.
es: ¡Solo estaba diciendo lo que todos estaban pensando! No hace falta que me agradezcas.

source: Exactly what you needed to hear!? ...I wasn't trying to help, I was trying to draw blood.
es: ¿¡Eso necesitabas escuchar!? ...No estaba intentando ayudarte, estaba intentando herirte.

source: Anyway you were right, the word 'Boob' DOES look like boobs three different ways. It really got me thinking.
es: Como sea, la palabra "Banco" SÍ se puede interpretar de tres formas diferentes. Me dejaste pensando.

source: ...Wait, what!?
es: ...Espera, ¿¡qué!?

source: We can control our actions, but we can't control how others around us perceive those actions. You know?
es: Podemos controlar nuestras acciones, pero no podemos controlar como los demás perciben esas acciones, ¿sabes?

source: All those times I thought I was being playful and fun, others were just seeing a boob three different ways.
es: Todas esas veces que creí que me estaba divirtiendo con mis amigos, otros miraban un banco de formas diferentes.

source: I'm going to concentrate more during social situations about how my actions affect other people-
es: Voy a concentrarme más durante situaciones sociales y el cómo mis acciones afectan otras personas-

source: Then maybe they'll see me as King Frungle three different ways! Until then I'll apologize for acting like a boob~
es: ¡Y quizás me verán como King Frungle de tres formas diferentes! Pero por ahora, pido perdón por actuar como un grupo de peces~

source: I'm so sorry, Bart!
es: ¡Perdón, Bart!

source: Hey no worries. It's like water off a token friend's back, ha ha.
es: Hey, no hay problema. Gracias por hablar con él.

source: YOUR advice? YOUR advice helped him?
es: ¿TU consejo? ¿TU consejo lo ayudó?

source: Hey, that profound nugget of wisdom has gotten me through some tough times.
es: Hey, esa frase llena de sabiduría me hizo salir de tiempos difíciles.

source: ...You know #player#, I have some advice for you. The word 'boy' looks like a boy wearing glasses...
es: ... Sabes #player#, tengo un consejo para ti. La palabra "Punto" puede verse de 153 formas diferentes...

source: That's not helpful!
es: ¡Eso no ayuda!

source: So we're already leaving, even though our restaurant in Kflab is struggling?
es: ¿Entonces ya nos vamos, incluso si nuestro restaurante en Kflab no le está yendo bien?

source: Ahh they'll get by on the few customers they have. It'll be tough for them but...
es: Ahh, van a sobrevivir con los pocos clientes que tienen. Va a ser duro para ellos, pero...

source: For now, we should focus our attention on other locations that are doing even worse!
es: ¡Por ahora, deberíamos enfocar nuestra atención en otras sucursales que le están yendo aún peor!

source: Ooh, Sounds fun!
es: ¡Ohh, suena divertido!

source: Oh. Sounds fun...
es: Oh. Suena divertido...

source: Do we have to?
es: ¿Tenemos que hacerlo?

source: Wow, things really turned around for Cannoli Sandbar!
es: ¡Wow, las cosas dieron un giro en Cannoli Sandbar!

source: Yes, they'll have no problems with all those new customers they have! It should be smooth sailing for a while.
es: ¡Sí, no van a tener problemas con toda esa nueva clientela que tienen! Les va a ir bien por un buen rato.

source: For now, we should focus our attention on other locations that are doing much, much worse.
es: Por ahora, deberíamos enfocar nuestra atención en otras sucursales que les está yendo mucho, mucho peor.

source: Ooh! Sounds fun, where are we going next?
es: ¡Ooh! Suena divertido. Ahora, ¿a dónde vamos?

source: Mmm yes, I forget! Was this next one the stinky swamp... or the active volcano?
es: ¡Mmm sí, me olvidé! ¿Sigue el pantano apestoso... o el volcán activo?

source: Yes, now off to our next restaurant! I forget, was this one the stinky swamp... or the active volcano?
es: ¡Sí, ahora a nuestro siguiente restaurante! Me olvidé, ¿sigue el pantano apestoso... o el volcán activo?

source: I mean... Do we have to?
es: Digo... ¿Tenemos que hacerlo?

source: Yes yes, off to our next restaurant! I forget, was this one the stinky swamp... or the active volcano?
es: ¡Sí sí, vamos al siguiente restaurante! Me olvidé, ¿sigue el pantano apestoso... o el volcán activo?

source: I'm tossing you in that volcano
es: Te voy a tirar al volcán

source: I'm knocking you into the mud
es: Te voy a empujar al barro

source: That's a joke, right?
es: ¿Es un chiste, no?

source: When we get to that volcano, I'm tossing you in.
es: Cuando lleguemos al volcán, te voy a tirar en él.

source: When we get to that stinky swamp, I'm knocking you into the mud.
es: Cuando lleguemos al pantano, te voy a empujar al barro.

source: I'm just going to pretend that's a joke. ...It's a joke, right?
es: Voy a pretender que es un chiste. ...Es un chiste, ¿no?

source: Ah-ha hahahaha~
es: Ah-ja jajajaja~

source: Following Kendall's suggestion, the three remaining council members renamed 'Kflab' to 'Cannoli Sandbar'.
es: Siguiendo la sugerencia de Kendall, los tres miembros del consejo restante renombraron "Kflab" a "Cannoli Sandbar".

source: A flood of tourists overwhelmed their airports, in addition to a few health-conscious visitors who arrived to the island on foot, in a completely sensible manner.
es: Un mar de turistas atestaron los aeropuertos, también llegaron algunos visitantes que llegaron a pie en una forma completamente consiente sobre su salud.

source: Wow, tourism skyrocketed after we handled the problem with Cannoli Sandbar's incredibly dumb name!
es: ¡Wow, el turismo llegó al cielo después de arreglar el problema del nombre muy tonto que tenía Cannoli Sandbar!

source: Yes, this should really help the prospects for...
es: Sí, esto debería de ayudar a la perspectiva de...

source: (sigh) ...the "Turbo Fat" franchise....
es: (suspiro) ...La franquicia de "Turbo Fat"...

source: I already apologized for "Turbo Fat"
es: Ya me disculpé por lo de "Turbo Fat"

source: "Turbo Fat" is a great name
es: "Turbo Fat" es un buen nombre

source: "Turbo Fat" is your fault
es: "Turbo Fat" es tu culpa

source: "Turbo Fat" is Tunathy's fault
es: "Turbo Fat" es la culpa de Tunathy

source: Don't sigh at me! Turbo Fat is a great name!!!
es: ¡No me suspires! ¡¡¡Turbo Fat es un gran nombre!!!

source: I'll sigh all I want! If Cannoli Sandbar put you in charge, you'd probably call it...
es: ¡Voy a suspirar todo lo que quiera! Si estuvieras a cargo de Cannoli Sandbar, probablemente le pondrías...

source: ...'Slovenly Chubsters' or something like that.
es: ..."Bananita Polca" o algo parecido.

source: Hey, I already apologized for the whole "Turbo Fat" mistake!
es: ¡Hey, ya me disculpé por todo el error de "Turbo Fat"!

source: Hmph, if Cannoli Sandbar put you in charge, you'd probably call it... 'Slovenly Chubsters' or something like that.
es: Hmph, si estabas a cargo del nombre de Cannoli Sandbar, probablemente ibas a nombrarla... "Bananita Polca" o algo parecido.

source: Hey, that name is your fault!
es: ¡Hey, el nombre fue tu culpa!

source: Hey, that name is Tunathy's fault!
es: ¡Hey, el nombre fue culpa de Tunathy!

source: I feel a little bad for King Frungle though.
es: Igual me siento algo mal por King Frungle.

source: Yes, well there's no point in feeling sad about things like that.
es: Sí, bueno, no hay razón para sentirse mal sobre una cosa como esa.

source: It's human nature to look back on things like that and wonder how things could have gone differently.
es: Es natural en un humano mirar atrás y pensar cómo serían las cosas si fuesen diferentes.

source: But the past is in the past, nothing can be done.
es: Pero el pasado es el pasado, no podemos hacer nada.

source: We could cheer them up
es: Podríamos darle ánimos

source: There's nothing we can do
es: No podemos hacer nada

source: Oh it's only King Frungle...
es: Oh, solo es King Frungle...

source: We could always visit King Frungle and cheer them up!
es: ¡Siempre podemos visitar a King Frungle y darle ánimos!

source: Ahh, I'm afraid it's simply out of our hands.
es: Ahh, me temo que eso escapa de nuestras manos.

source: Well... I suppose it's TECHNICALLY possible.
es: Bueno... Supongo que TECNICAMENTE es posible...

source: ... ...Do we have to???
es: ... ...¿¿¿Tenemos que hacerlo???

source: You're right, there's nothing we can possibly do...
es: Tienes razón, no hay nada que probablemente podamos hacer...

source: ...We definitely can't like... visit them and cheer them up. I can't even imagine! (judgy head tilt)
es: ...Definitivamente no podemos hacer algo como... Visitarlo y darle ánimos. ¡No podría imaginarlo! (tos de forma juiciosa)

source: There's just no way! ...Right? It's beyond our reach.
es: ¡No hay manera! ...¿No? Escapa de nuestras posibilidades.

source: ... (judgy head tilt)
es: ... (inclina la cabeza de forma juiciosa)

source: ... ... (judgy head tilt)
es: ... ... (tos e inclina la cabeza de forma juiciosa)

source: ... ...Please don't make me go!
es: ... ...¡Por favor, no me hagas ir!

source: I mean it's only King Frungle!
es: ¡Me refiero a que es solo King Frungle!

source: If it were anyone else, maybe we'd have to like... visit them and cheer them up.
es: Si fuese alguien más, tal vez podríamos, no se... Visitarlo y darle ánimos.

source: Mmm... I suppose, technically.
es: Mmm... Supongo, técnicamente.

source: ... ...I really don't want to do that though!
es: ... ...¡Pero yo no quiero hacer eso!

source: So hmm... IF we were to change the name...
es: Entonces... Si cambiáramos el nombre...

source: Yes, that's a great idea! We can change it to something like... Frungleton! Or Frungle Lump Isle.
es: ¡Sí, es una buena idea! Podríamos cambiarlo a... ¡Frungleton! O Isla Frungle Lump.

source: Mmmm well, it's unfair to name it after just one of the four council members...
es: Mmmm bueno, es injusto nombrar a la isla con el nombre de solo uno de los cuatro miembros del consejo...

source: THREE council members.
es: TRES miembros del consejo.

source: Three?
es: ¿Tres?

source: Yyyyyyep. Three actual council members and a self-proclaimed "king".
es: Ssssssep. Tres miembros del consejo y un autoproclamado "rey".

source: Self-proclaimed!? Well, why don't we just name it after...
es: ¿¡Autoproclamado!? Bueno, entonces por qué no lo nombramos con el nombre de...

source: You four, but different
es: Ustedes cuatro, pero diferente

source: You three
es: Ustedes tres

source: Us two
es: Nosotros dos

source: Name it after you four... but just in a punchier way!
es: Usen sus cuatro nombres... ¡Pero de una forma más pegadiza!

source: Or I was thinking, if w-
es: Yo estaba pensando, si solo-

source: I like #player.possessive# idea! How about a name like... Frungle and Friends? King Frungle and the Lumps!
es: ¡Me gusta la idea de #player#! Qué les parece... ¿Frungle y Amigos? ¡King Frungle y los Lumps!

source: ...'King Frungle And The Lumps'? We're naming an island. Not a pop music act from the ancient 20th century.
es: ..."King Frungle y los Lumps"? Estamos nombrando una isla. No una banda musical pop de los inicios del siglo 20.

source: King Frungle And The Lumps
es: King Frungle y los Lumps

source: Name it after you three... If we remove King Frungle's letters from the name, that leaves us with what. K-A-B? Hmm...
es: Usen sus tres nombres... Si sacamos las letras de King Frungle del nombre, eso nos deja con qué. ¿K-A-B? Hmm...

source: Name it after the two of us... Fat Sensei and #player#!
es: Usemos nuestros dos nombres... ¡Fat Sensei y #player#!

source: ...What?
es: ...¿Qué?

source: #player#-Fat Isle! Or... Fat-#player#-sei-burg!
es: ¡Isla #player#-Fat! O... ¡Fat-#player#-guay!

source: #player#, you already stuck us with the name 'Turbo Fat'. Please stop making up names. You're terrible at it.
es: #player#, ya nos pegaste el nombre "Turbo Fat". Por favor, deja de inventar nombres. Eres terrible en esto.

source: But it's so fun...
es: Pero es divertido...

source: Name it after Fat Sensei! I have the perfect name too!
es: ¡Usen el nombre de Fat Sensei! ¡Y también tengo el nombre perfecto para la isla!

source: ...The perfect name?
es: ...¿El nombre perfecto?

source: Yes please, enlighten us. What do YOU want to call it?
es: Sí por favor, ilumínanos. ¿Qué nombre TÚ le pondrías?

source: Fatten Island
es: Isla Fat-iga

source: Fatsmania
es: Fatmania

source: The Isle Of Fats
es: La Isla Fat-ástica

source: We'll call it Fatten Island! You know?
es: ¡Le vamos a poner Isla Fat-iga! ¿Qué opinan?

source: We'll call it Fatagascar! You know?
es: ¡Le vamos a poner Fatagascar! ¿Qué opinan?

source: We'll call it The Isle Of Fats! You know?
es: ¡Le vamos a poner La Isla Fat-ástica! ¿Qué opinan?

source: We'll call it Fatsmania! You know?
es: ¡Le vamos a poner Fatmania! ¿Qué opinan?

source: (cough) ...Are you quite done?
es: (tos) ...¿Terminaste?

source: Yeah, sure.
es: Sí, listo.

source: So anyways... I was thinking if we remove King Frungle's letters from the name, that leaves us with what. K-A-B? Hmm...
es: Como sea... Estaba pensando que si sacamos las letras de King Frungle del nombre, eso nos deja con qué. ¿K-A-B? Hmm...

source: Kendall, Alyssa and Bart...
es: Kendall, Alyssa y Bart...

source: Cannoli Sandbar? Oh that's much better!
es: ¿Cannoli Sandbar? ¡Oh, eso es mucho mejor!

source: What? No! What about... Cannoli Sandblumps? Or Canfrungle Alyssabar?
es: ¿Qué? ¡No! Y que tal... ¿Cannoli Sandblumps? ¿O Canfrungle Alyssabar?

source: Hm. Everything works out if we just take out King Frungle's name. Thoughts?
es: Hm. Todo funciona si sacamos a King Frungle del nombre. ¿Opiniones?

source: THOUGHTS!?! I have a few THOUGHTS!!! Is a string of profanities a THOUGHT!?
es: ¡¿¡OPINIONES!?! ¡¡¡Yo tengo unas cuantas OPINIONES!!! ¿¡Una lista de blasfemias es una OPINIÓN!?

source: I like Cannoli Sandbar
es: Me gusta Cannoli Sandbar

source: I still like #bad_island_name#
es: Todavía me gusta #bad_island_name#

source: I like Cannoli Sandblumps
es: Me gusta Cannoli Sandblumps

source: I still like my other name
es: Todavía me gusta mi otro nombre

source: I like Canfrungle Alyssabar
es: Me gusta Canfrungle Alyssabar

source: Ooh, I like the sound of Cannoli Sandbar! Let's call it that.
es: ¡Ooh, me gusta el sonido de Cannoli Sandbar! Pongámosle ese nombre.

source: Fair enough, Let's vote.
es: Me parece justo, votemos.

source: I still like #bad_island_name#! C'mon who's with me? #bad_island_name#!!! Let's call it that.
es: ¡Todavía me gusta #bad_island_name#! Vamos, ¿quién está conmigo? ¡¡¡#bad_island_name#!!! Pongámosle ese nombre.

source: How about this, let's take a vote.
es: Qué les parece esto, votemos.

source: Actually, I like the sound of Cannoli Sandblumps! Let's call it that.
es: ¡En realidad, me gustó el sonido de Cannoli Sandblumps! Pongámosle ese nombre.

source: I still like that other name I came up with...
es: Todavía me gusta el otro nombre que inventé...

source: Actually, I like the sound of Canfrungle Alyssabar! Let's call it that.
es: ¡En realidad, me gustó el sonido de Canfrungle Alyssabar! Pongámosle ese nombre.

source: All in favor of Cannoli Sandbar?
es: ¿Todos a favor de Cannoli Sandbar?

source: Oooh sorry, that's five against one...
es: Oooh perdón, cinco contra uno...

source: You're all so mean!
es: ¡Son todos muy malos!

source: Ooh. five against zero. Hey cool, haha. Two birds with one stone.
es: Ooh. Cinco contra cero. Perfecto, jaja. Dos pájaros de un tiro.

source: Oooh sorry, that's four against two...
es: Oooh perdón, cuatro contra dos...

source: Ooh. Four against one. Hey cool, haha. Two birds with one stone.
es: Ooh. Cuatro contra uno. Perfecto, jaja. Dos pájaros de un tiro.

source: So, you're not quite the hot tourist spot you want to be huh?
es: Así que, este lugar no es un imán para los turistas, ¿no?

source: Well sadly - tourism has been pretty close to zero since we founded this island a few years ago!
es: Tristemente - ¡el turismo es casi cero desde que fundamos esta isla hace algunos años!

source: But the four of us are looking at our options for improving things. We're open to any ideas you have of course!
es: Pero los cuatro estamos viendo opciones para mejorar las cosas. ¡Y estamos abierto a opiniones e ideas!

source: Well, first of all... "Kflab" is a very... unconventional name. Does it mean anything?
es: Bueno, primero... "Kflab" no es un nombre... convencional. ¿Significa algo?

source: It's the first letter of our names. Kendall, King Frungle Lumps III, Alyssa and Bart. K-F-L-A-B.
es: Es la inicial de nuestros nombres. Kendall, King Frungle Lumps III, Alyssa y Bart. K-F-L-A-B.

source: You see we all – well, some of us had different ideas for the island's name. So this was the compromise we agreed upon.
es: Es que mira - teníamos nuestras ideas diferentes con respecto al nombre de la isla. Así que esto es lo que aceptamos.
