Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: GREAT!? They did GREAT? Kkkh, be honest!
es: ¿¡BIEN!? ¿Lo hizo BIEN? ¡Pfff, se honesto!

source: A bowl of cereal is "great"! #player# served some Grade-A horse molasses, there was nothing great about it...
es: ¡Un tazón con cereal está "bien"! #player# acaba de servir un perfecto plato de engrudo, y no creo que eso sea para decir "bien"...

source: Fine yes, you didn't do great. You did mmm...
es: Bueno sí, no lo hiciste bien. Lo hiciste mmm...

source: ... You did okay for your first time.
es: ... Aceptable para ser tu primera vez.

source: ... ...You did your first time.
es: ... ...Hiciste tu primera vez.

source: Thank you. I'm sorry, I have to remain impartial.
es: Gracias. Y perdón, tengo que mantenerme imparcial.

source: Yeah good job, extremely impartial. I think you broke their heart! Good job.
es: Sí, buen trabajo siendo extremadamente imparcial. ¡Creo que le rompiste el corazón! Buen trabajo.

source: Ahh sorry I'm late. I had to use the loo.
es: Ahh perdón por la tardanza. Tenía que usar el baño.

source: FAT SENSEI!? You're on the committee?
es: ¿¡¡FAT SENSEI!!? ¿Eres uno de los jueces?

source: Ahh... ... yes? And I had to use the loo. I don't hear you making a fuss about that.
es: Ahh... ... ¿Sí? Y también usé el baño. No te escuché hacer un escándalo por eso.

source: Go easy on me
es: No seas duro conmigo

source: You could have told me
es: Podrías habérmelo dicho

source: I can't believe you used the loo!
es: ¡No puedo creer que fuiste al baño!

source: We're giving ourselves a plaque?
es: ¿Nos estamos dando la placa?

source: The loo? The LOO!?! I can't BELIEVE you used the loo! THIS IS AN OUTRAGE!!
es: ¿El baño? ¡¿¡El BAÑO!?! ¡No puedo CREER que también usaste el baño! ¡¡ESTO ES UN ULTRAJE!!

source: Hmph, too little too late.
es: Hmpm, un poco tarde para eso.

source: ...Just wait and see the muted celebration I deliver next time YOU use the loo!
es: ...¡Solo espera y ya vas a ver la celebración muda que haré la próxima ves que TU uses el baño!

source: ...I feel like this is something you could have told me five minutes ago.
es: ...Creo que esto es algo que deberías de haberme dicho hace cinco minutos.

source: Ah-haha, come now. Where's the theater in that! Let me have my fun~
es: Ah-jaja, vamos. ¡Dónde está el teatro en eso! Deja que también me divierta~

source: So we're jumping through all these hoops, so that we can win a Zagma Chef Of The Year plaque... from OURSELVES?
es: Entonces voy a hacer todo esto, así gano la placa Zagma Chef Del Año... ¿Para NUESTRO restaurante?

source: I hope you'll at least go easy on me!
es: ¡Al menos no vas a ser muy duro conmigo!

source: Mwah-hahaha. You'd like that wouldn't you!
es: Muajajajaja. ¡Eso te gustaría, ¿no?!

source: Well, I hope you'll at least go easy on me!
es: ¡Bueno, espero que al menos no seas muy duro conmigo!

source: Oh, do you two know each other already? Will this still be okay?
es: Oh, ¿ustedes dos se conocen? ¿Es correcto continuar sabiendo esto?

source: Yes yes, don't worry. I'm entirely capable of being impartial.
es: Sí sí, no se preocupen. Soy muy capaz en ser imparcial.

source: Mmmm, I'm not so sure...
es: Mmmmm, no estoy seguro...

source: Oh it's no big deal! We weren't actually going to judge them this time anyways.
es: ¡No hay problema! De todas formas, hoy no vamos a juzgar a ningún participante.

source: #player#, why don't you show us what you can do? This one's just for practice.
es: #player#, ¿por qué no nos muestras lo que puedes hacer? Esto es solo práctica.

source: Yes well, I will maybe judge you a little. But maybe not JUDGING you judging you.
es: Si, bueno, puede que yo te juzgue un poco. Pero no voy a JUZGARTE al juzgarte.

source: I'LL be judging you judging you! Ah-hahahah!!!
es: ¡Yo SÍ voy a juzgar juzgándote! ¡¡¡Muajajajaja!!!

source: D-don't be like that!
es: ¡N-no seas así!

source: As Turbo Fat grew more and more popular, they were finally able to branch out into more competitive venues.
es: Como Turbo Fat es más y más popular, finalmente podemos abrirnos a opciones más competitivas.

source: Their Chocolava Canyon location was their most successful location, always bustling with customers. But, they struggled to stand out among other prestigious restaurants nearby.
es: La sucursal en Volcán de Chocolava era su sucursal más exitosa, siempre lleno de clientes Pero, les costaba destacar entre los otros restaurantes prestigiosos de al rededor.

source: Mmm? Did something catch your eye?
es: ¿Mmm? ¿Algo te llamó la atención?

source: Look at this! This CarbCraft restaurant apparently won "Zagma Chef Of The Year" too.
es: ¡Mira esto! Este restaurante CarbCraft aparentemente también ganó "Zagma Chef Del Año".

source: ...I've seen this same plaque at every restaurant here! What the heck is a Zagma Chef of the Year?
es: ...¡Ya vi esta placa en cada restaurante de la zona! ¿Qué se supone que es el Zagma Chef Del Año?

source: Oh, you haven't heard of Zagma? Because I know everything about Zagma.
es: Oh, ¿no escuchaste hablar de Zagma? Porque yo se todo sobre Zagma.

source: ...Really?
es: ...¿En serio?

source: Go on, ask me about Zagma.
es: Adelante, pregúntame sobre Zagma.

source: I just don't want our customers thinking that somehow we're bad chefs because we don't have a silly plaque.
es: Solo no quiero que los clientes piensen que de alguna forma seamos malos chefs solo por no tener una tonta placa.

source: Mmm... Well.
es: Mmm... Bien.

source: Getting one of those plaques isn't easy. It will require a considerable investment. But, I can point you in the right direction.
es: Ganar una de esas placas no es fácil. Se requiere una dedicación considerable. Pero, te puedo apuntar en la dirección correcta.

source: Can't you win it for me?
es: ¿No lo puedes ganar por mi?

source: A considerable investment?
es: ¿Una dedicación considerable?

source: The right direction?
es: ¿La dirección correcta?

source: I can do it myself!
es: ¡Lo puedo hacer solo!

source: Can't you just win 'Chef Of The Year' yourself instead? You're already a great chef!
es: ¿Tu no puedes ganar la placa "Chef Del Año" por mi? ¡Ya eres un gran chef!

source: No no. I have a conflict of interest, it's best if you do it yourself.
es: No no. Tengo un conflicto de intereses, es mejor que lo hagas por ti mismo.

source: Conflict of interest hmm? I think you're just lazy.
es: ¿Conflicto de intereses, hmm? Creo que solo eres vago.

source: H-hey! Being lazy is a conflict too...
es: ¡H-hey! Ser vago también es un conflicto...

source: A considerable investment? I've been practicing every day for weeks now!! What kind of investment do you mean?
es: ¿Una dedicación considerable? ¡¡Pero si practico todos los días desde hace varias semanas!! ¿Qué tipo de dedicación te refieres?

source: Ohhh, about ¥3000 should cover it. Cash is fine~
es: Ohhh, con solo ¥3000 debería de bastar. En efectivo está bien~

source: Ha ha, nice try...
es: Ja ja, buen intento...

source: Point me in the right direction? ...Because I figured I'd blindly head east again.
es: ¿Apuntar a la dirección correcta? ...Porque voy a ir ciegamente al este, otra vez.

source: "Blindly head east again!?" Hmph don't be so naive. You can't wandering in a random direction and expect to find anything.
es: ¿¡"Ciegamente al este, otra vez"!? Hmph, no esperes caminar hacia una dirección cualquiera y encontrar todo lo que busques.

source: ...But... ...Yes, east is fine.
es: ...Pero... ...Sí, al este está bien.

source: Lucky guess~
es: Solo es cuestión de suerte~

source: Oh I don't need your help! I'll just blindly head east again.
es: ¡No necesito tu ayuda! Voy a ir ciegamente al este, otra vez.

source: Oh hello! Have you seen someone around here, short and purple? Goes by Turbo?
es: ¡Oh, hola! ¿Han visto a alguien por aquí, no muy alto y púrpura? Le dicen Turbo.

source: Uhh yeah, they were headed back that way! Just keep walking, you can't miss them.
es: Uhh, sí, ¡Se fue en esa dirección! Solo sigue caminando derecho, no puedes perderlo.

source: Idiot, don't just tell them! ...If you act coy, they'll give us snacks.
es: ¡Idiota, no se lo digas!. ...Si te haces el tonto, puede que nos dé algo para comer.

source: What? Oh man! I messed it up again!?
es: ¿Qué? ¡Ay, no! ¿¡Otra vez metí la pata?

source: That's okay! I can make you some snacks.
es: ¡Está bien! Puedo cocinarles algunos snacks.

source: Snacks ehh? ...What's in it for us!
es: Snacks, ¿ehh? ... ¡¿Y qué ganamos con eso?!

source: ...Ignore my idiot friend here, they're not ehh... not the sharpest shirt in the drawer. We'd love some food.
es: ...Ignora a mi amigo idiota, no es ehh... no es el martillo más afilado del cajón. Nos gustaría algo de comida.

source: Shh, you're blowing it! You have to act coy!!!
es: Shh, ¡lo estás arruinando! ¡¡¡Debes hacerte el tonto!!!

source: I'll just cook
es: Voy a cocinar

source: I'll just wait
es: Voy a esperar

source: I'll just leave
es: Voy a irme

source: I'm just going to start cooking. You two do whatever you want.
es: Creo que voy a empezar a cocinar. Ustedes dos hagan lo que quieran.

source: Maybe we'll eat it and maybe we won't! I'm not telling you anything!
es: ¡Tal vez comeremos, tal vez no! ¡No te voy a decir nada!

source: Namory, the coy part is over! What's wrong with you!?
es: ¡Namory, ya no te hagas el tonto! ¿¡Qué pasa contigo!?

source: I'm just going to wait while you two work this out.
es: Solo voy a esperar mientras ustedes dos lo charlan.

source: Maybe we'll work it out and maybe we won't! I'm not telling you anything!
es: ¡Tal vez lo charlemos, tal vez no! ¡No te voy a decir nada!

source: I'm just going to leave, you two are confusing me. ...Are you hungry or not!?
es: Creo que voy a irme, ustedes dos me están confundiendo. ...¿¡Tienen hambre o no!?

source: Maybe we're hungry, and maybe we aren't! I'm not telling you anything!
es: ¡Tal vez tenemos hambre, tal vez no! ¡No te voy a decir nada!

source: WALK home? ...You're a squirrel, don't you live up in a tree?
es: ¿CAMINAR a casa? ...Eres una ardilla, ¿no vives en la copa de un árbol?

source: ...Well, crap.
es: ...Bueno, diablos.

source: Say, I know this is a long shot but ehhh... How's your throwing arm?
es: Digamos, se que es un tiro largo, pero ehhh... ¿Cómo está tu brazo lanzador?

source: You want me... to THROW you home?
es: ¿Quieres que yo... te LANCE a tu casa?

source: Just think of it like basketball, like you're lobbing a three pointer into a hoop fifteen meters off the ground!
es: Solo piensa que es basketball, ¡y estás lanzando un tiro de tres puntos a un aro a quince metros del suelo!

source: It'll be easy! Well, unless you miss... Then you'll have one heck of a mess to clean up.
es: ¡Será fácil! Bueno, a menos que falles... Entonces tendrías un desastre muy grande que limpiar.

source: I'm... going to go.
es: Yo... me tengo que ir.

source: Wait! ...Before you go, can you do one last thing?
es: ¡Espera! ...Antes de que te vayas, ¿podrías hacer una última cosa?

source: Perhaps just a quick bite to eat?
es: ¿Quizás algo rápido para comer?

source: What's wrong with you!!!
es: ¡¡¡Pero qué es lo que te pasa!!!

source: Mara? ...What are you doing here?
es: ¿Mara? ...¿Qué estás haciendo aquí?

source: Well... I know you didn't have time to make breakfast! But it turns out I have enough time to follow you around all day!
es: Bueno... Puede que no tengas tiempo para hacer el desayuno, ¡pero yo tengo el tiempo suficiente para seguirte todo el día!

source: ...Just cook me something quick, I'll totally get out of your hair!
es: ...Solo cocíname algo rápido, ¡y te juro que desapareceré de tu vista!

source: You tracked me all the way here just for breakfast? There's a German restaurant a block from our house...
es: ¿Me seguiste todo el camino hasta aquí solo para que te haga el desayuno? Hay un restaurante a una calle de nuestra casa...

source: Ohhh yeah... I kinda forgot that place existed...
es: Ohhh sí... Creo que me olvidé que ese lugar existía...

source: ...I mean, I guess I'll walk all the way back there... That's a pretty long walk on an empty stomach...
es: ...Está bien, creo que caminaré todo el camino de vuelta... Un largo camino para un estómago vacío...

source: Okay fine
es: Bueno, está bien

source: Okay fine fine, stick around and I'll cook you something!
es: Bueno, está bien, está bien, ¡quédate y voy a cocinar algo para ti!

source: Now we're talking!
es: ¡Ahora estamos hablando!

source: Okay fine, I'll cook you something... Something indeed! Mwah ha ha ha ha ha!
es: Bueno, está bien, voy a cocinarte algo... ¡Algo por supuesto! ¡Muajajajaja!

source: Oooh okay! ...Evil laugh meal. Now we're talking!!!
es: ¡Ohhh bien! ...Comida con risa malvada. ¡¡¡Ahora estamos hablando!!!

source: Okay okay fine, twist my arm why don't you!
es: Bueno, está bien, ¡y por qué no también me tuerces el brazo!

source: Okay fiiiine, I mean if you're going to make me feel all guilty about it...
es: Bueeeeeeeno, está bien, si es que me vas a hacer sentir culpable por eso...

source: Okay, so tell me everything you know! Who's been feeding you?
es: Bien, ¡díganme todo lo que saben! ¿Quién les da de comer?

source: (Chitter, chitter...)
es: (Chillido, chillido...)

source: They bring us food every day. ...And that's everything we know.
es: Nos trae comida todos los días. ...Y eso es todo lo que sabemos.

source: What!? You see them every day, how could you not know ANYTHING!?
es: ¿¡Qué!? Lo ven todos los días, ¿cómo es posible que no sepan NADA?

source: Well! ...They've never attacked us, and we can't eat them. So, details about their name or appearance fall out of our tiny squirrel brains.
es: ¡Bueno! ...No lo podemos comer. Así que, detalles de su nombre o apariencia no nos caben en nuestros cerebros de ardilla.

source: Their food is delicious though!
es: ¡Aunque su comida es deliciosa!

source: I want the last five minutes of my life back...
es: Quiero los últimos cinco minutos de mi vida de vuelta...

source: Wow. That is one fat squirrel!
es: Wow. ¡Pero que ardilla gorda!

source: Excuse me? That's very rude.
es: ¿Disculpa? Eso fue muy grosero.

source: Oh -- I didn't see your friend, sorry. Those are umm, two fat squirrels.
es: Oh -- No vi a tu amigo, perdón. Pero que umm, dos ardillas gordas.

source: Thank you.
es: Gracias.

source: And hmm... why are those sticks stuck in the ground?
es: Y hmm... ¿Qué son esos palos clavados en la tierra?

source: Is this a fence post?
es: ¿Es una valla?

source: Is this a lawn dart?
es: ¿Es un juego?

source: Is this a grave?
es: ¿Es una tumba?

source: Is this a pigeon?
es: ¿Es una paloma?

source: Oh, you were mourning your little squirrel friend! That's so sad...
es: ¡Oh, estaban de luto por su pequeña ardilla amiga! Que triste...

source: Oh, you were playing lawn darts! And the cup is to keep score.
es: ¡Oh, estaban jugando al lanzamiento de aros! Solo que con una taza en lugar de aros.

source: Oh no, someone stole the rest of your fence!
es: ¡Oh no, alguien se robó el resto de la valla!

source: This one fence post is all that's left. And they left the cup... as a ransom note!
es: Y esa valla es lo único que quedó. Y también dejaron una taza... ¡Y una nota de rescate!

source: Oh, it's a giant pigeon! It's buried upside-down, but these two pointy parts are its legs.
es: ¡Oh, es una paloma gigante! Está enterrada al revés, y esas cosas puntiagudas son sus patas.

source: The cup is its umm... tail, and you three are playing a game! Am I close?
es: La taza es su umm... cola, ¡y los tres están jugando a algún juego! ¿Estoy cerca?

source: What? No no, nothing like that.
es: ¿Qué? No no, nada de eso.

source: Someone comes by and leaves food out for us squirrels once a day!
es: ¡Alguien viene y deja comida para nosotras, las ardillas, una vez por día!

source: ...But we snuck over early so we could have it to ourselves. Chitter chitter!
es: ...Pero llegamos temprano, así podemos tener todo para nosotras. ¡Chip chip chip!

source: Oh! Hmm... Is this person short and purple? Goes by Turbo?
es: ¡Oh! Hmm... ¿Esa persona es bajita y púrpura? Le dicen Turbo.

source: Oh! Hmm... Is this person short and purple? Goes by Fat Sensei?
es: ¡Oh! Hmm... ¿Esa persona es bajita y púrpura? Le dicen Fat Sensei.

source: Maaaaaaybe! ...We'll tell you everything we know, if you feed us.
es: ¡Tal veeeeeez! ...Podemos decirte todo lo que sabemos, si nos das de comer.

source: Really? You're still hungry!?
es: ¿En serio? ¿¡Todavía tienen hambre!?

source: You've got a lot to learn about squirrels...
es: Tienes que aprender mucho sobre las ardillas...

source: Oof, it seems I overate again.
es: Uff, parece que otra vez comí de más.

source: I'm not going to throw you into your tree, so please don't ask.
es: No voy a lanzarte a la copa de tu árbol, así que no preguntes.

source: No no, that's alright. I've engineered a system of ropes and pulleys, I can just pull myself up.
es: No no, está bien. He diseñado un sistema de cuerdas y poleas, puedo subirme por mi cuenta.

source: You installed an entire pulley system... just to avoid climbing home after you overeat!?
es: Instalaste un sistema de poleas entero... ¿¡solo para evitar escalar tu árbol después de que comer de más!?

source: That doesn't even make sense. How can someone that lazy also be this motivated?
es: Eso no tiene sentido. ¿Como alguien tan perezoso puede estar tan motivado?

source: ...Ah. You've never met an engineer before, have you...
es: ...Ah. Parece que nunca conociste a un ingeniero, ¿no?...

source: You again!?
es: ¿¡Tú de nuevo!?

source: Sorry! Just a quiiiiiick bite.
es: ¡Perdón! Solo un bocado ráaaaaapido.

source: What happened to that German restaurant? I thought they had a nice breakfast.
es: ¿Qué pasó con el restaurante? Pensé que tenían un buen desayuno.

source: I like their food, but this morning they had a line out the door!
es: Me gusta su comida, ¡pero esta mañana tenían una cola hasta afuera!

source: Ohhh I see. ... ...So you're saying, they're too 'kraut-ed'?
es: Ohhh, ya veo. ... ... ¿Podrías decir que el plato principal fue cola... de res?

source: ...Nevermind. I've suddenly lost my appetite.
es: ...No importa. De repente perdí mi apetito.

source: Get back here!!!
es: ¡¡¡Vuelve aquí!!!

source: Oh it's that gravesite again. But there are no squirrels here...
es: Oh, es este cementerio otra vez. Pero las ardillas no están aquí...

source: Hmm, this cup has an inscription! I didn't notice this before. 'We won't forget -- Turbo Fat'.
es: ¡Hmm, esta taza tiene una inscripción! No la había visto antes. "No nos olvidaremos -- Turbo Fat".

source: Chitter chitter. Aww, we're too early! There's no food yet...
es: Chip chip chip. ¡Aww, es muy temprano! Todavía no hay comida...

source: We'll come back in a little while.
es: Vamos a volver en un rato.

source: Oh that's okay! I can make you something quick.
es: ¡Oh, está bien! Puedo hacerles algo rápido.

source: Hooray!
es: ¡Hurra!

source: So what should we call our new restaurant?
es: ¿Entonces como deberíamos de llamar nuestro nuevo restaurante?

source: Hmm yes. Yes yes well, a name is important. It should reflect our identity and set us apart from our competitors.
es: Hmm sí. Sí sí, el nombre es importante. Debe reflejar nuestra identidad y separarnos de nuestros competidores.

source: I was thinking something like...
es: Estaba pensando algo como...

source: Something like... Junjorito?
es: Algo como... ¿Junjorjito?

source: Junjorito
es: Junjorjito

source: What on earth is a junjorito?
es: ¿Qué diablos es un junjorjito?

source: I didn't say we had to call it Junjorito! Just something LIKE Junjorito.
es: ¡No dije que debamos llamarlo Junjorjito! Solo algo PARECIDO a Junjorjito.

source: Something like... Caboodles?
es: Algo como... ¿Don Chow?

source: Caboodles
es: Don Chow

source: What on earth is a caboodle?
es: ¿Qué diablos es un Don Chow?

source: You know, like kitten caboodles! Or is it kit 'n caboodles? I don't know... It's just a cute nonsense word!
es: ¡Ya sabes, como la propaganda! Si es rico, debe ser por Don Chow. No se... ¡Algo pegadizo!

source: Something like... Eaties?
es: Algo como... ¿Comidita?

source: Eaties
es: Comidita

source: What on earth is an eatie?
es: ¿En serio? ¿Comidita?

source: You know, sort of like foodies... But a friendlier version of it!
es: Por supuesto, suena muy lindo... ¡El diminutivo ayuda mucho!

source: Something like... The Fats of Life?
es: Algo como... Más Rica la del Barrio

source: The Fats of Life
es: Más Rica la del Barrio

source: Really? You want our restaurant's name to pay homage to a sitcom from what... the 20th century?
es: ¿En serio? Me suena a una telenovela que miraría mi madre una y otra vez.

source: Yeah! It's sort of plays off of your name you know? Because you're Fat Sensei! The Fats of Life!
es: Con razón pensé en ese nombre. Podríamos aprovechar si existe algún fan club.

source: Something like... Sparky's?
es: Algo como... ¿Mezclados Libres?

source: Sparky's
es: Mezclados Libres

source: What on earth is a sparky?
es: ¿Qué diablos es un mezclado libre?

source: Yeah it's like, a cute little punchy name. Sparky's! Doesn't it sound fun?
es: ¡Es como serviríamos la comida! Mucha variedad, y tienes libertad de comprar.

source: Something like... Smack Dab?
es: Algo como... ¿Grr-Idóneo?

source: Smack Dab
es: Grr-Idóneo

source: What on earth is a smack dab?
es: ¿Qué diablos significa grr idóneo?

source: Oh like that phrase, smack dab in the middle! We'll be smack dab!
es: Me gusta como suena. ¡Si tu estómago hace ruido, tenemos la comida justa!

source: Hmm hmm, yes. Yes, I see your point, we should give our restaurant a really stupid name.
es: Hmm hmm, sí. Sí, ya veo tu punto, deberíamos darle al restaurante un nombre muy estúpido.

source: There aren't a lot of restaurants with stupid names. A name like that could carve out a niche with stupid customers.
es: No hay muchos restaurantes con nombres estúpidos. Un nombre así atraería una oleada de clientes estúpidos.

source: No, not a STUPID name, just something distinctive...
es: No, no un nombre ESTÚPIDO, solo algo distintivo...

source: No, no -- you had it right the first time! Stupid name it is.
es: No no -- ¡tenías razón desde el principio! Queda el nombre estúpido.

source: I'll let you come up with it, it seems you have a talent for this.
es: Dejaré que lo nombres, parece que tienes talento para esto.

source: Th... thank you? I think...
es: Gr... ¿gracias? Creo...

source: Well, you were right. You are a terrible chef.
es: Sí, tenías razón. Eres un chef terrible.

source: However, your butt speech really spoke to me. Maybe I've been sitting on my butt too much lately, too.
es: Sin embargo, me diste mucho tiempo para pensar. Creo que necesito hacer algo con mi tiempo libre.

source: Well, it would be a shame for someone like you to sit on a butt!
es: ¡Sí, sería una lástima que alguien como tú se la pase sentado sin hacer nada!

source: I suppose it wouldn't be the worst idea to open a restaurant together.
es: Supongo que no sería la peor idea abrir juntos un restaurante.

source: I could help you with your cooking, and you could help me to not sit on butts.
es: Yo te ayudo con la cocina, y tú me ayudas teniendo algo para hacer.

source: That's a great idea
es: Es una buena idea

source: That's a terrible idea
es: Es una terrible idea

source: I'm not sure
es: Tengo mis dudas

source: Oh! Oh wow! That would be great.
es: ¡Oh! ¡Oh wow! Eso sería genial.

source: But wait -- isn't opening a restaurant risky? I've heard 90 percent of restaurants fail in their first year...
es: Pero espera -- ¿abrir un restaurante no es riesgoso? Escuché que el 90 porciento de los restaurantes fallan en su primer año...
