Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: Sidger's cooked everything today, I've just been coaching them. How would it even make sense for me to-
es: Sidger hoy cocinó todo, yo solo lo estaba entrenando. ¿Cómo tendría sentido que yo-

source: This has nothing to do with me, I haven't cooked a single thing today. I've just been watching Sidger-
es: Yo no tengo nada que ver en esto, hoy no cociné ningún pedido. Solo estaba viendo que Sidger-

source: Look who's at the stove, they didn't even move an inch! how could you possibly think that I-
es: ¡Mira quién está con el horno, yo no me moví ni un centímetro! ¿Cómo puedes pensar que yo-

source: Now now, you shouldn't go around blaming each other. #player#, you need to be more of a team player like Sidger.
es: Calma calma, no deberías de echarle la culpa a los demás. #player#, deberías ser un miembro del equipo, como Sidger.

source: ...Remember what I was saying about a delicate balance?
es: ...¿Recuerdas lo que te dije sobre el delicado equilibrio?

source: ...Teach me...
es: ...Enséñame...

source: I'll focus on my cooking
es: Me centraré en mi cocina

source: Heh heh heh. Sorry, you're good as done for.
es: Jejeje. Perdón, pero no puedo enseñarte nada.

source: Why don't you go delicately balance yourself on top of some train tracks, you smelly little sycophant!
es: ¡Por qué no delicadamente te equilibras encima de unas vías de tren, pequeño psicópata apestoso!

source: Heh heh heh. Sorry things didn't work out for you here.
es: Jejeje. Perdón porque las cosas no funcionen a tu favor.

source: I don't need to play your petty little games, my cooking speaks for itself!
es: ¡No voy a jugar tus pequeños juegos, mis comidas hablan por sí misma!

source: Heh heh heh. Well, can't say I didn't try.
es: Jejeje. Bueno, no digas que no lo intenté.

source: I'll give you my contact info though! You can use me as a reference when you're job hunting.
es: ¡Igual te daré mi información de contacto! Puedes usarme de referencia cuando busques trabajo.

source: (grumble) I already have a job...
es: (refunfuño) Ya tengo un trabajo...

source: So... Is it true you give out free desserts to people on their birthday?
es: Entonces... ¿Es cierto que le dan postre gratis a la gente en su cumpleaños?

source: Free desserts? Hmm, sure why not. ...We give people free desserts on their birthday, if they pay for them.
es: ¿Postre gratis? Hmm, sí, por qué no. ...Daremos postres gratis en sus cumpleaños, si pagan por ellos.

source: Wait why, is your birthday coming up soon?
es: ¿Por? ¿Se acerca tu cumpleaños?

source: Oh no, no! My birthday's not for sixteen months...
es: ¡Oh no, no! Mi cumpleaños es en dieciséis meses...

source: Sixteen months!?
es: ¿¡Dieciséis meses!?

source: You mean... four months?
es: Entonces... ¿cuatro meses?

source: You were born on a leap year?
es: ¿Naciste en un año bisiesto?

source: Sixteen months!? That's an awfully long wait...
es: ¿¡Dieciséis meses!? Es una espera terriblemente larga...

source: Well, I only celebrate my birthday every other year. I don't deserve to be happy every year, or it gets to my head...
es: Es que yo solo celebro mi cumpleaños cada dos años. No merezco ser feliz todos los años, o se me sube a la cabeza...

source: That would mean your next birthday is in... four months. Right?
es: Quieres decir que tu próximo cumpleaños es en... cuatro meses. ¿Verdad?

source: Oh! Is this one of those leap year things? Like you were born February 29th?
es: ¡Oh! ¿Es una de esas cosas de años bisiestos? ¿Naciste el 29 de febrero?

source: No, no, nothing like that. I used to celebrate my birthday every year, but now I only celebrate every other year.
es: No, no, nada de eso. Celebraba mi cumpleaños todos los años, pero ahora solo lo celebro cada dos años.

source: I don't deserve to be happy every year, or it gets to my head...
es: No merezco ser feliz todos los años, o se me sube a la cabeza...

source: Ohh... Well now I feel bad for asking, I didn't know it would be such a long wait.
es: Ohh... Ahora me siento mal por preguntar, no sabía que tenías que esperar tanto.

source: ...Is there anything we can do? We could charge you for some free desserts if you like.
es: ...¿Hay algo que podamos hacer? Podemos cobrarte por algunos postres gratis si quieres.

source: Oh really? That would be nice! Thank you... That's the nicest thing anyone's ever done for me!
es: ¿Oh en serio? ¡Eso sería muy lindo de tu parte! Gracias... ¡Es lo más lindo que alguien haya hecho por mi!

source: That makes me so happ-- ohhhhh... I guess I should probably scratch out my next birthday...
es: Me hace tan feli-- ohhhhh... supongo que celebraré mi cumpleaños cada tres años...

source: Ahh yes, that's a good question.
es: Aaah sí, esa es una buena pregunta.

source: I'll get my... business partner to weigh in on this. BUSINESS.
es: Voy a consultar a mi compañero... de negocios para ayudarte. NEGOCIOS.

source: Sorry, can you remind me why I have to keep saying 'business'?
es: Perdón, pero ¿puedes recordarme por qué tengo que seguir diciendo "negocios"?

source: (whisper, whisper)
es: (susurro, susurro)

source: Ahha ha ha ha! Oh come on. I don't think anybody's going to believe THAT...
es: ¡Jajajajaja! Oh vamos. No creo que nadie vaya a creer ESO...

source: Ohhh, Fat Sensei! Sorry I'm -- I'm reeeally sorry again about messing up your sign.
es: ¡Ohhh, Fat Sensei! Perdón, lo -- lo siento muuucho por equivocarme con el letrero otra vez.

source: Ahhh that's okay. It wasn't your fault, any artist could make that mistake.
es: Ahhh está bien. No fue tu culpa, cualquier artista pudo haber hecho ese error.

source: Th-thank you! I don't know what to say.
es: ¡Gr-gracias! No se qué decir.

source: That's very understanding
es: Eso fue muy comprensible

source: But... it WAS Tunathy's fault
es: Pero... fue SU error

source: It was my fault
es: Fue mi error

source: That's very understanding of you, Sensei! I thought you'd be harder on them.
es: ¡Eso fue muy comprensible de tu parte, Sensei! Pensé que ibas a ser más duro.

source: Well, it's not fair to blame the artist in a case like this.
es: Bueno, no me parece justo culpar al artista en un caso como este.

source: Really, Sensei? ...It was all Tunathy's fault, I thought you'd be harder on them.
es: ¿En serio, Sensei? ...Pero fue error de Tunathy, pensé que ibas a ser más duro.

source: It was my fault anyways. I'm the one who filled out the form wrong.
es: De todas formas fue mi culpa. Yo fui el que llenó mal la forma.

source: No no, don't blame yourself. It was definitely the artist's fault.
es: No no, no te eches la culpa. Definitivamente fue un error del artista.

source: ...You see #player#, artists aren't normal people like you and me.
es: ...Verás #player#, los artistas no son gente normal como tú y yo.

source: Years upon years of failing to challenge themselves in any meaningful way shrivels their brain to a subhuman state.
es: Años tras años de fracasos en inimaginables desafíos de cualquier tipo, encojen su cerebro a un estado subhumano.

source: Why, most artists are lucky if they can even memorize two phone numbers.
es: Es por eso que la mayoría de los artistas tiene suerte en memorizar dos números de teléfono.

source: Well... I know my own phone number! And I used to know my old one, before I got a new phone...
es: Bueno... ¡Se mi propio número de teléfono! Y sabía mi viejo número, antes de conseguir el nuevo...

source: No, no. But artists make up for it in other ways-
es: No no. Pero los artistas lo compensan de otras formas-

source: The one quality all real artists share is their courage -- their confidence!
es: Los artistas de verdad comparten una cualidad de coraje -- ¡Su confidencia!

source: Their inhuman ability to shake off criticism like water off a duck's back, and to constantly stay productive.
es: Su habilidad inhumana de ignorar las críticas negativas como anuncios en un video, y como pueden ser constantemente productivos.

source: Yes, that's what truly sets real artists apart from worthless garbage who just sit around and never amount to anything.
es: Sí, eso es lo que separa a los artistas de verdad de la basura sin valor que solo se sienta sin llegar a nada.

source: (Comfort them)
es: (Consolar)

source: (Do not)
es: (No consolar)

source: Sorry, I thought you were going to jump in with some kind of... uplifting anecdote.
es: Perdón, pero pensé que ibas a saltar con alguna... anécdota que me levante el ánimo.

source: That's okay, Tunathy. You don't need to worry about people like them!
es: Está bien, Tunathy. ¡No tienes que escuchar a ese tipo de gente!

source: Sorry, I thought you were going to follow that up with some kind of uplifting anecdote.
es: Perdón, pero pensé que ibas a seguir con alguna anécdota que me levante el ánimo.

source: Sorry, umm...
es: Perdón, umm...

source: That's the spirit!
es: ¡Ese es el espíritu!

source: As long as you're happy
es: Mientras estés feliz

source: They're a knob
es: Es un pelmazo

source: Fat Sensei's kind of a knob. And to be honest-
es: Fat Sensei es un pelmazo. Y hablando con honestidad-

source: -the more you're disappointing people like them, the more likely it is you're doing something right.
es: -Si estás decepcionando a ese tipo de gente, quiere decir que estás haciendo algo bien.

source: Oh! ...Th-thanks!
es: ¡Oh! ...¡Gr-gracias!

source: Don't worry about what other people think! As long as you're happy, that's what counts.
es: ¡No importa lo que las demás personas piensen! Mientras estés feliz, eso es lo que cuenta.

source: As long as I'm... Ohhhhh...
es: Mientras esté fel... Ohhhhh...

source: Following the success of their restaurant in Lemony Thickets, Fat Sensei formulated plans for a second location.
es: Siguiendo el éxito del restaurante en Bosque Limonesco, Fat Sensei formuló planes para una segunda sucursal.

source: We're already opening a second franchise? Do we have the money for something like that?
es: ¿Vamos a abrir una segunda franquicia? ¿Nosotros tenemos el dinero para algo así?

source: No, but that's why it's located in the desert. This way when it fails, the real estate is cheap and there are no witnesses.
es: No, pero por eso está en un desierto, el terreno es muy barato. Y si llega a fallar, no va a haber testigos.

source: Isn't this awfully quick? Our first restaurant just barely got off the ground. Who's going to keep it running?
es: ¿No es extrañamente rápido? Nuestro primer restaurante apenas comenzó. ¿Quién lo va a mantener?

source: I left it in Sidger's hands, they can handle the restaurant fine by themselves.
es: Dejé a Sidger a cargo, puede con el restaurante.

source: They have our recipes and they'll just hire any help they need.
es: Tiene nuestras recetas y si necesita ayuda, va a contratar a alguien.

source: Really? Because...
es: ¿De verdad? Porque...

source: It seems sudden
es: Parece muy brusco

source: They're not the best
es: No es la mejor opción

source: I could stay behind
es: Podría quedarme

source: They're not the best chef, and their loyalty is-
es: No creo que sea buen chef, y su lealtad es-

source: I could stay behind and help them out, until they-
es: Podría quedarme para ayudar, hasta que sepa-

source: It seems like maybe they could use a few more weeks to-
es: Parece que podrían usar unas semanas más para-

source: Ah-hahahaha, you worry too much. Focus on your own problems first, smelly.
es: Jajajajaja, te preocupas demasiado. Concentrate primero en tus propios problemas, apestoso.

source: Okay.
es: Bueno.

source: Well... You're not quite as good as 'Closed', but I'll be back again!
es: Bueno... No fue tan bueno como "Cerrado", ¡pero voy a volver!

source: 'Turbo Fat'... Hmm... That name is going to take some getting used to.
es: "Turbo Fat"... Hmm... Costará tiempo acostumbrarse a ese nombre.

source: Yes, yes... I think that goes for all of us.
es: Sí, sí... Creo que será así para todos.

source: Don't look at me that way! This wasn't my fault. ...Wait... Was it my fault?
es: ¡No me mires así! No fue mi culpa. ...Espera... ¿Fue mi culpa?

source: Don't be ridiculous. It was Tunathy's fault! That useless little emotional punching bag.
es: No seas ridículo. ¡Fue culpa de Tunathy! Esa inútil bolsa de boxeo emocional.

source: Remind me to insult them again later! If I make them cry hard enough, maybe they'll refund our money...
es: ¡Recuérdame darle un par de insultos más tarde! Si consigo que llore mucho, puede que nos devuelva el dinero...

source: It wasn't their fault
es: No fue su culpa

source: Let's play good cop/bad cop
es: Juguemos policía bueno y policía malo

source: Cut Tunathy some slack
es: Dale un respiro a Tunathy

source: Oh poor Tunathy, let's cut them some slack.
es: Oh pobre Tunathy, dale un respiro.

source: Hmph, you just don't understand how to run a business. If nobody's crying, you're not trying hard enough.
es: Hmph, creo que no entiendes como manejar un restaurante. Si nadie está llorando, no lo estás intentando lo suficiente.

source: I want in on this too! Maybe we can do kind of a good cop/bad cop thing.
es: ¡También quiero participar! Tal vez podamos hacer policía bueno y policía malo.

source: No no, you need to start pulling your weight! We both need to be bad cops.
es: ¡No no, tienes que ser más duro! Los dos necesitamos ser los policías malos.

source: That's just called good business! If nobody's crying, you're not trying hard enough.
es: ¡Eso es lo que llamo un buen negocio! Si nadie está llorando, no lo estás intentando lo suficiente.

source: I don't think it was actually their fault...
es: No creo que haya sido su culpa...

source: Yes, but with their low self-esteem who do you think they're more likely to believe? Us or themselves?
es: Sí, pero con su baja autoestima ¿a quién crees que va a creer? ¿A nosotros o sí mismo?

source: Wait... Turbo Fat?
es: Espera... ¿Turbo Fat?

source: Yeah, Turbo Fat! That's what you wrote on the form, I triple checked because it sounded so... distinctive.
es: ¡Sí, Turbo Fat! Eso es lo que escribiste en la forma, lo revisé tres veces porque sonaba muy... distintivo.

source: I hope Bits 'n' Bites likes what I did with the sign. Do you know when they'll be here?
es: Espero que a Cocina Golosina le guste el letrero. ¿Sabes cuándo llegará?

source: No, their name is Turbo Fat! The RESTAURANT'S name is Bits 'n Bites!
es: ¡No, su nombre es Turbo Fat! ¡El nombre del RESTAURANTE es Cocina Golosina!

source: My NAME is Fat Sensei! ...And why is Turbo Fat in big ugly letters over my poorly decorated restaurant!?
es: ¡Mi NOMBRE es Fat Sensei! ...¿¡Y por qué está Turbo Fat en letras grandes y feas sobre mi apenas decorado restaurante!?

source: Oh no! 'Turbo Fat'? I really liked the food at 'Closed'.
es: ¡Oh no! ¿"Turbo Fat"? Me gustaba mucho la comida en "Cerrado".

source: No no, WE'RE Closed.
es: No no, nunca FUIMOS cerrado, pero ahora ESTAMOS cerrado.

source: Oh okay. Goodbye then! I guess I'll have to find a new favorite restaurant...
es: Oh bueno. ¡Entonces adiós! Supongo que tengo que encontrar un nuevo restaurante favorito...

source: Just come in and sit down, you idiot!!!
es: ¡¡¡Solo entra y toma asiento, idiota!!!

source: You still haven't filled out that restaurant form for Tunathy? Here, I'll do it.
es: ¿Todavía no llenaste la forma del restaurante para Tunathy? Dámelo, yo lo haré.

source: Hmmm... Maybe we should just name the restaurant after you! 'Turbo Fat.'
es: Hmmm... ¡Creo que el restaurante tendría que llevar tu nombre! "Turbo Fat".

source: First of all, my name is Fat Sensei. Secondly, Turbo Fat is... quite possibly the WORST imaginable name for a restaurant.
es: Primero, mi nombre es Fat Sensei. Segundo, Turbo Fat es... posiblemente el PEOR nombre imaginable para un restaurante.

source: Oh I don't think it's that bad! It evokes a certain sense of...
es: ¡Oh, no creo que sea tan malo! Inspira una sensación de...

source: Revulsion
es: Repulsión

source: Fear
es: Miedo

source: Indulgence
es: Indulgencia

source: Urgency
es: Urgencia

source: Convenience
es: Conveniencia

source: Shamelessness
es: Sinvergüenza

source: A sense of urgency!
es: ¡Una sensación de urgencia!

source: ...Yes. Urgency to become fat. Hard pass.
es: ...Sí. Urgencia para engordar. No gracias.

source: A sense of indulgence!
es: ¡Una sensación de indulgencia!

source: ...Yes. Rapid indulgence, which is the most idiotic thing I've ever heard of.
es: ...Sí. Indulgencia rápida, que es la cosa más idiota que escuché.

source: A sense of convenience!
es: ¡Una sensación de conveniencia!

source: ...Yes. The convenience of becoming fat. Hard pass.
es: ...Sí. La conveniencia de engordar. No gracias.

source: A sense of fear!
es: ¡Una sensación de miedo!

source: ...Fear!?
es: ...¿¡Miedo!?

source: Yeah, it's just... The danger is in your face, like warning labels on cigarettes!
es: Sí, es como... El peligro está en tu cara, ¡como las advertencias en los cigarrillos!

source: ...Watch out! Long term use of Turbo Fat has been linked to permanent and irreversible side effects!
es: ...¡Cuidado! ¡El consumo prolongado de Turbo Fat podría provocar efectos secundarios permanentes e irreversibles!

source: I'm getting the impression you haven't done this kind of thing before.
es: Estoy teniendo la impresión de que nunca haz hecho esto antes.

source: A sense of revulsion!
es: ¡Una sensación de repulsión!

source: ...Revulsion!?
es: ...¿¡Repulsión!?

source: Yeah, something like... Eww! Turbo Fat!? Gross, I'll eat ANYWHERE but there!
es: Sí, algo como... ¡Puaj! ¿¡Turbo Fat?! ¡Asqueroso, comería en CUALQUIER lado menos ahí!

source: A sense of shamelessness!
es: ¡Una sensación de sinvergüenza!

source: ...Shamelessness!?
es: ...¿¡Sinvergüenza!?

source: Yeah, something like... Okay our portions are huge, our food is unhealthy, but we're up front about it!
es: Sí, algo como... Bueno, nuestras porciones son grandes, nuestra comida insalubre, ¡pero te lo decimos de frente!

source: Fine. How about... Bits 'n' Bites?
es: Bien. Que te parece... ¿Cocina Golosina?

source: Hmm... Yes yes, fine. Whatever. It's marginally better than #bad_restaurant_name#.
es: Hmm... Sí sí, está bien. Lo que sea. Es marginalmente mejor que #bad_restaurant_name#.

source: (scribble, scribble...)
es: (escribe, escribe)

source: Oh! What are you writing down?
es: ¡Oh! ¿Qué estás escribiendo?

source: Hmm? Just making a sign for our restaurant.
es: ¿Hmm? Solo estoy haciendo un cartel para nuestro restaurante.

source: Oh you thought of a name?
es: Oh ¿pensaste en un nombre?

source: ...'Closed'? I can come up with a better name than that.
es: ...¿"Cerrado"? Yo podría haber pensado en un nombre mejor que ese.

source: I mean, oh! ...Oh, right. Sorry!
es: ¡Digo, oh! ...Oh, sí ¡Perdón!

source: Heyyy this is that new restaurant I've heard about...? Ooh, 'Closed'! Sounds... exclusive!
es: Heyyy ¿Este es el nuevo restaurante del que escuché hablar? ¡Ohh, "Cerrado! Suena... ¡Exclusivo!

source: What kind of food do you specialize in?
es: ¿En qué tipo de comida se especializan?

source: Come on in!
es: ¡Entre, por favor!

source: I made the same mistake
es: Hice el mismo error

source: Can you come back later?
es: ¿Puedes volver más tarde?

source: We're literally closed
es: Literal, está cerrado

source: Sorry, could you come back later? We're not open right now.
es: Perdón, pero ¿puedes volver más tarde? Ahora mismo no estamos abierto.

source: We're literally closed, as in our restaurant is not open.
es: Estamos literalmente cerrado, nuestro restaurante no está abierto.

source: Oh I made the same mistake, but we're ACTUALLY closed. ...Closed as in, not open.
es: Oh yo hice el mismo error, pero ESTAMOS cerrado. ...Cerrado como, no abierto.

source: Come on in! What do you feel like?
es: ¡Entre! ¿Qué es lo que te gustaría?

source: Umm, what #player# MEANT to say is that we're, ahhh... not open right now.
es: Umm, lo que #player# INTENTA decir es que nosotros, ahhh... no estamos abierto.

source: Hmm so like... 'not open' food? Like burritos? Sure, I could give that a try!
es: Hmm así que... ¿comida "no abierta"? ¿Como burritos? ¡Claro, me gustaría probar!

source: Wow, our first customer!
es: ¡Wow, nuestro primer cliente!

source: Please go away
es: Por favor, vete

source: We won't serve you
es: No te vamos a servir

source: I will hurt you
es: Si no te vas, te lastimaré

source: ...Please go away.
es: ...Por favor, retírese.

source: Ha! Ha! Oh it's one of those places that heckles the customers. Go ahead, I can take it! Where's the menu?
es: ¡Jaja! Oh, es uno de esos lugares que trata mal a sus clientes. ¡Adelante, puedo aguantar! ¿Dónde está el menú?

source: I will hurt you.
es: Si no te vas, te golpearé.

source: We're not going to serve you, so just leave.
es: No te vamos a servir nada, así que vete.

source: Ohhhh wow, this place IS really exclusive! ...Can I see a menu?
es: Ohhhh wow, ¡entonces este lugar ES muy exclusivo! ...¿Puedo ver el menú?

source: Wow, our first customer! Come on in, seat yourself.
es: ¡Wow, nuestro primer cliente! Entre, tome asiento.

source: Ahh, what #player# MEANT to say is...
es: Ahh, lo que #player# INTENTA decir es...

source: Please go away, you're dumb and you smell. And please tell your dumb smelly friends to stay away from our restaurant, too.
es: Por favor váyase, es tonto y apesta. Y por favor dígale a sus amigos apestosos que también se alejen de nuestro restaurante.

source: Okay... (sigh) We should probably just serve this idiot...
es: Está bien... (suspiro) Creo que tenemos que servirle algo a este idiota...

source: Wow! We got funding, signed a lease, set up our kitchen and stocked it with food. All in one afternoon!
es: ¡Wow! Conseguimos fondos, firmamos un contrato, instalamos la cocina y llenamos el almacén con comida. ¡Todo en una tarde!

source: ...Is there anything left to do?
es: ...¿Hay algo más que hacer?

source: Ahh not really! I'm just waiting for this lazy nerd to decorate our restaurant so it doesn't look like a cardboard box.
es: ¡No creo! Solo estoy esperando a este nerd perezoso para que decore nuestro restaurante para que no parezca una caja de cartón.

source: I'm not lazy! ...But you haven't told me the restaurant's name yet.
es: ¡No soy perezoso! ...Es que todavía no me dijeron el nombre del restaurante.

source: Kshh, so unprofessional. We talked about the name '#bad_restaurant_name#' don't you remember?
es: Pfff, que poco profesional. Hablamos sobre el nombre, "#bad_restaurant_name#" ¿No recuerdas?

source: I don't think they were there for that conversation, sensei.
es: No creo que haya sido parte de la conversación, sensei.

source: Whatever you come up with, just write it out for me on this form! I don't want to get the spelling wrong.
es: ¡Sea cual sea el nombre, solo escríbelo en esta forma para mi! No quiero equivocarme con la ortografía.

source: And where it says Restauranteur Name, be sure to write-
es: Donde dice Nombre del Restaurante, asegúrate de escribir-

source: -Yes yes, don't worry. I have years of experience making little funny shapes on pieces of paper. I'll handle it.
es: -Sí sí, no te preocupes. Tengo años de experiencia haciendo pequeñas figuras raras con trozos de papel. Me encargaré.

source: Th-thank you!
es: ¡Gr-gracias!

source: Also, umm, it's quite literally not my business but...
es: Y, umm, se que no es mi negocio pero...

source: ...Please don't call your restaurant #bad_restaurant_name#...
es: ...Por favor, no lo llamen #bad_restaurant_name#...

source: The name is great
es: El nombre está bien

source: The name was a joke
es: El nombre era un chiste

source: Will you go away!?
es: ¿¡Puedes irte!?

source: Stop slacking off, you lazy nerd!
es: ¡Deja de vagar, nerd perezoso!
