Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: Lemony Thickets
es: Bosque Limonesco

source: Locate the mysterious Fat Sensei and launch your first successful restaurant. ...And maybe make some woodland friends along the way!
es: Encuentra al misterioso Fat Sensei y lanza tu primer restaurante exitoso. ...¡Y tal vez has algunos amigos del bosque por el camino!

source: Welcome to Turbo Fat
es: Bienvenido a Turbo Fat

source: We're not done yet, there's a heckton of work which goes into setting up a restaurant! ...Oh wait, there isn't? Never mind then!
es: Aún no terminamos, ¡todavía hay muchísimo trabajo para preparar el restaurante! ...Oh, espera, ¿No lo hay? ¡Entonces no dije nada!

source: Poki Desert
es: Desierto Poki

source: Oh no, there's nobody here. ....Except for THOSE fifty billion people! Where did THEY all come from!?
es: Oh no, no hay nadie aquí. ...¡Excepto por ESTOS cincuenta millones de personas! ¿¡De dónde salieron!?

source: Cannoli Sandbar
es: Banco de Arena Cannoli

source: The wacky council members running this island might be able to help our restaurant! If they would only stop arguing...
es: Los miembros de este consejo dirigen esta isla, ¡Son medio chiflados pero pueden ayudar al restaurante! Si tan solo dejaran de pelear...

source: Merrymellow Marsh
es: Ciénaga de Malvaviscos

source: The quirky chefs at the Merrymellow Marsh location can't seem to do anything right. They really need our help!
es: Estos chefs peculiares de Ciénaga de Malvaviscos no pueden hacer nada bien. ¡Necesitan nuestra ayuda!

source: Chocolava Canyon
es: Volcán de Chocolava

source: Can we complete the ultimate challenge to obtain the coveted 'Chef Of The Year' plaque!? All our hopes are riding on this!
es: ¿¡Podremos completar el último reto para obtener la codiciada placa "Chef del año"!? ¡Todas nuestras esperanzas están en ti!

source: Starberry Mountain
es: Montaña Estrellamoras

source: A slew of insurmountable challenges sure to drive even the most seasoned chefs to the brink of insanity. The true Turbo Fat starts here!
es: Un montón de retos insuperables que de seguro volverán loco incluso al chef más condimentado. ¡El verdadero Turbo Fat comienza aquí!

source: Tutorials
es: Tutoriales

source: Tutorials designed to teach new concepts to players of all skill levels.
es: Tutoriales diseñados para enseñar nuevos conceptos a jugadores de todos los niveles de habilidad.

source: Training: Marathon
es: Entrenamiento: Maratón

source: A test of endurance where you survive as long as you can against increasing speeds.
es: Una prueba de resistencia donde sobrevives el mayor tiempo posible contra el aumento de velocidad.

source: Training: Ultra
es: Entrenamiento: Ultra

source: A test of speed where you race to a target amount of money. How fast can you finish?
es: Una prueba de velocidad donde llegas a un monto de dinero específico lo más rápido posible. ¿Qué tan rápido puedes terminar?

source: Training: Sprint
es: Entrenamiento: Carrera

source: A test of speed where you earn as much money as you can within a time limit. How much can you earn?
es: Una prueba de velocidad donde ganas todo el dinero posible en un tiempo límite. ¿Cuánto puedes ganar?

source: Training: Rank
es: Entrenamiento: Rangos

source: An escalating set of challenges. How high can you get?
es: Una serie de retos con aumentos de dificultad. ¿Qué tan alto puedes llegar?

source: Training: Sandbox
es: Entrenamiento: Libre

source: An endless mode with no way to win or lose.
es: Un modo infinito donde no hay forma de ganar o perder.

source: And so #player# and Fat Sensei proceeded to the Zagma gift shop, where #player# purchased their very own Zagma Chef Of The Year plaque for ¥3000.
es: Y así, #player# y Fat Sensei fueron a la tienda de regalos de Zagma, donde #player# compró su propia placa de Zagma Chef del Año por ¥3000.

source: Fat Sensei refused to help pay for the plaque. "¥3000 is a considerable investment, it's best you do it yourself."
es: Fat Sensei se negó a ayudar con el pago de la placa. "¥3000 es una inversión considerable, es mejor que lo hagas solo."

source: Hooray! Yay! You did it! Wow!!!
es: ¡Hurra! ¡Yay! ¡Lo hiciste! ¡¡¡Wow!!!

source: Chef of the year? Wow, that's amazing!
es: ¿Chef del año? ¡Wow, es genial!

source: Wow, they gave you a plaque and everything!?
es: ¿¡Wow, te dieron una placa y todo!?

source: I bought it in the gift shop...
es: La compré en la tienda de regalos...

source: Yaaaay! New plaque! New plaque!!
es: ¡Yaaaay! ¡Nueva placa! ¡¡Nueva placa!!

source: You seem confused. Are you... looking for something?
es: Pareces confuso. Estás... ¿Buscando algo?

source: I can't find any utensils, do we have a spatula somewhere?
es: No puedo encontrar mis utensilios, ¿no tenemos una espátula por algún lado?

source: You don't need a spatula. A real chef cooks with their bare pans.
es: No necesitas una espátula. Un chef de verdad cocina solo con sartenes.

source: Their bare... pans? What about spoons? Forks? Knives?
es: Solo con... ¿Sartenes? ¿Pero y las cucharas? ¿Tenedores? ¿Cuchillos?

source: Pans, pans and pans. Really, what is a knife but a specialized sharpened pan? You don't need any of that stuff.
es: Sartenes, sartenes y sartenes. Si lo piensas, ¿qué es un cuchillo sino una sartén afilada? No necesitas nada de eso.

source: Name one activity in a kitchen that you can't do better with a pan.
es: Nombra una actividad en la cocina que no puedas hacer mejor con una sartén.

source: Make pancakes
es: Hacer panqueques

source: Blow your nose
es: Sonarse la nariz

source: Scratch your butt
es: Rascarse el trasero

source: Mop the floor
es: Trapear el piso

source: Swat a fly
es: Aplastar una mosca

source: Well, you can't make pancakes with a pan.
es: Bueno, no puedes hacer panqueques con una sartén.

source: Ahh, you've got me there. ...But you can do almost anything else.
es: Ahh, bueno, me atrapaste. ...Pero puedes hacer casi cualquier cosa.

source: ...ANYTHING else.
es: ...CUALQUIER cosa.

source: Like... like what?
es: ¿Cómo... Cómo que?

source: Well, you can't blow your nose with a pan.
es: Bueno, no puedes sonarte la nariz con una sartén.

source: I mean, you can't scratch your butt with a pan.
es: Bueno, no puedes rascarse el trasero con una sartén.

source: Well, you can't mop the floor with a pan.
es: Bueno, no puedes trapear el piso con una sartén.

source: I mean, you can't swat a fly with a pan.
es: Bueno, no puedes aplastar una mosca con una sartén.

source: What!? You didn't! That's horrible.
es: ¿¡Qué!? ¡No lo hiciste! Eso es horrible.

source: At least tell me which pan it was!
es: ¡Al menos dime con cuál sartén fue!

source: Ahh, sorry. You're on your own...
es: Ahh, perdón. Estás solo en esto...

source: Ohhh well... That was more than I should have eaten today.
es: Ohhh bueno... Creo que comí demasiado.

source: It's taking all my energy just to sit up, I don't know HOW I'll manage the walk home...
es: Estoy usando toda mi energía solo para sentarme derecho, no se COMO voy a caminar a casa...

source: I'm not taking you home to your tree, so don't even ask.
es: No te voy a llevar a tu casa en el árbol, así que ni preguntes.

source: Oh no worries, I've engineered a complex system of satellites, receivers, remotes and contraptions to take me home.
es: Oh no te preocupes, he diseñado un sistema de satélites, recibidores remotos y artilugios para que me lleven a casa.

source: Why with just a few flicks on this touch screen, a motorized vehicle can pick me up in oh, let's see...
es: Con solo un par de toques en esta pantalla táctil, un vehículo motorizado va a venir a buscarme, veamos...

source: About eight to twelve minutes. Oh, my driver's name is Logan!
es: Viene de 8 a 12 minutos. ¡Oh, el conductor se llama Logan!

source: You didn't invent the internet.
es: No inventaste el Internet.

source: You didn't invent cell phones.
es: No inventaste los teléfonos celulares.

source: You didn't invent the digital taxi.
es: No inventaste el taxi digital.

source: You're nuts!
es: ¡Tus ideas vuelan alto!

source: Ha ha. Nice try, Dusty. You didn't invent the internet.
es: Ja ja. Bue intento, Dusty. No inventaste el Internet.

source: ...Didn't I?
es: ...¿Estás seguro?

source: Ha ha. Nice try, Dusty. You didn't invent cell phones.
es: Ja ja. Bue intento, Dusty. No inventaste los teléfonos celulares.

source: Ha ha. Nice try, Dusty. You didn't invent the digital taxi.
es: Ja ja. Bue intento, Dusty. No inventaste el taxi digital.

source: Dusty, you're totally nuts. Get it? Nuts! Ha ha ha~
es: Dusty, tus ideas vuelan alto. ¿Entiendes? ¡Ardilla, volar! Jajaja~

source: For your benefit, I'm going to pretend I didn't hear that remark.
es: Por tu beneficio, voy a pretender que no escuché lo que dijiste.

source: Dusty, is that you? From Lemony Thickets? ...You're an awfully long way from your tree!
es: ¿Dusty, eres tú? ¿De Bosque Limonesco? ...¡Estás tremendamente lejos de tu árbol!

source: Have we met? You look oddly familiar...
es: ¿Nos conocemos? Me pareces muy familiar...

source: You don't remember? ...I was one of the squirrels you fed when you were just getting started!
es: ¿No te acuerdas? ...¡Era una de las ardillas que le diste de comer cuando recién comenzaste!

source: Although now that you mention it, that does feel like eons ago...
es: Ahora que lo mencionas, se siente como si fue hace eones...

source: Oh, right! You're Dusty, aren't you? From Lemony Thickets. ...You're an awfully long way from your tree!
es: ¡Oh cierto! Eres Dusty, ¿no? De Bosque Limonesco. ...¡Estás tremendamente lejos de tu árbol!

source: Yes well, I found myself rather hungry, and you never come to visit your squirrel friends anymore!
es: Bueno, sí, es que me dio hambre, ¡y ya no visitas a tus amigas las ardillas!

source: Hey, I just visited you -
es: Hey, pero si te visité -

source: Five minutes ago
es: Hace cinco minutos

source: Yesterday
es: Ayer

source: A few weeks ago
es: Hace unas semanas

source: A few months ago
es: Hace unos meses

source: A few eons ago
es: Hace algunos eones

source: I visited you five minutes ago!
es: ¡Te visité hace cinco minutos!

source: I visited you yesterday!
es: ¡Te visité ayer!

source: Hmph well. I don't want to bore you with the details of squirrel biology, but we have to eat nearly every day.
es: Hmph está bien. No te quiero aburrir con detalles sobre la biología de las ardillas, pero tenemos que comer casi todos los días.

source: I visited you a few weeks ago!
es: ¡Te visité hace unas semanas!

source: Hmph well. I don't want to bore you with the details of squirrel biology, but we have to eat nearly every week.
es: Hmph está bien. No te quiero aburrir con detalles sobre la biología de las ardillas, pero tenemos que comer casi todas las semanas.

source: I visited you a month or two ago!
es: ¡Te visité hace uno o dos meses!

source: Hmph well. I don't want to bore you with the details of squirrel biology, but we have to eat nearly every month.
es: Hmph está bien. No te quiero aburrir con detalles sobre la biología de las ardillas, pero tenemos que comer casi todos los meses.

source: I visited you ehh... a few eons ago!
es: ¡Te visité hace ehh... algunos eones!

source: Hmph well. I don't want to bore you with the details of squirrel biology, but we have to eat nearly every eon.
es: Hmph está bien. No te quiero aburrir con detalles sobre la biología de las ardillas, pero tenemos que comer casi todos los eones.

source: Sounds cumbersome.
es: Suena complicado.

source: You don't know the half of it...
es: No te das una idea...

source: Oh yes, of course! Of course you did. So anyway for my meal, I'll have three chocolate puffs.
es: ¡Sí, por supuesto! Claro que lo hiciste. Como sea, quiero ordenar tres tortitas de chocolate.

source: Which, I presume, comes with a complimentary side of BALD-FACED LIES.
es: Lo cual, presumo, viene acompañado con una porción de MENTIRAS OBVIAS.

source: Bald-faced lies. Yes of course! I'll go put in your order... you handsome devil.
es: Mentiras obvias, ¡Por supuesto! Ya te lo hago... Ardilla Diablilla.

source: Oh Wendrea, it's you! From the Zagma Chef Of The Year committee.
es: ¡Oh Wendrea, eres tú! De los jueces de Zagma Chef Del Año.

source: Hmm well, I hope for my sake you're enjoying your food! Ha ha~
es: Hmm ¡Bueno, espero que, por mi bien, estés disfrutando tu comida! Jaja~

source: Hmph, it tastes like a microwave.
es: Hmph, sabe a microondas.

source: We don't use microwaves... I cooked that on a stove!
es: Nosotros no usamos microondas... ¡Lo cociné en una cocina!

source: Well then, you might take a closer look at your stove. Because I think your stove is a microwave.
es: Entonces, creo que necesitas mirar de cerca a tu cocina. Porque creo que tu cocina es un microondas.

source: Do... Did you want me to make you something else?
es: ¿Quieres... que te haga otra cosa?

source: Nah, don't trouble yourself. I'll just take the microcheck.
es: Nah, no te molestes. Solo dame la microcuenta.

source: Microcheck?
es: ¿Microcuenta?

source: Fat Sensei, I can't believe you're already on the Zagma Chef Of The Year committee!
es: ¡Fat Sensei, no puedo creer que eres uno de los jueces de Zagma Chef Del Año!

source: I mean... is that just something you volunteered for? Can anybody do it?
es: Me refiero... ¿Es algo en lo que eres voluntario? ¿Cualquiera puede hacerlo?

source: Oh no no, it requires decades of training, personal study, grueling trials...
es: Oh no no, requiere décadas de entrenamiento, estudio personal, pruebas agotadoras...

source: Culinary versatility, immaculate grooming habits, not to mention the prerequisite of being renowned in the world of gourmet!
es: Versatilidad culinaria, higiene perfecta, ¡y sin mencionar el prerrequisito de ser un renombrado miembro del mundo gourmet!

source: It's one of the most prestigious honors a chef can aspire to.
es: Es uno de los honores más prestigiosos que un chef puede aspirar.

source: Well... if it's so prestigious, why don't we put THAT on the plaque?
es: Bueno... Si es tan prestigioso, ¿por qué no ponemos ESO en la placa?

source: That's way easier
es: Así es más fácil

source: That's way more impressive
es: Así es más impresionante

source: Our plaque could say...
es: Nuestra placa podría decir...

source: Then I wouldn't have to go through all of this chef of the year stuff!
es: ¡Entonces no tendría que hacer todas estas cosas del chef del año!

source: That's way better than being one of a dozen restaurants with an identical plaque!
es: ¡Eso es más impresionante que ser uno de muchos restaurantes con la misma placa!

source: Our plaque could say, "Our chef is so good, they INVENTED chef of the year!"
es: Nuestra placa podría decir, "¡Nuestro chef es tan bueno, que INVENTÓ el chef del año!"

source: Ohh, I don't know. If we hang up a flattering plaque like that, people might assume we're talking about you!
es: Ohh, no se. ¡Si colgamos una placa tan privilegiada como esa, la gente podría pensar que estamos hablando de ti!

source: I wouldn't want it to go to your head.
es: No quiero que se suba a la cabeza.

source: Oh. I guess.
es: Oh. Supongo.

source: We could put up a plaque that applies to both of us! "Adequate Chef?"
es: ¡Podríamos poner una placa que aplique a ambos! ¿"Suficiente para ser Chef"?

source: "Unmotivated Chef?" "Too Lazy To Get Their Own Plaque Chef?"
es: ¿"Chef sin Motivación"? ¿"Muy vago para conseguir su propia placa de Chef"?

source: Okay! Okay!! I get it...
es: ¡Bueno! ¡¡Bueno!! Ya entendí...

source: Oh hey, it's Bart! Our chef from Cannoli Sandbar! What are you doing here?
es: ¡Oh hey, es Bart! ¡Nuestro chef de Cannoli Sandbar! ¿Qué haces aquí?

source: I'm your... chef?
es: ¿Yo soy tu... chef?

source: Are you two from the future, or did I jump timelines again?
es: ¿Ustedes dos son del futuro, o salté líneas temporales otra vez?

source: Ah-hahaha. I'll... talk to you about it later.
es: A-jajajaa. Creo que... te hablaré de eso luego.

source: Well. I came under the assumption that there was a second, more successful restaurant chain named "Turbo Fat"...
es: Bueno. Vine aquí con la asunción de que había una segunda y más exitosa cadena de restaurantes llamada "Turbo Fat"...

source: And that this alternate Turbo Fat restaurant had opened a location at this venue.
es: Y que este restaurante de Turbo Fat alterno abrió en un lugar más competitivo.

source: ...As farfetched as it sounds, it seemed more likely than you two reaching this level of success.
es: ...Por más exagerado que suene, parecía muy probable que ustedes dos alcancen este nivel de éxito.

source: It's nothing personal, it's just you two always struck me as more of the underdog type.
es: No lo tomen personal, pero pensé que ustedes dos eran algo como la última opción al elegir un restaurante.

source: Underdog? That's a compliment!
es: ¿Última opción? ¡Eso es un cumplido!

source: It's like the saying goes...
es: Como dice el dicho...

source: We're not underdogs!
es: ¡No somos la última opción!

source: H-hey! We're not underdogs. We're... plucky up-and-comers!
es: ¡Hey! No somos una última opción. Somos... ¡La opción segura cuando no hay más opciones!

source: Plucky up-and-comer!? Hmph. I didn't agree to this.
es: Hmph. No me gustó como sonó eso.

source: Okay then. ...We're one plucky up-and-comer, and one... frumpy dump-and-downer.
es: Bueno, está bien. ...Los últimos serán los primeros.

source: Yes, that's better. ... ...I think.
es: Sí, eso es mejor. ... ...Creo.

source: Well... since when is being an underdog a bad thing!? It's like they say uhh... every underdog has its under-day.
es: ¿¡Desde cuándo ser la última opciones algo malo!? Es como decir uhh... Que no hay que preparar postres con comida vencida.

source: They... don't say that.
es: Emm... Por favor, no digas eso.

source: It's an underdog eat underdog world out there!
es: ¡Los clientes nunca se quejaron de mis postres!

source: Please stop.
es: Por favor, ya no hables.

source: Well it's just like that saying goes... every underdog has its under-day.
es: Bueno, es como dice el dicho... Hasta la comida vencida tiene sus usos.

source: Anyway I see your success didn't come without a cost. ...Why is there cheese in this brownie?
es: Como sea, veo que su éxito no vino con ningún costo. ...¿Por qué hay queso en este brownie?

source: Oh it's like they say mmm...
es: Oh, es como dice el dicho mmm...

source: "When in Roquefort, do as the Roque-mans do."
es: "El Roquefort, mientras más viejo y echado a perder, mejor."

source: I... ...see.
es: Ya... ...veo.

source: (Psst... I'm not going to have to add cheese to my menu too, am I?)
es: (Psst... No voy a tener que agregar queso a mi menú, ¿no?)

source: (No, that's okay...)
es: (No, está bien...)

source: Oh hello Wendrea! You're back.
es: ¡Oh hola Wendrea! Volviste.

source: Yes yes, I thought I'd help myself to more of your... microwave cuisine.
es: Si si, pensé en comer algo más de tu... cocina de microondas.

source: I'll put YOU in a microwave...
es: Te voy a poner A TI en un microondas...

source: Okay, no microwaves this time
es: Okay, sin microondas esta vez

source: We don't use a microwave
es: No usamos un microondas

source: I don't know what you're tasting but we definitely don't use a microwave.
es: No se qué es lo que probaste antes, pero nosotros definitivamente no usamos un microondas.

source: Tsk I ain't talking about your kitchen, I'm talking about YOU, microwave!!!
es: Tsk, no estoy hablando de tu cocina, estoy hablando de TI, ¡¡¡Microondas!!!

source: Mmmm okay, I'll make doubly sure no microwaves touch your food.
es: Mmmm bueno, voy a doble asegurarme de que ningún microondas toque su comida.

source: Tsk 'course there's gonna be a microwave touchin' my food if you're making it, microwave!
es: ¡Tsk, por supuesto un microondas va a tocar mi comida, si es que tu la haces, microondas!

source: I've like to throw YOU inside a microwave...
es: Me encantaría tirarte A TI dentro de un microondas...

source: Ohhhhh heh heh heh. Whyyy I bet you say that to all the microwaves.
es: Ohhhhh heh heh heh. Bueno, apuesto que le dices eso a todos los microondas.

source: Y'know you remind me of myself, back when I was a young microwave.
es: Sabes algo, me recuerdas a mi mismo, cuando era un pequeño microondas.

source: Maybe if you wave less and micro more, you might learn a micro something outside of your microwave world.
es: Tal vez con más ondas y menos micro, creo que podrías aprender algunas micro cosas de este microondas mundo.

source: I'll... just get your food!
es: ¡Creo que... solo voy a traerte la comida!

source: Wowww look at that! It's JUST like the restaurant in Lemony Thickets!
es: ¡Wowww mira esto! ¡Es IGUAL al restaurante en Bosque Limonesco!

source: Oh hi Tunathy! Yeah, everything's still following all of your designs!
es: ¡Oh hola Tunathy! ¡Sí, seguimos usando tus diseños!

source: All the tables, the chairs, the decorations...
es: Todas las mesas, las sillas, las decoraciones...

source: Wow, and you have how many locations now?
es: Wow, ¿y cuántas sucursales tienen ahora?

source: Maybe I should have charged more money... The sign even looks the same! "Turbo Fat".
es: Creo que debí de cobrar un poco más... ¡Hasta el cartel sigue igual! "Turbo Fat".

source: Hmph yes, and it's thanks to you that we're stuck with that dumb name!
es: ¡Hmph sí, y es gracias a ti que seguimos con este nombre tonto!

source: Maybe we should charge YOU more money!
es: ¡Creo que TU nos tienes que devolver el dinero!

source: Please, I already gave you your money back!
es: ¡Por favor, ya les devolví el dinero!

source: Hmph well that isn't enough! Give me... Give me #player.possessive# money too!!
es: ¡Hmph no es suficiente! Dame... ¡¡Dame también el dinero de #player#!!

source: #player#, can you, umm... If you have some money I could maybe...
es: #player#, podrías, umm... Si tienes algo de dinero extra podría...

source: Oh wow, Dreadhark and Goris! You're a long way from Poki Desert.
es: ¡Oh wow, Dreadhark y Goris! Están muy lejos de Desierto Poki.

source: ...What are you doing here? Aren't you missing Desert Q?
es: ...¿Qué están haciendo aquí? ¿No se están perdiendo de la Ola del Desierto?

source: Aww man, you can't MISS Desert Q. Desert Q is everywhere!
es: No, no puedes PERDER la Ola del Desierto. ¡La Ola del Desierto está en todos lados!

source: Umm, it's in a desert
es: Umm, es en un desierto

source: Umm, that's a logistical nightmare
es: Umm, es una pesadilla logística

source: Umm, desert is in the name
es: Umm, desierto está en el nombre

source: Everywhere? I'm pretty sure it's in... a desert?
es: ¿En todos lados? Estoy muy seguro que tiene que ser en... ¿un desierto?

source: Tsk Desert Q isn't about the desert... it's about the whole like... desert vibe!
es: Tsk, Ola del Desierto no es sobre el desierto... es sobre... ¡La vibra del desierto!

source: Yeah! And I mean volcanoes are like... the desert's distant cousin, am I right?
es: ¡Exacto! Y supongo que los volcanes son como... el primo lejano del desierto, ¿no?

source: I mean we're both sweaty, uncomfortable and in desperate need of a shower...
es: Digo, ambos estamos sudados, incómodos y con una desesperada necesidad de una ducha...

source: ...Sounds like a desert to me! Desert KYUUUU!
es: ...¡Para mi, me suena a un desierto! ¡Ola del Desierto!

source: Desert KYUUUUUU!
es: ¡Ola del Desierto!

source: Everywhere? Then maybe you should take the 'Desert' part out of the name...
es: ¿En todos lados? Entonces deberían de sacar la parte del "Desierto" del nombre...

source: Change the NAME!?
es: ¿¡Cambiar el NOMBRE!?

source: No way, it's so fun to yell! Desert KYUUUUUU!!
es: ¡No gracias, es divertido gritarlo! ¡¡Ola del Desierto!!

source: Desert KYUUUU!!!
es: ¡¡¡Ola del Desierto!!!
