Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: #bad_restaurant_name# is a great name! It matches our restaurant perfectly.
es: ¡#bad_restaurant_name# es un buen nombre! Representa nuestro restaurante perfectamente.

source: Really? You're making... THAT kind of restaurant?
es: ¿En serio? ¿Van a hacer... ESE tipo de restaurante?

source: Have you thought about making a good restaurant instead?
es: ¿Han pensado en ponerle un buen nombre al restaurante?

source: Ack!
es: ¡Ay!

source: #bad_restaurant_name# was just a joke! ...We'll come up with a better name.
es: ¡#bad_restaurant_name# era solo un chiste! ...Vamos a pensar en un nombre mejor.

source: Oh! ...Okay, phew. I'll just be patient, then.
es: ¡Oh! ...Bien, uff. Entonces, seré paciente.

source: So will you come up with a name soon? Or-
es: ¿Entonces tienes un nombre mejor? O-

source: Well that was... good!
es: Eso estuvo... ¡Bien!

source: Just good?
es: ¿Solo bien?

source: I mean the combos aren't working! It's... I don't think it's your fault, don't take it personally.
es: ¡Es que los combos son muy cortos! Solo... No creo que sea tu culpa, no lo tomes personal.

source: You're... You're doing good. ...You're a good boy.
es: Estás... Estás haciendo un esfuerzo. ... Eres un buen chico.

source: C'mon, let's like... let's get drinks or something, blow off some steam! You did... good today.
es: Vamos, podemos... Vamos a tomar algo o hacer otra cosa, desahogarnos un poco. Por tu... buen trabajo.

source: Ohhh. Actually, I really gotta work out tonight. I already missed two nights this week. I can't miss a third night.
es: Ohhh. De hecho, necesito hacer ejercicio esta noche. Ya perdí dos noches esta semana. No puedo perder una tercer noche.

source: Yeah, you're looking a little chunky
es: Sí, te vez un poco gordito

source: That's some good discipline!
es: ¡Esa es una buena disciplina!

source: Well, can we hang out tomorrow?
es: Bueno, ¿podemos pasar el rato mañana?

source: Heh yeah, I thought you were looking a little chunky around the middle.
es: Jaja, sí, creo que estás un poco gordito.

source: W-what!?!
es: ¡¿¡Q-Qué!?!

source: Ha ha, go exercise.
es: Jaja, ve y haz ejercicio.

source: Y-yeah, bye!
es: S-sí, ¡adiós!

source: Oh good for you, that's some good discipline! ...See you around.
es: Oh bien por ti, ¡esa es una buena disciplina! ...Nos vemos.

source: Bye!
es: ¡Adiós!

source: How about tomorrow then? ...Can we hang out tomorrow?
es: ¿Y mañana? ...¿Podemos hacer algo mañana?

source: Uhhh, I gotta go. See you around!
es: Uhhh, me tengo que ir. ¡Nos vemos!

source: Oh! Goodbye!
es: ¡Oh! ¡Nos vemos!

source: Oh hey what's up. I heard you guys came the other day when I wasn't here. So did I miss like anything... important?
es: Oh, hola, ¿cómo están? Escuché que ustedes vinieron el otro día cuando no estuve aquí. Entonces, ¿me perdí de algo... importante?

source: Ahh, nothing important. We're still trying to figure out why this location isn't attracting more customers.
es: Ahh, nada importante. Seguimos intentando averiguar por qué esta sucursal no está atrayendo más clientes.

source: Yeah, Skins and Bones showed us their cooking skills. ...They seem nice!
es: Sí, Skins y Bones nos mostraron sus dotes en la cocina. ...¡Parecen buenos!

source: Hah. Yeah they DO seem nice.
es: Ja. Sí, parecen MUY buenos.

source: Yeah! ...Umm, wait what? ...I feel like there's something you're not telling me.
es: ¡Sí! ...Umm, espera, ¿qué? ...Creo que no me estás contando algo.

source: Hah hah. Yeah that's alright, you'll figure it out.
es: Jaja. Sí, tienes razón, y ya te vas a dar cuenta.

source: Umm... Alright. Sounds fun. Anywaaay...
es: Umm... Bueno, como sea. De todas formaaas...

source: Why don't you show us your skills in the kitchen! Let's focus on some combos today, if you know about those.
es: ¡Por qué no nos muestras tus habilidades en la cocina! Hoy vamos a concentrarnos en hacer combos, si es que sabes lo que son.

source: Yeah yeah! Combos. Sure thing.
es: ¡Sí sí! Combos. Seguro.

source: Hmm... so, do you remember that thing I said not to do?
es: Hmm... entonces, ¿recuerdas la cosa que dije que no tienes que hacer?

source: That thing that you're still doing?
es: ¿Esa cosa que sigues haciendo?

source: You're still doing that thing.
es: Sigues haciendo esa cosa.

source: I know, I know! I'm trying, I really am! ...I'll practice more, I promise.
es: ¡Ya se, ya se! ¡Lo estoy intentando, de verdad! ...Practicaré más, lo prometo.

source: It's okay, we're not angry. We're just, umm...
es: Está bien, no estamos enojados. Solo estamos, umm...

source: ...Just, just keep practicing. You'll get there.
es: ...Solo, solo sigue practicando. Lo puedes hacer.

source: Thanks, mowwr...
es: Gracias, mowwr...

source: Hmm, another restaurant this close!? I wonder if this is a part of the problem.
es: Hmm, ¿¡Otro restaurante tan cerca!? Me pregunto si es parte del problema.

source: What, this place? All they serve is that weird macrobiotic vegan stuff. You don't gotta worry about them.
es: ¿Que, este lugar? Todo lo que sirven es comida vegana macrobiótica rara. No deben por que preocuparse.

source: We... don't?
es: ¿No... debemos?

source: I mean, I'm just thinking long term here.
es: Solo estoy pensando a largo plazo.

source: Bottom line is when people gotta pick between healthy food and garbage food, the garbage food always wins.
es: Al final, cuando la gente tiene que elegir entre comida saludable y comida basura, la comida basura siempre gana.

source: Y'know I mean. ...No offense.
es: Ya sabes lo que digo. ...Sin ofender.

source: Hello, can I um... Oh! ...Wait I've seen you around. You just opened that new "Turbo Fat" gym a few doors down, right?
es: Hola, puedo tomar um... ¡Oh! ...Espera, ya los he visto. Ustedes acaban de abrir el nuevo gimnasio "Turbo Fat" aquí cerca, ¿no?

source: Yeah it's, actually it's a restaurant!
es: ¡Sí, pero en realidad es un restaurante!

source: Turbo Fat... restaurant? ... ... ...Did you name it that on purpose?
es: ¿Restaurante... Turbo Fat? ... ...¿Le pusieron ese nombre a propósito?

source: Well it's a better name than "Butt Up Cafe".
es: Bueno, es mejor que "Butt Up Café".

source: Augh I KNOW! It's obviously "Buttercup Cafe" but... this crystal weed is out of control.
es: Augh ¡YA SÉ! Es obviamente "Buttercup Café" pero... Esta hierba de cristal está fuera de control.

source: It springs up everywhere, we're calling a landscaping company to come clear it up.
es: Crece por todos lados, ya llamamos a una compañía de jardinería para que vengan a limpiar.

source: Ahh, haha. Well. Best of luck.
es: Ahh, jaja. Bueno. Buena suerte.

source: Yeah! So um, anyways nice meeting you, and just let us know if you ever need any, um...
es: ¡Sí! Entonces um, bueno, un placer conocerlos, y si alguna vez quieren algo, um...

source: Sorry! This is awkward but, I realized mid-sentence that I didn't want to... help you.
es: ¡Perdón! Suena feo, pero a mitad de la oración me di cuenta que no quiero... ayudarlos.

source: Like, that makes sense, right? I'm not being selfish?
es: ¿Tiene sentido, no? ¿No estoy siendo egoísta?

source: Wow! Rude
es: ¡Wow! Que grosero

source: That makes sense
es: Tiene sentido

source: We won't help you either
es: Tampoco te ayudaremos

source: Sorry. Bye!
es: Perdón. ¡Adiós!

source: Yeah, that makes sense.
es: Sí, tiene sentido.

source: So that's how it is? ...Fine, we don't want to help you either.
es: ¿Así va a ser? ...Bueno, nosotros tampoco te ayudaremos.

source: Wow! ...That's a little rude...
es: ¡Wow! ...Eso es un poco grosero...

source: So one thing I noticed, Skins, is when you switch from one dish to the next-
es: Una cosa que noté, Skins, es que cuando cambias de un plato a otro-

source: ...My name is Bones...
es: ...Mi nombre es Bones...

source: Oh! Sorry, I'm really awful with names.
es: ¡Oh! Perdón, recordar nombres no es mi fuerte.

source: Hey names are tough! You just need a mnemonic to help you keep things straight.
es: ¡Los nombres son difíciles! Solo necesitas una mnemotecnia para ayudarte a recodarlos.

source: Like take Skins here, they're sorta like a cat, right? So just remember, "there's more than one way to skin a cat!"
es: Como Skins aquí, que se parece a un gato, ¿no? Solo recuerda, "Los gatos con skis no pueden caer de un quinto piso!"

source: Augh! That's rather graphic!
es: ¡Augh! ¡Eso es muy cruel!

source: And Bones here, they're sorta like a dog? You can remember that like-
es: Y Bones aquí, se parece a un perro, ¿no? Puedes recordarlo como-

source: I get it! 'There's more than one way to bone a dog!'
es: ¡Entiendo! "Bones y los perros tienen colas muy lindas"

source: W-what? ...That's not... ...Well, whatever helps you remember.
es: ¿Q-qué? ...Eso no es... ...Bueno, lo que te ayude a recordar.

source: Anyway I know it's been sort of a shaky start, but Fat Sensei and I will teach you everything we can! ...We're pulling for you!
es: Bueno, ya se que fue una semana algo movida, ¡pero Fat Sensei y yo vamos a enseñarles todo lo que podamos! ...¡Estamos apoyándolos!

source: You're... Pulling for me?
es: ¿Están... Apoyándonos?

source: Well! I guess this is our last day here.
es: ¡Bueno! Creo que es nuestro último día aquí.

source: Yeah! Thanks for all your help. We're putting out better food now, and business is starting to pick up a little.
es: ¡Sí! Gracias por la ayuda. Ahora estamos cocinando mucho mejor, y el negocio se está levantando de a poco.

source: Check it out! Three customers!
es: ¡Mira eso! ¡Tres clientes!

source: Yeah! Ha ha.
es: ¡Sí! Jaja.

source: I wish we could figure out why the customers are leaving so fast. There's definitely something.
es: Me encantaría descubrir porqué los clientes se van tan rápido. Debe de haber algo.

source: I checked your recipes and you're using all the same ingredients, but something's just... different here.
es: Revisé sus recetas y están usando los mismos ingredientes, pero algo aquí es... diferente.

source: Something IS different here! But not in a bad way. Even without the customers I just feel... ...nice, you know?
es: ¡Algo aquí ES diferente! No en una forma negativa. Incluso sin clientes me siento... ...Bien, ¿sabes?

source: Maybe it's just being around you guys! I don't really want to leave.
es: ¡Tal vez sea por tenerlos cerca! Realmente no me quiero ir.

source: Well! There's nothing saying we can't help out for another week.
es: ¡Bueno! No veo porqué no nos podemos quedar otra semana ayudando.

source: Let's step up our game and win over a few more customers. What do you say, Bones?
es: Vamos a mejorar nuestra estrategia y ganar algunos clientes extras. ¿Qué dices, Bones?

source: Bork! Leave it to me!
es: ¡Bork! ¡Déjamelo a mi!

source: Hey, remember a few days ago when you said there's more than one way to bone a dog! Ha ha!
es: ¡Hey, recuerdas que hace unos días dijiste algo de mi linda cola! ¡Jaja!

source: Ha ha! Yeah. Wait, what's so funny about that?
es: ¡Jaja! Sí. Espera, ¿qué tiene de divertido?

source: Why does everyone keep asking me that!?
es: ¿¡Por qué todos me siguen preguntando eso!?

source: I was thinking maybe if you come over to my place, you can tell me more jokes and then we can get married.
es: Estaba pensando si tal vez vienes a mi casa, puedes decirme más cosas como esas, y tal vez podamos casarnos.

source: Yes, I'd love to
es: Sí, me encantaría

source: No that's okay
es: No creo

source: Umm... I guess
es: Umm... Supongo

source: Yes, yes! Oh, I'd love to marry you, Bones!
es: ¡Sí, sí! ¡Oh, me encantaría casarme contigo, Bones!

source: Umm... I guess that's alright.
es: Umm... Supongo que está bien.

source: N-no, that's okay. I'm not really in the mood for jokes right now.
es: N-no creo. No estoy muy de humor para chistes ahora mismo.

source: Okay! Well, let's just get married then.
es: ¡Bueno! Entonces vamos a casarnos.

source: Umm... I can't
es: Umm... No puedo

source: I don't see why not
es: Sí, por qué no

source: No problem at all
es: No hay ningún problema

source: Well, I don't see why not.
es: Sí, no veo por qué no.

source: No problem, sounds good.
es: No hay problema, suena bien.

source: Umm, I think I have other plans.
es: Umm, creo que tengo otros planes.

source: Let's just marry before your plans! Just a quick marry.
es: ¡Vamos a casarnos antes de tus planes! Una boda rápida.

source: No reason not to
es: No hay razones para no hacerlo

source: Umm... Okay
es: Umm... Bueno

source: I don't want to
es: No quiero

source: Well, I don't see any reason not to.
es: Bueno, no veo ninguna razón para no hacerlo.

source: Umm... Okay, whatever.
es: Umm... Bueno, lo que sea.

source: ...I don't want to marry you. Let's be friends.
es: ...No quiero casarme contigo. Seamos amigos.

source: Marry~
es: Amigovios~

source: ...Friends.
es: ...Amigos.

source: Maaarrrryyyy~~
es: Booooodaaaaaa~~

source: (sigh)
es: (suspiro)

source: (You are now in a relationship with Bones.)
es: (Ahora tienes una relación con Bones.)

source: Oh boy! Oh boy oh boy oh boy. That is... You're just...
es: ¡Oh Dios! Oh Dios oh Dios oh Dios. Es que... Tú eres...

source: My mother always warned me not to settle for the first person I fell in love with. And here you are!
es: Mi madre siempre me advirtió que no me case con la primera persona que me enamorara. ¡Y ahora aquí estás!

source: And now I get to call them, and tell them that I have a boyfriend or girlfriend.
es: Ahora voy a llamar a mis padres, y voy a decirles que tengo un novio o una novia.

source: ...Actually, I probably should have asked you about that. But, I didn't want to be rude.
es: ...Ahora que lo pienso, debí de haber preguntado sobre eso. Pero, no quería sonar grosero.

source: I'm a boy
es: Yo soy un chico

source: I'm a girl
es: Yo soy una chica

source: I love you
es: Yo te amo

source: I didn't mean to click that
es: Yo no quería esto

source: I-
es: Yo-

source: No, no, don't tell me yet! I can just find out on our honeymoon.
es: ¡No, no, no me lo digas! Lo voy a descubrir en nuestra luna de miel.

source: I love surprises~
es: Amo las sorpresas~

source: So are they driving you crazy yet?
es: ¿Entonces ya te están volviendo loco?

source: Bones is clingy
es: Bones es pegajoso

source: Skins is a bit much
es: Skins es un poco mucho

source: Who do you mean?
es: ¿A quién te refieres?

source: Skins is... a bit much. They can't seem to take a hint.
es: Skins es... un poco mucho. Parece que no entiende las indirectas.

source: Yeah, that sounds about right. I think I was here for what... two weeks at most when it started.
es: Sí, eso suena correcto. Yo estuve aquí por... dos semanas máximo cuando comenzó.

source: Bones became pretty clingy all of a sudden. They can't seem to take a hint.
es: Bones se puso muy pegajoso de repente. Parece que no entiende las indirectas.

source: Is who driving me crazy? I've met a bunch of new people here.
es: ¿Quién me vuelve loco? Conocí a mucha gente nueva aquí.

source: Oh. Really? No one comes to mind, huh? Well that's nice.
es: ¿Oh, en serio? ¿Nadie te viene a la cabeza, huh? Eso es bueno.

source: It sounds like they're taking it easy on you so far. For me, it started like two weeks in.
es: Parece que hasta ahora te la están poniendo fácil. En mi caso, comenzó a las dos semanas.

source: I dunno if it's flirting, it's just -- the more you treat them like a human being, the less they treat you like one.
es: No se si es coqueteo, pero -- mientras más los tratas como seres humanos, menos te tratan como uno.

source: Every conversation feels like a contest. They squeeze in these awkward compliments whenever they talk to you.
es: Cada conversación se siente como una competencia. Cada vez que te hablan intentan meter todo tipo de cumplidos raros.

source: And they stop farting around you.... And they're always watching you to see what you laugh at, so they can laugh too.
es: Dejan de tirarse pedos enfrente tuyo... Y siempre te miran por si te estás riendo, así ellos también se pueden reír.

source: It's just... (sigh) Whatever. It could be worse.
es: Es que... (suspiro) Como sea. Podría ser peor.

source: I'll fart around you
es: Yo me tiraré pedos frente a tí

source: That's horrible
es: Eso es horrible

source: You're so smart
es: Eres muy inteligente

source: I've been there
es: Pasé por eso

source: I'll fart around you!
es: ¡Me tiraré pedos enfrente tuyo!

source: Ha ha. Thanks. I think.
es: Jaja. Gracias. Creo.

source: Ugh, that sounds horrible.
es: Uff, eso suena horrible.

source: Ahh it's not so bad, just gotta keep those shields up. I'm sure you know the drill.
es: Ahh no está tan mal, solo tienes que estar a la defensiva. Estoy seguro que ya vas a entender.

source: Wow, what an insightful monologue. You're so smart! And so beautiful.
es: Wow, que magnífico monólogo. ¡Eres muy inteligente! Y muy hermoso.

source: Yeah... I've been there before.
es: Sí... Se lo que se siente.

source: Well anyway, it's not so bad. Just gotta keep those shields up. I'm sure you know the drill.
es: Como sea, no está tan malo, solo tienes que estar a la defensiva. Estoy seguro que ya vas a entender.

source: ...Come let me know if you need me to kick 'em in the potato or something.
es: ...Solo déjame saber si necesitan un par de patadas o algo.

source: Remember when you said, like, there's more than one way to bone a dog? Ha ha! That was really funny~
es: ¿Recuerdas que dijiste algo como que te gustan las colas lindas? ¡Jaja! Eso fue muy divertido~

source: Umm! I don't know. I don't remember now! ...So what are you doing later? Did you want to see a movie together?
es: ¡Umm! No se. ¡Ya no lo recuerdo! ...Así que, ¿qué vas a hacer más tarde? ¿Quieres ver una película juntos?

source: It's a date!
es: ¡Es una cita!

source: No, I've seen it
es: No, ya la vi

source: No, I'm busy
es: No, estoy ocupado

source: No, that's okay. I think I've already seen that movie...
es: No, no creo. Creo que ya vi esa película...

source: You did? Well um... maybe we could watch some dinner instead?
es: ¿En serio? Bueno um... ¿Tal vez podamos ver una cena juntos?

source: No, I'm not hungry
es: No, no tengo hambre

source: Oh, That's okay. I think I already have plans tonight...
es: Oh, no creo. Creo que ya tengo planes para hoy...

source: You did? Well um... maybe we could get dinner later this week?
es: ¿En serio? Bueno um... ¿Tal vez podamos comer algo esta semana?

source: I'll be busy
es: Estaré ocupado

source: I won't be hungry
es: No tendré hambre

source: Actually, I think I've already seen that dinner, too...
es: En realidad, creo que también ya vi esa cena...

source: Oh I'm not hungry, I just ate lunch...
es: Oh no tengo hambre, acabo de almorzar...

source: Actually, I think I already have plans later this week, too...
es: En realidad, creo que también tengo planes para esta semana...

source: I don't think I'll want dinner later this week! I'll have already eaten such a big lunch...
es: ¡No voy a tener hambre esta semana! Acabo de comer un almuerzo muy muy grande...

source: Sure, it's a date!
es: ¡Claro, es una cita!

source: Okay! ...I love you!
es: ¡Bueno! ...¡Te amo!

source: (You are now in a relationship with Skins.)
es: (Ahora tienes una relación con Skins.)

source: Oh hello. Did you need something?
es: Oh hola. ¿Necesitaban algo?

source: Butt's up with you
es: Hola, "butt's up"?

source: You fixed your sign?
es: ¿Arreglaste el letrero?

source: Are you out of business yet
es: ¿Ya estás en quiebra?

source: Hello! Butt's up with you?
es: ¡Hola! ¿"Butt's up"?

source: Butt's... Butt's up? What?
es: Butt's... ¿Butt's up? ¿Qué?

source: Oh! You fixed your 'butt up cafe' sign. Now my joke doesn't work. Anyway, how's business?
es: ¡Oh! Arreglaste tu letrero de "butt up café". Ahora el chiste ya no sirve. Como sea, ¿cómo está el negocio?

source: Right, we fixed that like a WEEK ago! ...But yeah, things have been weird!
es: ¡Sí, lo arreglamos como hace una SEMANA! ...Pero bueno, ¡las cosas se pusieron raras!

source: A bunch of our customers just... like... stopped showing up all of a sudden?
es: Un montón de clientes solo... ¿de repente dejaron de aparecer?

source: Oh, you fixed your sign!
es: ¡Oh, arreglaste tu letrero!

source: So are you out of business yet?
es: ¿Todavía no estás en quiebra?

source: Ugh well. We fixed our sign last week, so at least the 'butt cafe' jokes have stopped.
es: Ugh bueno. Arreglamos nuestro letrero la semana pasada, así que los chiste de "Butt café" pararon.

source: But a bunch of our customers just... like... stopped showing up all of a sudden?
es: Pero un montón de clientes solo... ¿de repente dejaron de aparecer?

source: No idea why! And it's not like we have any of their contact info. So... yeah.
es: ¡Ni idea por qué! No tenemos forma de contactar a los clientes. Así que... bueno.

source: Ah. That's just the worst. I wonder where they could have gone?
es: Ah. Eso es muy raro. ¿Me pregunto a dónde habrán ido?

source: ...Yeah. Well. ...How about you, any new customers?
es: ...Sí. Bueno. ...¿Cómo están sus nuevos clientes?

source: No, no, don't worry. We're not stealing your customers.
es: No, no, no te preocupes. No te estamos robando tus clientes.

source: Ha ha ha, Stealing our customers! ...No, ha ha!
es: ¡Jajaja, robando mis clientes! ...¡No, jaja!

source: No, um. I wasn't worried about that. I was just being polite.
es: No, um. No me preocupaba por eso. Solo estaba siendo amable.

source: Oh! ...Well thank you.
es: ¡Oh! ...Bueno, gracias.

source: Sorry. That probably shouldn't be as funny as it is. Ha ha ha.
es: Perdón. Creo que no debería de ser tan gracioso. Jajaja.

source: ...Your sign looks nice.
es: ...Tu letrero se ve lindo.

source: Well... I'm sorry we still couldn't figure out what's wrong with the food here.
es: Bueno... Lo siento, pero todavía no se que le pasa a la comida aquí.

source: Hey, it ain't your fault! Maybe things are just different here for some reason.
es: ¡Oigan, no es su culpa! Tal vez aquí las cosas solo sean diferentes por alguna razón.

source: Something IS different here! But not in a bad way. I don't really want to leave.
es: ¡Algo ES diferente aquí! No en una forma negativa. No me quiero ir.

source: Well! There's nothing saying we can't stay another month.
es: ¡Bueno! No veo porqué no nos podemos quedar otro mes ayudando.

source: Yeah. Stay forever!
es: Sí. ¡Para siempre!

source: You can just move here!
es: ¡Pueden mudarse aquí!

source: Yeah! Another month sounds great.
es: ¡Sí! Otro mes suena bien.

source: Wait... No. No, I'm sorry. Can we talk in private for a moment?
es: Esperen... No. No, perdón. ¿Podemos hablar en privado un momento?

source: Ehh yeah! Yeah sure. C'mon guys, let's take five.
es: ¡Claro! Por supuesto. Vamos, tomemos cinco minutos.

source: ...#player#, we can't do this to ourselves. They can do this to themselves, but we can't.
es: ...#player#, no podemos hacernos esto. Ellos podrán hacérselos a sí mismos, pero no nosotros.

source: Don't you see? We have an entire franchise to run.
es: ¿No lo ves? Tenemos una franquicia entera que manejar.

source: It was fun running just one restaurant. A small problem with small solutions.
es: Fue divertido estar en un solo restaurante. Con problemas chicos, soluciones chicas.

source: And those problems are comfortable because we've solved them before. But that's not the life we chose.
es: Y esos problemas son cómodos porque ya los resolvimos antes. Pero esa no es la vida que elegimos.

source: Once our business grew beyond two or three restaurants... Well, sometimes we have to trust other people to solve the fun problems.
es: Pero nuestro negocio está creciendo y... Bueno, a veces necesitamos confiar en otra gente para resolver esos cómodos problemas.

source: We have to stop visiting Merrymellow Marsh.
es: Tenemos que dejar de visitar Ciénaga de Malvaviscos.

source: ...But, but!
es: ...¡Pero, pero!
