Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: Everywhere? That must be a logistical nightmare.
es: ¿En todos lados? Eso debe ser una pesadilla logística.

source: Pshh Desert Q isn't about logistics... it's about a union of like umm... man I forget!
es: Pshh, Ola del Desierto no es sobre logística... Es sobre la unión de umm... ¡Me olvidé!

source: I'm just saying, with billions of attendees, keeping track of-
es: Solo estoy diciendo, con billones de personas, tratando de seguir todos sus-

source: But anyway... you'll still have to go back to the end of the line at some point, right?
es: Como sea... Van a volver al final de la fila en algún momento, ¿cierto?

source: We're still IN line. Open your mind, the world is just... one big line! ...I mean queue!!
es: Todavía estamos EN la fila. Abre tu mente, el mundo es solo una... ¡Una gran fila! ...¡¡Digo una cola!!

source: Dude you called it a line again!
es: ¡Le dijiste fila otra vez!

source: The world is one big line? Hmm that's an... interesting philosophy.
es: ¿Es mundo es una gran fila? Hmm eso es una... filosofía interesante.

source: Philosophy? More like an interesting loophole.
es: ¿Filosofía? Más bien suena a un vacío legal.

source: Although, at least now they don't have to worry about leaving the line to eat... or to use the bathroom.
es: Aunque, al menos ahora no tienen que preocuparse de dejar la fila para comer... o para usar el baño.

source: To use the bathroom? Open your mind, the world is just... one big bathroom!
es: ¿Usar el baño? Abre tu mente, el mundo es solo un... ¡Un gran baño!

source: Dude. ...Kind of ruining my appetite here.
es: ...Estás arruinando el apetito.

source: S-sorry...
es: P-perdón...

source: Mmmm, that was microlicious! I'll waive any disdain I had for this microplace.
es: ¡Mmmm, eso fue microdelicioso! Microfelicidades al microondas del chef.

source: Microthank you
es: Microgracias

source: Was that 'waive' or 'wave'?
es: ¿Gracias?

source: Should I call an ambulance?
es: ¿Debería de llamar a una ambulancia?

source: Umm... microthank you.
es: Umm... Microgracias.

source: Wait, did you mean 'waive' or 'wave'?
es: Eso es algo bueno, ¿no?

source: Umm... Should I call an ambulance?
es: Umm... ¿Debería de llamar a una ambulancia?

source: If you don't mind micro saying, your waveshave looks very micro. Do you like it that wave?
es: Si no te molesta que lo microdiga, tus ondas se ven muy micro. ¿Te gusta esa onda?

source: I've kinda been thinking about shaving MY microwave, y'know, my micro keeps wavin' me about it. Wave wave micro, wave microwave.
es: Estaba pensando en viajar en micromicro para buscar ondas con mejor ondas, pero creo que solo necesito un micromicroondas.

source: I... I hope you get the help you need.
es: Yo... Espero que encuentres la ayuda que necesites.

source: Oh Shirts! I haven't seen you since leaving Merrymellow Marsh!
es: ¡Oh Shirts! ¡No te veía desde que dejé Ciénaga de Malvaviscos!

source: Oh yeah, hey!
es: ¡Oh hola!

source: Are you here to check out the Chocolava Canyon location? I gotta warn you it's pretty much the same food.
es: ¿Estás aquí para ver la sucursal de Volcán de Chocolava? Debo advertirte que la comida es básicamente la misma.

source: Ha ha pshh yeah, I see! ...I'm within a 2 meter radius of your restaurant, so I must be planning to eat here, is that it?
es: ¡Ja-ja, pshh, claro, ya veo! ...Como estoy a 2 metros de tu restaurante, estoy planeando comer aquí, ¿es eso?

source: It's a big canyon! Lots of cool crap to do other than like, hang out with my amazingly successful friend. Ha ha.
es: ¡Es un volcán muy grande! Hay muchas cosas para hacer, como pasar el tiempo con amigos increíblemente exitosos. Jaja.

source: Pleeeease?
es: ¿Por favoooor?

source: Sure, go do your cool crap
es: Claro, ve y haz tus cosas

source: I'm busy with my cooler friends anyway
es: Estoy ocupado con mis otros amigos exitosos

source: Yeah sounds good, I'll just let you get on with your cool crap.
es: Claro, suena genial, te voy a dejar para que hagas tus cosas.

source: No no, I'm just playing around! I want to catch up, ha ha. How've you been anyway?
es: ¡No no, solo estoy bromeando! Quiero charlar un rato, jaja. ¿Cómo has estado?

source: I see you're trying this whole um... ultra-successful, responsible, rich restaurant owner thing. That seems pretty alright.
es: Veo que estás ocupado con este um... ultra-exitoso, responsable y próspero restaurante. Parece que estás bien.

source: Awww pleeeease? PLEEEEEEASE!?
es: Awww ¿por favoooor? ¿¡POR FAVOOOOOOR!?

source: C'mon have some self respect, ha ha ha!
es: ¡Vamos, ten algo de autorespeto, jajaja!

source: If I knew you were THIS desperate to see me I'd have never come by in the first place.
es: Si sabía que ibas a estar ASÍ de desesperado de verme, nunca habría aparecido en primer lugar.

source: So anyway how's this whole um... ultra-successful, responsible, rich restaurant owner thing going? That seems pretty alright.
es: Como sea, ¿cómo estás con este um... ultra-exitoso, responsable y próspero restaurante? Parece que estás muy bien.

source: Yeah, come to think of it I'm busy all day hanging out with my cooler friends.
es: Si, ahora que lo pienso, voy a estar ocupado con mis amigos mucho más exitosos.

source: Yeah you know! It comes with a little responsibility, and it's stressful at times. But overall it's going well.
es: ¡Oh, ya sabes! Viene con un poco de responsabilidad, y es algo estresante de momentos. Pero en general, está bien.

source: How about you, how are things in Merrymellow Marsh?
es: ¿Qué hay de ti, cómo están las cosas en Ciénaga de Malvaviscos?

source: Oh yeah, don't worry. Things got WAYYY better after you left! Oh, like, no offense.
es: Oh sí, no te preocupes. ¡Las cosas mejoraron MUCHO cuando te fuiste! Oh, sin ofender.

source: Um, thanks
es: Um, gracias

source: Ha ha, c'mon
es: Jaja, vamos

source: Ha ha, sounds like I was really holding that place back!
es: ¡Jaja, suena a que yo era solo una molestia para el lugar!

source: No no, like – don't get the wrong idea. Things were just rough while you were there and, I was in kind of a bad place...
es: No no, es que - no lo malentiendas. Cuando estabas, las cosas eran muy malas, y yo estaba en un mal lugar...

source: Like wait, not BECAUSE you were there! You're great! Umm, hold on... (sigh)
es: ¡Pero no porque TU estabas ahí! ¡Eres genial! Umm, espera... (suspiro)

source: Y-yeah...
es: S-sí...

source: Y-yeah, I get it...
es: S-sí, lo entiendo...

source: Geez c'mon, go easy on me here!
es: ¡Oh, vamos, no me ataques así!

source: Okay. One last time.
es: Bueno. Una última vez.

source: It's nice to see you. I'm doing great. ...There, did I do it?
es: Es bueno volver a verte. Estoy bien. ...Ahí, ¿lo hice bien?

source: Got it in one!
es: ¡Se entendió, y al primer intento!

source: Ha ha anyway I'm gonna go eat something! See you inside~
es: Jaja, bueno, ¡voy a comer algo! Nos vemos adentro~

source: Ahh, still struggling with those cheese pieces? They're tricky at first.
es: Ahh, ¿sigues teniendo problemas con las piezas de queso? Es algo confuso al principio.

source: Half of them are too BIG and half of them are too SMALL! These are impossible!!
es: ¡La mitad es muy GRANDE y la otra mitad muy CHICA! ¡¡Son imposibles!!

source: Oh I know all about that! But I can tell you some advice that helped me.
es: ¡Oh, te entiendo perfectamente! Pero puedo decirte un consejo que me ayudó.

source: Okay, what's your advice?
es: Bueno, ¿cuál es tu consejo?

source: You see, the word 'Boob' looks like boobs in three different ways.
es: Mira, la palabra "Banco" puede verse de tres formas diferentes.

source: The upper-case 'B' looks like boobs from above. The middle 'oo' looks like boobs from the front. And the last 'b' looks like boobs from the side.
es: Un banco puede ser algo con mucho dinero. Para otros, es algo donde uno puede sentarse. Y para otros es solo un grupo de peces.

source: That's... NOT helpful advice!
es: Eso... ¡No me ayuda PARA NADA!

source: The upper-case 'B' look-
es: Un banco puede ser algo-

source: -Stop! STOP! I've already HEARD this advice before!!!
es: -¡Para! ¡DETENTE! ¡¡¡Ya ESCUCHÉ ese consejo antes!!!

source: Oh really? Well, I don't know what else to tell you, I'm sorry!
es: Oh, ¿en serio? Entonces no se qué decirte, ¡perdón!

source: (sigh) I need to stop listening to people's advice...
es: (suspiro) Necesito dejar de escuchar los consejos de la gente...

source: Wow! I'd say you've officially proven your skills as a world class chef. Well done!!
es: ¡Wow! Diría que oficialmente probaste tus habilidades como chef de clase mundial. ¡¡Enhorabuena!!

source: Yes definitely! Congratulations!
es: ¡Sí, definitivamente! ¡Felicidades!

source: That was an ordeal
es: Fue una prueba difícil

source: Phew, finally
es: Phew, al fin

source: That's it? That was easy
es: ¿Listo? Fue fácil

source: Wait, that's it? Because I thought it was gonna be, you know, difficult...
es: Espera, ¿ya está? Porque pensé que iba a ser, no se, difícil...

source: Ohh, it's harder for most people. I knew you'd blow through it!
es: Ohh, es difícil para mucha gente. ¡Sabía que podías pasarla!

source: Phew, finally! ...So that's really it? No more surprise challenges?
es: ¡Phew, al fin! ...¿Entonces ya está? ¿No más desafíos sorpresa?

source: That's really it. I knew you had it in you!
es: Eso fue todo. ¡Sabía que podías pasarla!

source: Holy smokes that was an ordeal! ...Did you have to make it so difficult!?
es: ¡Santo Cielo, fue una prueba muy difícil! ...¿¡Tienen que hacerla tan difícil!?

source: Ohh, I knew you'd blow through it!
es: ¡Ohh, sabía que podías pasarla!

source: Ah-hahaha. Congratulations #player#~
es: Ah-jajaja. Felicidades #player#~

source: Thanks, Fat Sensei.
es: Gracias, Fat Sensei.

source: Oh! You still remember my name.
es: ¡Oh! Todavía recuerdas mi nombre.

source: Your name!? Of course I remember your name.
es: ¿¡Tu nombre!? Por supuesto voy a recordar tu nombre.

source: ...Ha ha. You forget sometimes.
es: ...Jaja. A veces te olvidas.

source: You're so weird! ...Don't worry. I'll try not to forget.
es: ¡A veces me preocupas! ...Pero no, no me voy a olvidar de tu nombre.

source: ...So when do I get my plaque?
es: ...Entonces ¿Cuándo me dan mi placa?

source: Plaque? Mm-mm, we can't just go givin' away plaques! ...They sell those in the gift shop though.
es: ¿Placas? ¡Mm-mm, nosotros no damos placas! ...Vendemos algunas en la tienda de regalos.

source: Gift shop!?!
es: ¡¿¡Tienda de regalos!?!

source: Well this is it, you've used up all your other... ONE chances.
es: Todo o nada, ya usaste todas tus otras... ÚLTIMAS oportunidades.

source: This is your TRUE last chance!
es: ¡Esta es la VERDADERA última oportunidad?

source: What happens if I mess up?
es: ¿Qué pasa si la echo a perder?

source: You seem serious this time
es: Esta vez parece serio

source: We're still doing this?
es: ¿Todavía seguimos haciendo esto?

source: Only one chance!? ...What happens if I mess up?
es: ¿¡Solo una!? ...¿Qué pasa si la echo a perder?

source: Then that's it! No more chances!! Sorry, we have to remain impartial.
es: ¡Entonces se acabó! ¡¡No más oportunidades!! Perdón, hay que mantenerse imparcial.

source: Wait, really? ...You seem serious this time!
es: Espera, ¿en serio? ...¡Esta vez parece serio!

source: Of course I seem serious! No more chances! This is it!
es: ¡Por supuesto! ¡Esto es serio! ¡No más oportunidades!

source: Wow! O-okay.
es: ¡Wow! B-bueno.

source: Still doing this? You don't seem very intimidated. No more chances! This is it!
es: ¿Si seguimos con esto? No pareces muy intimidado. ¡No más oportunidades!

source: Yes yes, okay.
es: Sí sí, claro.

source: Also, you can turn on cheats if you want to, over in the Settings menu.
es: Antes que me olvide, puedes activar los trucos, en el menú de configuración.

source: Isn't that cheating?
es: ¿Eso no es hacer trampa?

source: Will it really count?
es: ¿Va a contar?

source: But I'm so close!
es: ¡Pero estoy muy cerca!

source: Turn on cheats? Isn't that cheating?
es: ¿Activar trucos? ¿Eso no es hacer trampa?

source: Yes, cheating is cheating. But that's okay, everybody cheats.
es: Sí, es hacer trampas. Pero está bien, todos hacen trampa.

source: I don't remember agreeing to this, that they could cheat!
es: ¡No recuerdo aceptar esto, que podía hacer trampas!

source: I want to do it without cheating! I'm so close!
es: ¡Lo quiero hacer sin trucos! ¡Estoy muy cerca!

source: Mmm that's very honorable of you. But sometimes, it's honorable to know when to cheat, and to know when to not cheat.
es: Mmm, eres muy honorable. Pero a veces, es honorable saber cuándo usar trucos, y cuándo no usarlos.

source: I don't remember agreeing to this, this kind of 'honorable cheat'!
es: ¡No recuerdo acertar esto, estos "trucos honorables"!

source: Oh, I don't know... Will it really count if I cheat?
es: Oh, no se... ¿Va a contar si hago trampas?

source: Yes, don't worry, it still counts. Everybody cheats a little sometimes.
es: Si, no te preocupes, va a contar. Todos hacen trampas de vez en cuando.

source: Shh! We're staying impartial!
es: ¡Shh! ¡Nos mantenemos imparciales!

source: Can I at least wish them good luck then?
es: ¿Entonces puedo al menos decirle buena suerte?

source: Mmm, you may not.
es: Mmm, no, no puedes.

source: Once again, it's time for... The ultimate test! To prove your skills as a world class chef!
es: Otra vez, es hora de... ¡La última prueba! ¡Para probar tus habilidades de chef de clase mundial!

source: A trial renowned both for its brutal duration! And blinding speeds! With just... ONE chance!
es: ¡Una prueba famosa por su brutal duración y su máxima velocidad! Con solo... ¡UNA oportunidad!

source: So that was a practice before?
es: ¿Entonces lo anterior era práctica?

source: You said that last time
es: Lo dijiste la última vez

source: One chance! Just one!!! If you mess up, that's it!
es: ¡Una oportunidad! ¡¡¡Solo una!!! ¡Si no pasas la prueba, se acabó!

source: Wait, so was last time a practice, and this is it?
es: Espera, ¿entonces lo de la otra vez era solo práctica?

source: Last time? Practice? Stop talking nonsense! THIS is your last time! There is no practice!
es: ¿La otra vez? ¿Práctica? ¡Deja de decir cosas sin sentido! ¡ESTA es tu última oportunidad! ¡No hay práctica!

source: Oh, um... Okay! I'll do better this time.
es: Oh, um... ¡Bueno! Voy a hacerlo mejor esta vez.

source: You said I only got one chance last time.
es: El otro día dijiste que solo tenía una oportunidad.

source: Well this time... It's REALLY your last chance! No more chances after this one!
es: Bueno, esta vez... ¡REALMENTE es tu última oportunidad! ¡No más después de esta!

source: I don't think I believe you...
es: No te creo para nada...

source: Ah-hahahaha!
es: ¡Ah-jajajaja!

source: Once again I wish you... average luck!
es: Otra vez, te deseo... ¡suerte promedio!

source: Thank you, you're too k— ... You're... average kind.
es: Gracias, eres muy amab- ... Eres... promedialmente amable.

source: Well here it is, the ultimate test to prove your skills as a world class chef!
es: ¡Bueno, aquí estamos, la última prueba para probar tus habilidades como un chef de clase mundial!

source: This one's gonna take awhile!
es: ¡Esta va a tomar un buen rato!

source: Don't worry, there's no cheese pieces or any tricks like that.
es: No te preocupes, que no hay piezas de queso o ninguna sorpresa.

source: Mmm, but it gets pretty fast too! So keep your wits up.
es: ¡Mmm, pero agarra velocidad! Así que mantente alerta.

source: Yes yes, and worst of all, you only get ONE chance! Ah-hahaha!
es: Sí sí, lo peor de todo, ¡solo tienes UNA oportunidad! ¡Ah,jajaja!

source: One chance... FOREVER?
es: Una oportunidad... ¿PARA SIEMPRE?

source: Mmm, yeah right
es: Mmm, sí, claro

source: Oh, don't worry, this is fine. If you can't do it, then we give you another chance tomorrow.
es: Oh, no te preocupes, está bien. Si no puedes pasar la prueba, te daremos otra oportunidad mañana.

source: What? ...Like one chance today, or one chance forever?
es: ¿Qué? ...¿Una oportunidad hoy, o para siempre?

source: One chance FOREVER! No more chances! This is it!
es: ¡Una oportunidad PARA SIEMPRE! ¡No hay más oportunidades! ¡Eso es todo!

source: Mmm, yeah right.. Is this one of those things where I screw up, and you let me try again later anyway?
es: Mmm, sí, claro... ¿Es una de esas cosas en las que si me equivoco, luego me dejan intentar otra vez?

source: Yes yes don't worry, this is fine. If you can't do it, then we give you another chance tomorrow.
es: Si si, no te preocupes, está bien. Si no puedes pasar la prueba, te damos otra oportunidad mañana.

source: No! ONE chance! Just one, we have to remain impartial.
es: ¡No! ¡UNA oportunidad! Solo una, tenemos que mantenernos imparciales.

source: Impartial!? I don't even know them, why do I have to be impartial?
es: ¿¡Imparcial!? Pero si ni le conozco, ¿por qué tengo que ser imparcial?

source: (glare)
es: (mirada)

source: Ahh... Okay! Okay fine. One chance. ...Good luck!!!
es: Ahh... ¡Bueno! Bueno, está bien. Una oportunidad. ...¡¡¡Buena suerte!!!

source: I can't even say "Good Luck!?" Good luck isn't impartial? Fine!
es: ¿¡Ni siquiera puedo decir "Buena suerte"!? ¿Buena suerte no es imparcial? ¡Bueno!

source: ... ...I wish you... Average luck.
es: ... ...Te deseo... Suerte promedio.

source: Umm... I'll do my average-est.
es: Umm... Voy a hacer mi mejor promedio.

source: Everyone really liked the plaque you picked out!
es: ¡A todos les gustó la placa que elegiste!

source: Well, it feels like the plaque loses some meaning if just anyone can buy one...
es: Bueno, se siente como si la placa perdiese significado si cualquiera la puede comprar...

source: Yes, life is like that. Anyone can buy a plaque in the store!
es: Sí, se siente así. ¡Cualquiera puede comprar una placa en la tienda!

source: And you can get it engraved to say anything you want.
es: Y también puedes ponerle un grabado que diga lo que tú quieras.

source: "World's least offensive smelling chef!" It doesn't even have to be true.
es: ¡"Chef con menor olor ofensivo del mundo"! No tiene que ser cierta.

source: H-hey! I don't smell...
es: ¡H-hey! Yo no apesto...

source: The plaque's meaning is the meaning you assign it personally. ...What does that plaque mean to you?
es: El sentido de la placa es el sentido que le pone uno personalmente. ...¿Qué significa la placa para ti?

source: It's a major accomplishment
es: Es un logro mayor

source: It's a nice trophy
es: Es un lindo trofeo

source: It's nothing special
es: No es nada especial

source: It was a waste of time
es: Fue una pérdida de tiempo

source: It was a waste of time! When I look at it, I think of how much weight I put in it before.
es: ¡Fue una pérdida de tiempo! Cuando la veo, pienso en cuánto trabajo le puse.

source: How I thought all those other restaurants were more prestigious, with better chefs.
es: En como los otros restaurantes eran más prestigiosos, con mejores chefs.

source: But they were just like us! They just had a little extra money to blow on a meaningless plaque.
es: ¡Pero son como nosotros! Solo tienen algo de dinero extra para quemar en placas sin sentido alguno.

source: See? That's the meaning. Who cares if you paid ¥3000 for it? That doesn't change the meaning!
es: ¿Ves? Ese es el significado. ¿A quién le importa si pagaste ¥3000 por ella? ¡Eso no cambia el significado!

source: Now you can look at the plaque and think, "I'm just as special as those other guys!"
es: Ahora puedes ver la placa y pensar, "¡Soy tan especial como cualquiera de ellos!"

source: It was nothing special! When I look at it, I remember how intimidating those plaques were before.
es: ¡No tiene nada de especial! Cuando la veo, recuerdo que tan intimidantes eran las placas antes.

source: It's a nice trophy! When I look at it, I remember how it felt finally being deemed plaque-worthy.
es: ¡Es un lindo trofeo! Cuando la veo, recuerdo que se siente ser finalmente digno de una placa.

source: Cooking in front of a panel of judges, worrying cooking too slowly or my food not being good enough.
es: Cocinar en frente del panel de jueces, preocupándome por mi velocidad o si mi comida no era suficientemente buena.

source: And then everyone said I did a good job, and well... It just nice to be accepted~
es: Y después todos dijeron que hice un buen trabajo, y bueno... Es lindo sentirse aceptado~

source: Now you can look at the plaque and think, "People accept me."
es: Ahora puedes ver a la placa y pensar, "La gente me acepta."

source: Earning that plaque was a major accomplishment! When I look at it, I remember how I didn't give up.
es: ¡Conseguir esa placa fue un logro muy grande! Cuando la veo, recuerdo como no me rendí.

source: And I guess on some level, if there's another harder challenge some day...
es: Y supongo que en cierto nivel, si en otro momento hay desafíos más difíciles...

source: Well, it instills me with the confidence that I won't give up next time either.
es: Bueno, me llena de confianza de que no me voy a rendir en ningún desafío.

source: Now you can look at the plaque and think, "I didn't give up."
es: Ahora puedes ver a la placa y pensar "No me rendí."

source: I guess! It still feels a little hollow in a way.
es: ¡Supongo! De cierta forma, todavía se siente un poco de vacío.

source: That's sort of a good thing. Set your own harder goals! Buy yourself bigger plaques!
es: Eso puede ser algo bueno. ¡Ponte metas más difíciles! ¡Compra placas más grandes!

source: I bet there's some tougher challenges left if you look for them.
es: Apuesto que hay más retos si los buscas.

source: Ohh, so. Hmm... How do YOU think you did?
es: Ohh, entonces. Hmm... ¿Según TU opinión, cómo crees para te fue?

source: That was hard!
es: ¡Eso fue difícil!

source: I blew it
es: Fui un asco

source: I did okay
es: Lo hice bien

source: I did great
es: Lo hice genial

source: That was so hard!
es: ¡Eso fue difícil!

source: Hard!? That was disgraceful! I've seen dogs that poop better than you cook.
es: ¿¡Difícil!? ¡Eso fue una desgracia! Vi a perros hacer popo mejor que tú cocinando.

source: I think I did great!
es: ¡Creo que lo hice genial!

source: Great!? That was disgraceful! I've seen dogs that poop better than you cook.
es: ¿¡Genial!? ¡Eso fue una desgracia! Vi a perros hacer popo mejor que tú cocinando.

source: I think I did... okay?
es: Creo que lo hice... ¿bien?

source: Okay!? That was disgraceful! I've seen dogs that poop better than you cook.
es: ¿¡Bien!? ¡Eso fue una desgracia! Vi a perros hacer popo mejor que tú cocinando.

source: I think I sort of blew it.
es: Creo que fui un asco.

source: Sort of blew it!? That was disgraceful! I've seen dogs that poop better than you cook.
es: ¿¡Asco!? ¡Eso fue una desgracia! Vi a perros hacer popo mejor que tú cocinando.

source: I've never used those cheese pieces before! I guess I'll have to start practicing with them.
es: ¡Nunca antes usé esas piezas de queso! Supongo que tengo que empezar a practicar con eso.

source: Hahaaaa yeah, those pieces get easier with a little practice!
es: ¡Por supuesto, usar esas piezas se vuelve más fácil con un poco de práctica!

source: My restaurant Carbcraft is next door to yours, so just gimme a shout if you need any advice.
es: Mi restaurante CarbCraft está al lado del tuyo, así que si necesitas algún consejo, solo llámame.

source: I have some advice, #player#! ...Have you considered a career in medicine?
es: ¡Yo tengo un consejo, #player#! ...¿Consideraste hacer una carrera en medicina?

source: Fat Sensei you're so rude sometimes! #player#, you did great for your first time.
es: ¡Fat Sensei, a veces eres muy rudo! #player#, lo hiciste bien para ser tu primera vez.
