Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: Oh my, you're not supposed to know how to do that! ...But yes, those boxes earn ¥15 when you clear them.
es: ¡Wow, se supone que no deberías saber eso! ...Pero sí, estas cajas valen ¥15 cuando las limpias.

source: Well done! Those boxes earn ¥15 when you clear them. Try clearing a few box lines.
es: ¡Bien hecho! Estas cajas valen ¥15 cuando las limpias. Intenta limpiar algunas líneas de cajas.

source: Impressive! Using squish moves, you can organize boxes in tall vertical stacks and earn a lot of money.
es: ¡Impresionante! Aplastando piezas, puedes organizar muchas cajas apilándolas en vertical y conseguir mucho dinero.

source: Welcome to Turbo Fat! You seem to already be familiar with this sort of game, so let's dive right in. Clear a row by filling it with blocks.
es: ¡Bienvenido a Turbo Fat! Parece que ya estás familiarizado con este tipo de juego, así que vamos a comenzar. Limpia una fila llenándola con bloques.

source: Today we'll learn about cake boxes! Do you remember how boxes work?
es: ¡Hoy vamos a aprender a hacer cajas de torta! ¿Recuerdas como hacer cajas?

source: Try making some snack boxes by arranging pairs of pieces into squares.
es: Intenta hacer algunas cajas de snacks juntando pares de piezas en cuadrados.

source: Arranging pieces into a square makes a snack box worth ¥15. But rectangles make cake boxes worth ¥40!
es: Hacer cuadrados al juntar piezas hacen una caja de snacks, que valen ¥15 ¡Pero los rectángulos hacen cajas de tortas que valen ¥40!

source: A cake box needs exactly three pieces in a rectangle. No more, no less.
es: Una caja de torta necesita exactamente tres piezas en un rectángulo. No más, no menos.

source: There are eight ways to do it. I could show you, but I want you to try it yourself!
es: Hay ocho formas de hacerlas. ¡Te podría mostrar, pero quiero que lo intentes!

source: Give it another try. See if you can make a rectangle.
es: Intenta otra vez. Prueba en hacer un rectángulo.

source: Let's start by making gelatin. Can you make a rectangle with these pieces?
es: Comencemos haciendo gelatina. ¿Puedes hacer un rectángulo con estas piezas?

source: Next let's try double-decker brownies. Can you make another cake box with this?
es: Ahora intentemos hacer brownies de dos pisos. ¿Puedes hacer otra caja de torta con esto?

source: I'll give you a small hint: Both chocolate pieces go into the left box.
es: Voy a darte una pequeña pista: Ambas piezas de chocolate van en la caja izquierda.

source: Give it another try. See if you can make two rectangles.
es: Intenta otra vez. Prueba si puedes hacer dos rectángulos.

source: Here's something more difficult. Can you make two cake boxes at once?
es: Aquí hay algo más complicado. ¿Puedes hacer dos cajas de torta al mismo tiempo?

source: You can make cake boxes with the bigger pieces. And they're worth three times as much sideways!
es: Puedes hacer una caja de torta con estas piezas grandes. ¡Y vale tres veces más de costado!

source: See all those stars? Each star becomes a tasty treat for our customers. And more treats means more money!
es: ¿Ves esas estrellas? Cada estrella se transforma en una rico dulce para nuestros clientes. ¡Más dulces significa más dinero!

source: Let's see if you can figure out these last four recipes without my help.
es: Veamos si puedes descubrir las últimas cuatro recetas sin mi ayuda.

source: How about some cheesecake? You'll need a bigger rectangle this time.
es: ¿Qué tal algo de cheesecake? Esta vez vas a necesitar un rectángulo más grande.

source: Let's try some strawberry cake. Can you make a cake box with these pieces?
es: Intentemos algo de torta de frutilla ¿Puedes hacer una caja de torta con estas piezas?

source: Okay, final two recipes! ...Can you make two cakes at once?
es: ¡Ok, las últimas dos recetas! ...¿Puedes hacer dos cajas al mismo tiempo?

source: I'm getting a tummy ache! Try your new cake recipes on these customers, while I go lie down...
es: ¡Me está agarrando dolor de estómago! Practica tus recetas de tortas nuevas con estos clientes, mientras me acuesto un poco...

source: Good! Snack boxes are worth lots of money. But, we can do better!
es: ¡Bien! Las cajas de snacks valen mucho dinero. ¡Pero podemos hacerlo mejor!

source: Good job! It seems like you understand cake boxes already.
es: ¡Buen trabajo! Parece que entendiste como hacer cajas de torta.

source: Ahha ha ha! You're just trying to impress me.
es: ¡Jajajaja! Solo estás intentando impresionarme.

source: Good job! You can make gelatin with a J, L and O-Block.
es: ¡Buen trabajo! Puedes hacer gelatina con los bloques J, L y O.

source: Oops! ...Let's try that again.
es: ¡Ay! ...Intentémoslo otra vez.

source: Oh? But I even gave you an extra piece to trick you! Hmm, how about this.
es: ¿Oh? ¡Incluso te di una pieza extra para engañarte! Hmm, qué tal esto.

source: Wow, color me impressed! But, there's one more thing you should know about cake boxes.
es: ¡Wow, me impresionaste! Pero, hay algo más que debes saber sobre las cajas de tortas.

source: Oh, you're half way there! ...Now try for the other one.
es: Oh, ¡ya estás por la mitad! ...Ahora intenta el otro.

source: Wow, that looks delicious!
es: ¡Wow, eso se ve delicioso!

source: Wow! That's all eight recipes.
es: ¡Wow! Esas son las ocho recetas.

source: Alright, you little showoff. ...Have you been studying?
es: Está bien, pequeño presumido. ...¿Has estado estudiando?

source: Make a few more snack boxes. ...Or cake boxes, if you must.
es: Haz algunas cajas de snacks. ...O cajas de torta, si debes.

source: Ahhh... you didn't make any cakes! Well, cake boxes can be tricky. Keep practicing!
es: Ahhh... ¡No hiciste ninguna torta! Bueno, hacer cajas de torta puede ser difícil. ¡Sigue practicando!

source: Ahhh... you only made one cake? Well, cake boxes can be tricky. Keep practicing!
es: Ahhh... ¿Solo hiciste una torta? Bueno, hacer cajas de torta puede ser difícil. ¡Sigue practicando!

source: Oh, you made %s cakes! All that training paid off. Look at those happy customers!
es: Oh, ¡hiciste %s tortas! Todo ese entrenamiento valió la pena. ¡Mira todos esos clientes felices!

source: Wow, you made %s cakes? Maybe you should be training me!
es: Wow, ¿hiciste %s tortas? ¡Creo que deberías entrenarme a mi!

source: Just kidding, I should still be training you. But you did really well! Wow!
es: Solo bromeaba, yo debería seguir entrenándote. ¡Pero lo hiciste muy bien! ¡Wow!

source: %s CAKES!? Okay, well that's just ridiculous!
es: ¿¡ %s TORTAS!? ¡Bueno, eso ya es ridículo!

source: I'll have to think of some harder tutorials for someone like you. You little troublemaker!
es: Tengo que pensar en tutoriales más difíciles para alguien como tú. ¡Pequeño alborotador!

source: Today we'll go over combos. Combos are easy, you might have already done them on accident!
es: Hoy vamos a ver combos. Los combos son fáciles, ¡puede que hasta los hayas hecho por accidente!

source: Try again! Try to clear five lines without stopping. Dropping one piece off to the side won't break your combo.
es: ¡Inténtalo de nuevo! Intenta limpiar cinco líneas sin detenerte. Dejar caer una pieza al costado no romperá el combo.

source: See if you can clear five lines without stopping. Well, a short break is actually okay too.
es: Veamos si puedes limpiar cinco líneas sin detenerte. Bueno, un pequeño descanso también está bien.

source: Try again! Try to extend this combo by seven lines. Make boxes to keep your combo from breaking.
es: ¡Inténtalo de nuevo! Intenta extender este combo con siete líneas. Haz cajas para evitar romper el combo.

source: Let's use boxes to extend a combo! Try to clear seven more lines without letting your combo break.
es: ¡Vamos a usar cajas para extender el combo! Intenta limpiar siete líneas más sin romper el combo.

source: You can make a cake box with three pieces. Let me show you.
es: Puedes hacer una caja de torta con tres piezas. Déjame mostrarte.

source: Unfortunately, it's difficult to continue a combo with cake boxes. The first two pieces will break the combo.
es: Desafortunadamente, es difícil continuar un combo con cajas de torta. Las primeras dos piezas romperán el combo.

source: With a little foresight, you can clear some lines while building a cake box. Then your combo won't break.
es: Con un poco de anticipación, puedes limpiar líneas mientras construyes la caja de torta. Entonces el combo no se romperá.

source: Try again! Try to make two cake boxes. Clear lines to keep your combo from breaking.
es: ¡Inténtalo de nuevo! Intenta hacer dos cajas de torta. Limpia líneas para evitar romper el combo.

source: Now see if you can do it. Make two cake boxes, but don't let your combo break.
es: Ahora veamos si lo puedes hacer. Haz dos cajas de torta, pero no rompas el combo.

source: ...Oh! Customers! Try to get ¥120 in one big combo. It might help to make some boxes first.
es: ...¡Oh, clientes! Intenta conseguir ¥120 con un combo grande. Hacer primero algunas cajas podría ayudar.

source: Oops! ...You needed to clear a line with that last piece.
es: ¡Ay! ...Necesitabas limpiar una línea con esa última pieza.

source: Impressive! Hmm... Was there anything else?
es: ¡Impresionante! Hmmm... ¿Había algo más?

source: Oh! ...You needed to clear a line that time.
es: ¡Oh! ...Ahí necesitabas limpiar una línea.

source: Combos earn you extra money! You can build combos by making boxes and clearing lines. Otherwise, dropping two pieces will reset your combo.
es: ¡Los combos te hacen ganar dinero extra! Puedes hacer combos al hacer cajas y limpiar líneas. Por el contrario, hacer caer dos piezas rompen el combo.

source: In other words, you get two chances to make a box or clear a line before you lose your combo. Does that make sense?
es: En otras palabras, tienes dos intentos para hacer una caja o limpiar una línea antes de perder tu combo. ¿Tiene sentido?

source: In other words,you get two chances to make a box or clear a line before you lose your combo.
es: En otras palabras, tienes dos intentos para hacer una caja o limpiar una línea antes de perder tu combo.

source: Arranging two or more pieces into a rectangle will make a box. That's one easy way to keep your combo alive! Just place two pieces to make a square.
es: Acomodar dos o más piezas en un rectángulo hacen una caja. ¡Esta es una forma fácil de mantener tu continuar tu combo! Solo pon dos piezas para hacer un cuadrado.

source: Clearing a line will also continue your combo. But, you don't have to clear a line with every piece! You can drop one piece without breaking your combo.
es: Limpiar una línea también continua tu combo. Pero, ¡no hace falta limpiar líneas con todas las piezas! Podés dejar caer una pieza sin romper tu combo.

source: Your combo's only interrupted if you drop two pieces without doing something. So, you're allowed to make one mistake! Or, to use one piece to plan ahead.
es: Tu combo solo es interrumpido si dejas caer dos piezas sin hacer nada. ¡Tienes permitido hacer un error! O usar una pieza para planear el siguiente paso.

source: Oops! I can still make the cake box, but my combo already broke.
es: ¡Ay! Todavía puedo hacer la caja de torta, pero mi combo ya se rompió.

source: There, I did it! That was tricky.
es: ¡Listo, lo hice! Fue algo complicado.

source: Wow, I didn't expect that! Great job. You're already a combo master!
es: ¡Wow, no me esperaba eso! Buen trabajo. ¡Ya eres un maestro del combo!

source: Oh no, you broke your combo without reaching ¥120! Well, don't worry about that.
es: ¡Oh no, rompiste tu combo sin llegar a los ¥120! Bueno, no te preocupes.

source: ¥120 is just a number I pulled out of my, um. ...Out of thin air.
es: ¥120 es solo un número que saqué de mi, um. ...Del aire.

source: Okay, I get it!
es: ¡Bien, lo entiendo!

source: ...Can you go into more detail?
es: ...¿Puedes entrar más en detalle?

source: Yes, I see!
es: ¡Sí, ya veo!

source: What do you mean by that?
es: ¿Qué quieres decir con eso?

source: Oh! That's easy.
es: ¡Oh! Eso es fácil.

source: Hmm, maybe one more time?
es: Hmm, ¿Tal vez una vez más?

source: Let's learn about spin moves! Maybe you already figured out how they work, but I'll try to teach you something new.
es: ¡Vamos a aprender sobre movimientos de giro! Tal vez ya sepas como se usan, pero voy a intentar enseñarte algo nuevo.

source: Can you make a cake box with this piece? It doesn't quite fit, does it?
es: ¿Puedes hacer una caja de torta con esta pieza? No encaja del todo, ¿no?

source: Now you try! Move the piece into position and rotate it.
es: ¡Ahora inténtalo! Mueve la pieza en posición y gírala.

source: Try again! Move the piece into position and rotate it.
es: ¡Intenta otra vez! Mueve la pieza en posición y gírala.

source: A spin move is where you rotate a piece, locking it in place like this.
es: Un movimiento de giro es cuando rotas una pieza, asegurándola en el lugar así.

source: See, it fits perfectly after I rotate it. Isn't that clever?
es: Ves, encaja perfectamente después de que la roté. ¿No es inteligente?

source: Customers won't tip extra for spin moves or anything like that! ...But they're useful sometimes.
es: ¡Los clientes no pagan extra por movimientos de giro ni nada de eso! ...Pero a veces son útiles.

source: Let's try another spin move. See if you can make a box here.
es: Vamos a intentar otro movimiento de giro. Veamos si puedes hacer una caja.

source: Here, now your squish move won't work. See if you can do it by spinning this time.
es: Bien, ahora no puedes aplastar la pieza. Veamos si ahora puedes hacerlo girando la pieza.

source: How about with a U-Block, can you spin here?
es: Y con los bloques U, ¿Puedes hacer un giro?

source: Oh! It's getting a little cramped. Can you still spin here?
es: ¡Oh! Ahora hay menos lugar. ¿Todavía puedes hacer un giro?

source: How about like this? Can you find a way to spin here?
es: ¿Y qué tal ahora? ¿Puedes encontrar la manera de hacer un giro?

source: Can you figure out how to flip this piece into place to make a box?
es: ¿Puedes encontrar la forma de dar vuelta esta pieza para hacer una caja?

source: Try again! Press both rotate buttons to flip the piece into place.
es: ¡Intenta otra vez! Aprieta ambos botones de rotación para dar vuelta la pieza.

source: If you press both rotate buttons, the piece flips!
es: Si aprieta ambos botones de rotación, ¡La pieza se da vuelta!

source: Flipping a piece is helpful if you want to play very fast. ...But it's necessary for some spin moves, too.
es: Dar vuelta piezas ayuda mucho si quieres jugar muy rápido. ...Pero también es necesario para algunos movimientos de giro.

source: How about this T-Block? Can you spin this one too?
es: ¿Qué tal esta pieza T? ¿Puedes hacerla girar?

source: What do you think about this? Can you spin this piece in?
es: ¿Qué piensas de esto? ¿Puedes hacerlo girar al lugar?

source: Here's something a little more sensible. Can you find a way to spin here?
es: Aquí hay algo más razonable. ¿Puedes encontrar la forma de hacer girar la pieza?

source: Try again! Don't forget you can use squish moves, too.
es: ¡Intenta otra vez! No te olvides que también puedes aplastar piezas.

source: Okay there Flippy Longstocking, why don't you try this one?
es: Bueno, Giritos de Oro, ¿Por qué no intentas este?

source: Well done! Try showing off your new spin moves in front of these customers.
es: ¡Bien hecho! Intenta mostrar tus nuevos movimientos en frente de estos clientes.

source: Oops! Why don't we try that again.
es: ¡Ay! Intentémoslo otra vez.

source: That's right! You understand spin moves already.
es: ¡Correcto! Ya entiendes los movimientos de giro.

source: Oh, that's not right. Let me show you how spin moves work!
es: Oh, eso no está bien. ¡Déjame mostrarte como funcionan los movimientos de giro!

source: Ahha ha, yes! It's easier to perform a squish move here. ...This was sort of a trick question.
es: ¡Jaja, sí! Aquí es más fácil aplastar la pieza. ...Era una pregunta capciosa.

source: WHAT!? You're not supposed to know about that! ...I'll just pretend you did something more sensible.
es: ¿¡QUÉ?! ¡Se supone que no deberías saber eso! ...Voy a pretender que hiciste algo más razonable.

source: Good job! Although, it's probably better to squish here.
es: ¡Buen trabajo! Aunque en este caso probablemente era mejor aplastar la pieza.

source: Oops that's not right. This one's a little tricky...
es: Ay, no está bien. Este es un poco difícil...

source: Good job! If you rotate it left, it goes right in.
es: ¡Buen trabajo! Si lo rotas a la izquierda, entra justo.

source: Good job! It works here too, it's just a little different.
es: ¡Buen trabajo! También sirve aquí, aunque un poco diferente.

source: Oops! That didn't work...
es: ¡Ay! Eso no funcionó...

source: Stop flipping your piece like that, you big showboat! You're ruining my tutorial.
es: ¡Deja de girar las piezas así, gran presumido! Estás arruinando mi tutorial.

source: That's right! Good job.
es: ¡Correcto! Buen trabajo.

source: Good job! I knew you could do it.
es: ¡Buen trabajo! Sabía que podrías hacerlo.

source: Hmm, that's not quite it. Try pressing both rotate buttons. You may need to squish first, too.
es: Hmm, no está bien. Intenta apretar ambos botones de rotación. Tal vez también necesites aplastar la pieza.

source: Hmph, I'll bet you think you're pretty clever...
es: Hmm, apuesto que te crees muy inteligente...

source: Oh, that was a good try but this one's a little special! Let me show you something.
es: ¡Oh, buen intento, pero este es algo especial! Déjame mostrarte algo.

source: That's right. You don't need a spin move here, you can just squish it.
es: Correcto. Aquí no necesitas usar un movimiento de giro, puedes solamente aplastar la pieza.

source: Ahha ha. Yes, very cute.
es: Jaja, sí, muy lindo.

source: Good job! You could just squish that in, too. You don't always need spin moves.
es: ¡Buen trabajo! También puedes aplastar la pieza. No siempre necesitas movimientos de giro.

source: Oops! That wasn't it.
es: ¡Ay! Eso no era.

source: What!? Pieces can't just rotate through walls! That's cheating.
es: ¿¡Qué?! ¡Las piezas no pueden atravesar las paredes! Eso es trampa.

source: Well of course you can't. Pieces can't just rotate through walls! That would be cheating.
es: Por supuesto que no puedes. ¡Las piezas no pueden atravesar las paredes! Eso sería hacer trampa.

source: Good job! Pieces can squish through walls, that doesn't count as cheating.
es: ¡Buen trabajo! Puedes aplastar las piezas entre muros, eso no cuenta como trampa.

source: What is a person like you doing with tutorials anyways? Get out of here, you clown!
es: ¿Qué hace una persona como tú en estos tutoriales? ¡Sal de aquí, payaso!

source: Oops, don't forget to rotate!
es: ¡Ay, no te olvides de rotar!

source: Hmm, that wasn't it.
es: Hmm, eso no era.

source: Oh no! That wasn't very good.
es: ¡Oh no! Eso no estuvo bien.

source: Oh! What happened to the clever person who was ruining my tutorial? Did they step away?
es: ¡Oh! ¿Qué le pasó a la inteligente persona que estaba arruinando mi tutorial? ¿Acaba de irse?

source: Oops! I know this can be tricky sometimes.
es: ¡Ay! Se que a veces puede ser difícil.

source: Hmm, try again. Remember to rotate the piece before it locks into place.
es: Hmm, intenta otra vez. Recuerda rotar la pieza antes de que se asegure en el lugar.

source: Did you forget how to rotate? I'm sure it's confusing, so many big buttons to press...
es: ¿Olvidaste como rotar? Se que es confuso, tantos botones grandes que presionar...

source: Oh no! that wasn't it.
es: ¡Oh no! Eso no era.

source: Oops! That wasn't it, either.
es: ¡Ay! Eso tampoco era.

source: Oh, don't just mash random buttons! You're not Eddy Gordo...
es: Oh, ¡No solo aprietes botones a lo loco! No eres Eddy Gordo...

source: Hmm, that's not quite it. Try pressing both rotate buttons. You may need to squish first, too.
es: Hmmm, no del todo. Intenta apretar ambos botones de rotación. También puede que necesites aplastar la pieza.

source: Oh, celery sticks! The customers aren't paying any attention to us.
es: ¡Oh,! Pero... Los clientes no nos están prestando atención.

source: ...Well, just show off your new spin moves for me then. I'll watch.
es: ...Bueno, entonces muéstrame tus nuevos movimientos de giro. Estoy mirando.

source: Today we'll cover some advanced squish move techniques! But first, let's make sure you remember the basics.
es: ¡Hoy vamos a ver técnicas avanzadas sobre aplastar piezas! Pero primero, vamos a asegurarnos de que recuerdas lo básico.

source: Hold soft drop to squish pieces through this gap.
es: Mantén caída lenta para aplastar piezas por este espacio.

source: So, which of these snack boxes can be completed with a squish move?
es: Entonces, ¿cuál de estas cajas de snacks puede ser completada aplastando una pieza?

source: How about now, can you find a way to squish here?
es: ¿Y ahora? ¿Puedes encontrar el camino correcto?

source: What do you think about this one? Is it possible to make a snack box here?
es: ¿Qué piensas ahora? ¿Es posible hacer aquí una caja de snacks?

source: Here, let me help you with that.
es: A ver, déjame ayudarte con eso.

source: Of course, squish moves aren't always about being very, very clever. ...Sometimes we make mistakes, too.
es: Por supuesto, aplastar piezas no se trata siempre de ser muy, muy listo. ...A veces también cometemos errores.

source: Should I make it worse this time? No, that would be mean.
es: ¿Debería hacerlo peor esta vez? No, eso sería rudo.

source: Hmmm... What are you up to this time?
es: Hmmm... ¿Qué estás haciendo ahora?

source: Your training is complete! But don't let it go to your head, we still have some customers to take care of.
es: ¡Tu entrenamiento está completo! Pero que no se te suba a la cabeza, todavía tenemos clientes que atender.

source: Yes, that's right.
es: Sí, es correcto.

source: That's right! Hmm, how about something tricky...
es: ¡Correcto! Hmm, qué tal con algo más complicado...

source: Wow, okay! ...I need to think of some harder puzzles.
es: ¡Wow, de acuerdo! ...Necesito pensar en puzzles más difíciles.

source: Wow! ...I had a few more of these planned, but it looks like you get the idea.
es: ¡Wow! ...Tenía algunos más planeados, pero parece que ya entendiste la idea.

source: Good job! Squish moves help in all sorts of ways.
es: ¡Buen trabajo! Aplastar piezas puede ayudarte de muchas formas.

source: For a piece to squish successfully, one part needs a straight gap down to the target.
es: Para que una pieza se aplaste exitosamente, una parte necesita un espacio directo hasta el fondo.

source: Here are some examples of good and bad squish moves. Does this make any sense? I know it's a little weird.
es: Aquí hay algunos ejemplos buenos y malos de aplastar piezas. ¿Tiene sentido? Se que puede ser algo raro.

source: So basically, one part of the piece needs a straight gap down to the target or it won't squish.
es: Entonces, básicamente, una parte necesita un espacio directo hasta el fondo o no podrá pasar.

source: These examples on the right don't work, because the piece can't "see" where it's going.
es: Los ejemplos de la derecha no sirven, porque la pieza no puede "ver" donde está yendo.

source: You can think of it like... If the piece were split into tiny chunks, would each chunk be obstructed?
es: Puedes pensarlo como... Si la pieza estaría dividida en varias partes, ¿cada parte estaría bloqueada?

source: These examples on the left work, because one tiny chunk of the piece has a clear path. It just needs one.
es: Los ejemplos de la izquierda sirven, porque una parte de la pieza tiene un camino despejado. Solo necesita uno.
