Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: Hm. Hm. I see. Well... ...At least your island's stupid name acts as a helpful mnemonic so I can remember your less-stupid names.
es: Hm. Hm. Ya veo. Bueno... ...Al menos el nombre estúpido de la isla es una mnemotecnia para recordar sus no-tan-estúpidos nombres.

source: Um! Well...
es: ¡Um! Bueno...

source: Your names are fine!
es: ¡Sus nombres no son tontos!

source: Frungle, your name is dumb
es: Frungle, tu nombre es tonto

source: Kendall, your name is pretty
es: Kendall, tu nombre es lindo

source: Bart, your name is normal
es: Bart, tu nombre es normal

source: Bart, your name is perfectly normal. It's just these other names are a little out there!
es: Bart, tu nombre es perfectamente normal. ¡El resto de los nombres sobresalen un poco!

source: Anyway it's nice to meet all of you umm... Shoot let's see, was it...
es: De todas formas, mucho gusto en conocerlos, umm... Sus nombres eran...

source: ...And... Kung Fu Hustle 3?
es: ...Y... Kung Fu Hour 3?

source: That... that wasn't even particularly close.
es: Eso... Eso no estuvo ni cerca.

source: ...Sorry! I'm probably just groggy from our long flight.
es: ...¡Perdón! Creo que estoy un poco mareado por nuestro largo vuelo.

source: Kendall, your name is pretty! It makes me think of Kringles, or gumballs!
es: ¡Kendall, tu nombre es muy lindo! Me hace recordar a los Kringles, ¡o a chicles!

source: ...Gwuh? Gumballs!?
es: ...¿Gwuh? ¿¡Chicle!?

source: Umm, sorry! I'm probably just hungry from our long flight.
es: ¡Umm, perdón! Probablemente esté hambriento por nuestro largo vuelo.

source: King Frungle Lumps, your name is the only dumb one! I don't know why Fat Sensei... "lumped" you all together.
es: ¡King Frungle Lumps es el único nombre tonto! No se por qué Fat Sensei los puso en el mismo saco.

source: THE ONLY DUMB ONE!? Your name's dumber than MY name!
es: ¿¡EL ÚNICO NOMBRE TONTO?! ¡Tu nombre es más tonto que MI nombre!

source: What is a "#player#" anyways? Some kind of fig!?
es: ¿Qué significa "#player#", uh? ¿¡Es una especie de higo!?

source: ...Ahh, sorry don't mind us. We're probably just grumpy because of our long flight.
es: ...Ahh, perdón, no nos hagas caso. Probablemente está molesto por nuestro largo vuelo.

source: You mean our long run.
es: Te refieres a nuestra larga caminata.

source: Yes... Long flight, long run, whatever...
es: Sí... Vuelo, caminar, es lo mismo...

source: All your names are just fine! Fat Sensei's not usually THIS bad with first impressions.
es: ¡Todos sus nombres no son tontos! Usualmente, Fat Sensei no es TAN malo con las primeras impresiones.

source: ...Maybe they're just grumpy because of our long flight.
es: ...Tal vez está molesto por el largo vuelo.

source: Ohhh #player#! Welcome to our island, we're happy to have you. How was your flight?
es: ¡Ohhh, #player#! Bienvenido a nuestra isla, estamos muy felices de tenerte aquí. ¿Cómo estuvo tu vuelo?

source: We didn't fly! We just ehhh, ran here... ...
es: ¡Nosotros no volamos! Solo que ehhh, corrimos hasta acá... ...

source: ... ...You ran? That's an odd choice for an island destination. You must have had to run... VERY far.
es: ... ...¿Ustedes corrieron? Es una elección rara para llegar a una isla. Debieron de correr desde... MUY lejos.

source: Yes yes well, we needed the exercise. Have to keep up my girlish figure, you know~
es: Sí sí, bueno, necesitábamos el ejercicio. Tengo que cuidar mi figura, ya sabes~

source: Although I must say, there's a remarkable lack of tourists on the Kflab Islands?
es: Aunque debo decirlo, hay una falta muy grande de turistas en las Islas Kflab.

source: Mmm technically not "The Kflab Islands". It's just "Kflab".
es: Mmm, técnicamente no son "Las islas Kflab". Es solo "Kflab"

source: "Kflab"... How is that pronounced?
es: "Kflab" ...¿Cómo se pronuncia?

source: It's pronounced... exactly how I just pronounced it. What kind of question is that??
es: Se pronuncia... justamente como lo acabo de pronunciar. ¿¿Qué tipo de pregunta es esa??

source: It's the kind of question that only makes sense if you were reading my words on a screen. Unless. Oh. Okay. I see.
es: Ese tipo de preguntas solo tiene sentido si estás leyendo mis palabras en una pantalla. A menos que... Oh, ya veo.

source: Ahh anyway... If you'll excuse us, we have some cooking to take care of.
es: Ahh, como sea... Si nos disculpan, tenemos asuntos que cocinar.

source: In the middle of our council meeting!? I mean, that's kind of rude.
es: ¿¡En la mitad de una reunión del consejo!? Que descortés.

source: Ah, sorry yes! Force of habit. We'll be right back~
es: ¡Ah, sí, perdón! Es la costumbre. Ya volvemos~

source: Following the immense popularity of Turbo Fat's Poki Desert location, word spread and the pair opened more and more locations.
es: Siguiendo la inmensa popularidad de Turbo Fat en el Desierto Poki, este par está listo para abrir más sucursales.

source: With their budgetary constraints, they still had to selectively open in less popular locations.
es: Con su presupuesto apretado, ellos todavía tienen que elegir lugares no tan populares.

source: So where did you say our next restaurant was opening? A stinky swamp? An active volcano?
es: ¿Dónde dijiste que iba a estar nuestro próximo restaurante? ¿Un pantano apestoso? ¿Un volcán activo?

source: Hmph, I don't appreciate your candor. And it's unwarranted, because our next location is a tropical island paradise~
es: Hmph, no me gusta tu actitud. Y es injustificada, porque nuestra próxima ubicación es un paraíso, una isla tropical~

source: Oh that's right, the "Kflab Islands". NOW I remember.
es: Oh cierto, las "Islas Kflab". AHORA recuerdo.

source: Ahh beach life! Crowded shorelines, sand in your sneakers... Partying so hard it permanently increases your risk of melanoma!
es: ¡Ahh, la vida en la playa! Playas superpobladas, arena en tus zapatillas... ¡Fiestas 24/7 que aumentan el riesgo de melanomas!

source: Riiight, I'm sure I'll have a blast. Partying in K-Flab. FLAB!!!
es: Claaaaro, de seguro me divertiré. Fiesta en K-Flab. ¡¡¡FLAB!!!

source: You're focusing too much on the flab part! And not enough on the cool island part.
es: ¡Te estás centrando mucho en la parte "flab"! Y no en la parte de la isla tropical.

source: Both parts are important
es: Ambas partes son importantes

source: The flab part is important too
es: La parte "flab" también es importante

source: The island part is important too
es: La parte de la isla también es importante

source: You're making beach life sound awful
es: Estás haciendo que la vida en la playa suene rara

source: I think I'm focusing the correct amount on each part.
es: Creo que me estoy centrando en ambas partes por igual.

source: This from the person who named our restaurant "Turbo Fat"! Hmph, you're suddenly so picky about names.
es: ¡Se queja la persona que nombró nuestro restaurante "Turbo Fat"! Hmph, de la nada te pusiste muy delicado con los nombres.

source: "Fat" is cute! "Flab" is weird...
es: ¡"Fat" es lindo! "Flab" es raro...

source: The flab part is a major factor!
es: ¡La parte "flab" es la factor más importante!

source: The island part is a major factor! Crowded shorelines? Sand in my sneakers?
es: ¡La parte de la isla es el factor más importante! ¿Playas sobrepobladas? ¿Arena en mis zapatillas?

source: Ahh yes, that sneaky sneaker sand! You can never quite get rid of all of it, it's like a fun little souvenir~
es: ¡Ahh, sí, esa pequeña arena molesta! No te la puedes quitar por completo, es como un pequeño y divertido suvenir~

source: ...I'm starting to understand why the name "Kflab" doesn't bother you very much.
es: ...Estoy comenzando a entender porqué el nombre "Kflab" no te molesta tanto.

source: And besides, crowded shorelines? Sand in my sneakers? You're not making beach life sound very appealing.
es: Además, ¿playas sobrepobladas? ¿Arena en mis zapatillas? No estás haciendo que la vida en la playa suene muy atractiva.

source: Okay yes, yes fine. I admit, the name "Kflab" is incredibly off-putting.
es: Bueno bueno, está bien. Lo admito, el nombre "Kflab" es algo muy raro.

source: I'm sure there's a profound meaning or... something. There just has to be.
es: Estoy seguro que hay una explicación lógica y simple o... algo. Algo tiene que haber.

source: Face
es: Cara

source: Nose
es: Nariz

source: Mouth
es: Boca

source: Forehead
es: Frente

source: Hair
es: Pelo

source: Accessory
es: Accesorio

source: Body
es: Cuerpo

source: Tail
es: Cola

source: Belly
es: Panza

source: 1,000¥ Race
es: Carrera 1.000¥

source: Earn 1,000¥ as fast as possible. No tricks!
es: Consigue 1.000¥ lo más rápido posible. ¡Sin trampas!

source: 200¥ Race
es: Carrera 200¥

source: Earn 200¥ as fast as possible. No tricks!
es: Consigue 200¥ lo más rápido posible. ¡Sin trampas!

source: 500¥ Race
es: Carrera 500¥

source: Earn 500¥ as fast as possible. No tricks!
es: Consigue 500¥ lo más rápido posible. ¡Sin trampas!

source: 90 Second Sprint
es: Carrera 90 Segundos

source: Nothing fancy, let's just cook!
es: Nada elegante, ¡Solo cocinemos!

source: A Little Extra
es: Algo Extra

source: Some fun little bonuses at the bottom. But you have to work for it!
es: Algunos pequeños extras en el fondo. ¡Pero hay que trabajar para llegar a ellos!

source: A Little Garbage
es: Un Poco de Basura

source: Nothing to worry about.
es: Nada de que preocuparse.

source: A Little Garbage 2
es: Un Poco de Basura 2

source: Is that food? Don't eat out of the garbage!
es: ¿Eso es comida? ¡No comas del basurero!

source: A Thousand Moles
es: Todo Tipo de Topos

source: Making my way downtown...
es: Ciegos sí, sordomudos no.

source: Above and Below
es: Arriba y Abajo

source: Build some delicious snack boxes above while befriending some moles below.
es: Construye deliciosas cajas de snacks arriba mientras haces amistades con los topos abajo.

source: Accelerator
es: Acelerador

source: Hurry up and finish before things get out of control!
es: ¡Date prisa y termina antes de que las cosas se salgan de control!

source: Angle Grinder
es: Amoladora

source: So many bendy pieces! Need a helping hand? ...Or a helping jaw?
es: ¡Cuantas piezas que puedes cortar! ¿Necesitas una mano? ...¿O una mandíbula?

source: The Asparagus Trio
es: El Trío Espárrago

source: Why is it when something happens, it is always you three?
es: ¿Por qué siempre que algo malo pasa, tienen que estar ustedes tres?

source: Asparagus Vault
es: Bóveda Espárrago

source: Are you planning a robbery? I'm onto you!
es: ¿Estás planeando un robo? ¡Te estoy vigilando!

source: Back to Back
es: Sin Relleno

source: Now where did I put those two line pieces?
es: ¿Ahora dónde puse esas dos piezas largas?

source: Blindy Asparagus
es: Espárragos Cegadores

source: What you can't see CAN hurt you!
es: Ojos que no ven...

source: Block Blockers
es: Bloques Bloqueadores

source: They're just here to get in the way!
es: ¡Solo están aquí para molestar!

source: Dig in!
es: ¡A comer!

source: Grand Opening: Starberry Mountain
es: Gran Apertura: Montaña Estrellamoras

source: Opening a new restaurant can be tough!
es: ¡Abrir un nuevo restaurante puede ser duro!

source: Trial: Fat Sensei
es: Prueba: Fat Sensei

source: Grand Opening: Chocolava Canyon
es: Gran Apertura: Volcán de Chocolava

source: Grand Opening: Kflab
es: Gran Apertura: Kflab

source: Grand Opening: Merrymellow Marsh
es: Gran Apertura: Ciénaga de Malvaviscos

source: Grand Opening: Lemony Thickets
es: Gran Apertura: Bosque Limonesco

source: We're officially open! Let's attract enough customers to make sure we stay that way.
es: ¡Estamos oficialmente abiertos! Vamos a atraer suficientes clientes para quedarnos así.

source: Bottomless Pit
es: Pozo Sin Fondo

source: It just keeps going...
es: Nunca termina...

source: Carrot Alley
es: Callejón de Zanahorias

source: Carrots... Why did it have to be carrots?
es: Zanahorias... ¿Por qué tenían que ser zanahorias?

source: Carrot Cake
es: Torta de Zanahoria

source: Hmph, I guess I'll just try to eat around the carrot part....
es: Hmm, supongo que voy a comer al rededor de la parte de zanahoria...

source: Carrot Cake II
es: Torta de Zanahoria

source: Even cakier cakes! ...Even chonkier carrots! This level is a menace!!!
es: ¡Tortas más ricas! ...¡Pero zanahorias más grandes! ¡¡¡Este nivel es una amenaza!!!

source: Checkerboard Vault
es: Bóveda Tablero

source: Do you have the combination?
es: ¿Te sabes la combinación?

source: Cheerleaders
es: Animadoras

source: They're just happy to be included!
es: ¡Están felices de ser incluidas!

source: On Top of Cheese Mountain
es: En la Cima de la Montaña de Queso

source: ...Did anybody lose a meatball?
es: Quedaría bien con arroz, pero solo hay dulces... Y más queso.

source: Chocolate Star
es: Estrella de Chocolate

source: Close your eyes and make a chocolate wish!
es: ¡Cierra tus ojos y haz un deseo de chocolate!

source: Chompo and Bitey
es: Chombo y Bitey

source: I call the red one Bitey! They like snack boxes... but who doesn't?
es: ¡El rojo es Bitey! Ellos adoran las cajas de snacks... ¿Pero a quién no?

source: Chunky Greens
es: Verduras Gruesas

source: Just pile them beside my plate, where I can ignore them.
es: Solo déjalas a un costado del plato, donde puedo ignorarlas.

source: Cocoa Canyon
es: Gran Cañón de Cacao

source: Excavate the chocolate! Hurry, hurry!
es: ¡Excava el chocolate! ¡Rápido, rápido!

source: Cookie Crevice
es: Galleta Agrietada

source: The good stuff's at the bottom!
es: ¡Las cosas ricas están en el fondo!

source: Cookies
es: Galletitas

source: Let's make some cookies! Who brought the U-Blocks?
es: ¡Vamos a hacer galletitas! ¿Quién trajo los bloques U?

source: Creeping Crevice II
es: Grieta Progresiva 2

source: Curly Queue
es: Cola Giratoria

source: Augh who keeps spinning the next queue? Oh wait, it's me.
es: Uff ¿Quién sigue girando la cola siguiente? Oh, espera, soy yo.

source: Curly Queue II
es: Cola Giratoria

source: They won't stop spinning! This is hurting my head a little...
es: ¡No termina de girar! Me está doliendo un poco la cabeza...

source: 3,000¥ Race EX
es: Carrera 3.000¥ EX

source: Earn 3,000¥ as fast as possible. No tricks!
es: Consigue 3.000¥ lo más rápido posible. ¡Sin trampas!

source: A Little Extra EX
es: Algo Extra EX

source: A Little Garbage EX
es: Un Poco de Basura EX

source: Above and Below EX
es: Arriba y Abajo EX

source: All Nighter
es: Trasnochador

source: When the onion hits your eye like a big pizza pie, that's a painful...
es: Está el cartel de cerrado, y los clientes siguen viniendo...

source: Asparagus Fondue
es: Fondue de Espárrago

source: Why is it when something happens, it is always you four?
es: ¿Por qué siempre que algo malo pasa, tienen que estar ustedes cuatro?

source: Asparagus Gang
es: Pandilla Espárrago

source: People called them 'bad seeds', but they're all grown up now!
es: La gente los llamaban "Semillas malas", ¡Pero ahora todos crecieron!

source: Block Blockers EX
es: Bloques Bloqueadores EX

source: They're still here to get in the way... and they have some new tricks!
es: Todavía están aquí para molestar... ¡Y con algunos trucos nuevos!

source: Boxing Day EX
es: Fábrica de Cajas EX

source: Don't get boxed in!
es: Vamos a ir a... La fábrica de cajas.

source: Cheddarbox Blitz
es: Cajas de Cheddar

source: Can two triangles really make a square? Oh okay, I guess that checks out...
es: ¿Pueden dos triángulos hacer un cuadrado? Oh okay, creo que eso lo demuestra...

source: Five Course Meal
es: Cinco Platos De Comida

source: Five courses? ...I'll have five desserts, please!
es: ¿Cinco platos? ...¡Entonces quiero cinco postres, por favor!

source: Fondue Chasm
es: Fondue Profundo

source: Yum, fruit fondue! Wait, where is the chocolate...?
es: ¡Yum, fondue de frutas! Espera, ¿Dónde está el chocolate...?

source: Fruit on the Top EX
es: Con Fruta Arriba EX

source: It needs to settle first.
es: Primero necesitas limpiarlo.

source: Fruit Salad EX
es: Ensalada de Fruta EX

source: Ick! Salad. ...You said there would be fruit!
es: ¡Puaj! Ensalada. ...¡Dijiste que iba a haber fruta!

source: Garbage Disposal EX
es: Trituradora de Basura EX

source: These pieces are garbage. Lucky thing we've got a garbage disposal! Om nom nom nom nom.
es: Estas piezas son basura. ¡Por suerte, tenemos una trituradora de basura! Om nom nom nom nom.

source: Hungry Moles EX
es: Topos Hambrientos EX

source: You had my curiosity... but now you have my attention!
es: Tenías mi curiosidad... ¡Pero ahora tienes mi atención!

source: It Takes Two
es: Necesitas Dos

source: What takes two? ...Oh please no, not that...
es: ¿Dos qué? ...Oh, no por favor, no eso...

source: It's Square to be Square EX
es: Bocados Helados Cuadrados EX

source: Can you handle all this sugar, or will you go down swinging?
es: ¿Puedes soportar toda esta azúcar, o vas a caer rendido?

source: No Smoking Section II
es: Sector No Fumador 2

source: Cough! Cough! ...Carrots! Too many!
es: ¡Cof! ¡Cof! ...¡Zanahorias! ¡Demasiadas!

source: Onion Cranny
es: Cebollas Caramelizadas

source: This looks just like another level! The resemblance is onion-cranny.
es: Las cebollas caramelizadas pueden o no tener azúcar. Estas tienen extra azúcar.

source: Secret Brownies EX
es: Brownies Secretos EX

source: Secret brownies? Where? ...I must have them!
es: ¿Brownies secretos? ¿Dónde? ...¡Los debo tener!

source: Sharky Cheese 2
es: Con Tiburones Es Más Fácil 2

source: This time with actual cheese! ...Wait, isn't cheese bad for sharks?
es: ¡Ahora con queso! Jeje, queso, fácil, ¿Entiendes?

source: Strawberry Shortcut EX
es: Postres Rellenos EX

source: Take a shortcut. ...A strawberry shortcut!
es: ¡Hay mucho relleno de muchos sabores!

source: Surprise Guests EX
es: Invitados Sorpresa EX

source: Surpriiiise! ...We just thought we'd drop in.
es: ¡Sorpresaaaaa! ...Pasábamos por aquí cerca.

source: Sweet Dreams
es: Dulces Sueños

source: Who left these chocolates under my pillow? They're all melted now!
es: ¿Quién dejó estos chocolates debajo de mi almohada? ¡Se derritieron!

source: Three Minute Sprint EX
es: Carrera Tres Minutos EX

source: Too Fast to Fast EX
es: Trota Torta Trota EX

source: It was already too fast before! This is nonsense...
es: ¡Antes ya era rápido! Esto no tiene sentido...

source: Day/Night Psycho
es: Día/Noche de Locos

source: Sometimes the days just seem to fly by.
es: A veces el día se pasa volando.

source: Destroy Them With Boxes!
es: ¡Destrúyelos Con Cajas!

source: Ack, sweets! My only weakness!
es: ¡Ay, dulces! ¡Mi única debilidad!

source: Destroy Them With Combos!
es: ¡Destrúyelos Con Combos!

source: No no, I was talking about the carrots! ...Please don't destroy the customers.
es: ¡No no, estaba hablando de las zanahorias! ...Por favor, no destruyas los clientes.

source: Donuts
es: Donas

source: Ooh donuts! Don't mind if I do...
es: ¡Ooh, donas! No te importa si yo...

source: Extra Cream
es: Extra Crema

source: Too much of a good thing is still a good thing!
es: ¡Mucho de algo bueno sigue siendo algo bueno!

source: Fat Stacks
es: Montones Gordos

source: Stack 'em up, we have customers to serve!
es: ¡Amontónalos, tenemos clientes que servir!

source: Fruit on the Top
es: Con Fruta Arriba

source: Fruit Salad
es: Ensalada de Fruta

source: Garbage Disposal
es: Trituradora de Basura

source: Hungry Moles
es: Topos Hambrientos

source: It's Nibbler
es: Es Nibbler

source: Aww, they take such tiny bites. ...Oww! My finger!
es: Aww, come de a bocaditos. ...¡Oww! ¡Mi dedo!

source: It's Square to be Square
es: Bocados Helados Cuadrados

source: It's Tee Time
es: Hora del té

source: Augh, bread overload! And half the end pieces are missing...
es: ¡Uff, sobrecarga de pan! Y muchas mitades están perdidas...

source: Just Bread
es: Solo Pan

source: No jam. No butter. Just anger!
es: Sin mermelada. Sin manteca. ¡Solo enojo!

source: Just Cream
es: Solo Crema

source: What are these pieces!? LOLOLOL
es: ¿¡Qué son estas piezas!? LOLOLOL

source: Just Fruit
es: Solo Fruta

source: Do we really need a recipe?
es: ¿En serio necesitamos esta receta?

source: Left Shark
es: Tiburón a la Izquierda

source: Fins to the left, pentominos to the right. And no tetrominos in sight!
es: Aletas en la izquierda, pentominós en la derecha. !Y no hay tetrominós a la vista!

source: Lo kCal
es: Bajo En Calorías

source: Can you scrape together ¥100 on veggies alone?
es: ¿Puedes juntar ¥100 solamente con vegetales?

source: Midnight Snack
es: Snack de Medianoche

source: We already turned the lights off! Come back tomorrow.
es: ¡Ya apagamos las luces! Vuelva mañana.

source: Mole Money Mole Problems
es: Más Topos Más Problemas

source: This cave isn't big enough for the eight of us...
es: Esta cueva no es lo suficientemente grande para los ocho...

source: Moonshower
es: Lluvia de Luna

source: It's pretty when all the stars are out.
es: Es hermoso cuando se pueden ver las estrellas.

source: Mozzarella Sticks
es: Palitos de Mozzarella

source: Speak softly and eat a big mozzarella stick.
es: De tal palo, tal mozzarella.

source: Your New Onion Friend
es: Tu Nuevo Amigo Cebolla

source: Who could ever say no to a new friend?
es: ¿Quién se puede negar a un nuevo amigo?

source: Nice and Cheesy
es: Que Es Eso

source: Let's learn to cook with cheese!
es: ¡Eso es queso!

source: No Smoking Section
es: Sector No Fumador

source: Carrot smoke is the healthiest kind of smoke! But, we still don't like it very much.
es: ¡El humo de zanahoria es el más sano que hay! Pero, todavía no nos gusta mucho.

source: Nowhere To Turn
es: Sin Vueltas

source: You really can't turn the pieces? I think there might be a way...
es: ¿No puedes girar las piezas? Tiene que existir alguna manera...

source: One Shark Two Shark Red Shark Blue Shark
es: Ahí Está El Tiburón, Ahí Está El Tiburón

source: Why do sharks smell so good? ...Is it because they are always in the bath?
es: ¡No pares (De darles de comer), sigue, sigue! ¡No pares (De darles de comer), sigue, sigue!

source: One Step Ahead
es: Un Paso Adelante

source: It's easy if you make a plan.
es: Es fácil si haces un plan.

source: Paranormal Tetrominon
es: Actividad Tetranormal

source: A visit from some familiar friends.
es: Una visita de algunos amigos familiares.

source: Perfect Fit
es: Encaje Perfecto

source: This is my hole! It was made for me!
es: ¡Este es mi agujero! ¡Está hecho para mi!

source: Real Meal
es: Comida de Verdad

source: If you're going to indulge, you may as well make it worth it!
es: ¡Si vas a satisfacer, haz que valga la pena!

source: Rice Bear Island
es: Isla Flan Tan Té

source: What on earth is a rice bear? ...This just seems like a regular island.
es: ¿Qué se supone que es un flan tan té? ...Esto parece una isla cualquiera.

source: Secret Brownies
es: Brownies Secretos

source: Serving On A Rocket
es: Sirviendo En Un Cohete

source: Time for flying rockets. Let's serve up some delicious treats!
es: Hora de cohetes voladores. ¡Sirvamos algunos deliciosos dulces!

source: Shark Bait
es: Carnada de Tiburón

source: This is almost TOO easy! ...Is there a trick?
es: ¡Esto es MUY fácil! ...¿Hay una trampa?

source: Sharky Cheese
es: Con Tiburones Es Más Fácil

source: Sharks never struggle with downstacking! They just eat everything...
es: ¡Con tiburones es fácil limpiar líneas! Ellos solo se comen todo...

source: Sharp Curds
es: Dulzura Cerrada

source: Dig efficiently to turn up some high-scoring snacks!
es: ¡Excava eficientemente para conseguir un puntaje muy alto!

source: Shelf
es: Estante

source: Who came up with this stupid shelf anyway!? ...Ooh! Cookies!
es: ¿¡Pero a quién se le ocurrió poner este estúpido estante aquí!? ...¡Ooh, galletitas!

source: Shoots and Leaves
es: Estragos de Espárragos
