Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: So that was an awfully big coincidence...
es: Eso fue una rara y gran coincidencia...

source: Opening our new restaurant in the PERFECT location to attract a huge untapped influx of customers.
es: Abrimos un nuevo restaurante en el lugar PERFECTO para atraer una gran oleada de clientes.

source: But isn't it short-sighted for us to leave so suddenly?
es: ¿No es un poco apresurado irnos tan rápido?

source: Mmm? I don't follow.
es: ¿Mmm? No te entiendo.

source: What happens next week?
es: ¿Qué pasará la próxima semana?

source: What about our staff?
es: ¿Y nuestro personal?

source: What about our customers?
es: ¿Y nuestros clientes?

source: What happens next week, when Desert Q is over?
es: ¿Qué pasará la próxima semana, cuando la Ola del Desierto termine?

source: Oh, you don't need to worry about that kind of stuff.
es: Oh, no te preocupes con ese tipo de cosas.

source: Next week's problems are next week's problems.
es: Los problemas de la próxima semana con los problemas de la próxima semana.

source: What about our staff, Who's going to run the restaurant?
es: ¿Y nuestro personal? ¿Quién va a dirigir el restaurante?

source: I hired someone to fill in while we're gone, probably. I don't remember.
es: Contraté a alguien para que trabaje mientras no estemos. Probablemente. No recuerdo.

source: What about our customers, won't they stop coming eventually?
es: ¿Qué pasará con nuestros clientes? ¿No dejarán de ir eventualmente?

source: Who needs customers anyways? Customers, shmustomers.
es: ¿Quién necesita clientes? Clientes, más bien dependientes.

source: I see... Well that takes care of every possible loose end! Everything worked out perfectly.
es: Ya veo... ¡Con eso ya atamos cualquier cabo suelto! Todo lo demás salió perfecto.

source: Yes yes. Everything seemed to just fall into place didn't it?
es: Sí sí. Parece que todo encajó en su lugar, ¿no es así?

source: Did you even know about Desert Q before our first day there?
es: ¿Sabías que existía la Ola de Desierto antes de que lleguemos?

source: Oh! Umm. Yes? Maybe. ...My motives are umm... complex. Mwahha ha ha ha~
es: ¡Oh! Umm. ¿Sí? Tal vez. ...Mis motivos son muy umm... complejos. Jaja, jajaja~

source: Your motives sound like you're throwing a dart at a map.
es: Tus motivos suenan como tirar un dardo a un mapa.

source: My motives are more complex than THAT! And besides, darts are scary and pointy...
es: ¡Mis motivos son más complejos que ESO! Aparte, los dardos dan miedo y son puntiagudos...

source: M-hm. Sure. So where did the dart land this time?
es: Sí, como digas. Entonces. ¿Dónde cayó el dardo esta vez?

source: Ah, just a delicious destination called the "Flan Islands"
es: Ah, un destino delicioso llamado "Islas Flan"

source: Oooh, that sounds nice!
es: ¡Oh, eso suena lindo!

source: Wait... no... Not the "Flan Islands"... the "Kflab Islands". Hmph. Stupid autocorrect!
es: Espera... No... No las "Islas Flan"... Las "Islas Kflab". Hmph. ¡Estúpido auto corrector!

source: ...So you were saying about your complex motives?
es: ¿Qué estabas diciendo sobre tus motivos complejos?

source: I mean, I ummm... I autocorrected it on purpose! Mwahha ha ha ha ha... ...
es: O sea, yo ummm... ¡Usé el auto corrector a propósito! Muajajajaja... ...

source: ...Oh, whatever.
es: ...Oh, como sea.

source: I heard someone say you'll save our place in line. Is that true?
es: Escuché de alguien que ustedes pueden guardarnos lugares en la fila. ¿Es cierto?

source: Yes, yes, #player# would be happy to shave your faceless swine.
es: Sí, sí, a #player# le encantaría afeitar a tu cerdo sin cara.

source: Wait, what!? That's not what I -
es: Espera ¿¡Qué!? Eso no es lo que -

source: #player#, can you handle this? There are three tables which need my attention.
es: #player#, ¿puedes ocuparte de esto? Hay tres mesas que necesitan mi atención.

source: Why are we so busy all of a sudden!? This was supposed to be a desert.
es: ¿¡Por qué hay tantos clientes de repente!? Se supone que esto es un desierto.

source: ...So, umm... did you hear my question?
es: ...Entonces, umm... ¿Escuchaste mi pregunta?

source: Yes, we'll do that
es: Sí, nosotros hacemos eso

source: No, we won't do that
es: No, nosotros no hacemos eso

source: Lead me to the swine
es: Solo apunta al cerdo

source: A table just opened up
es: Una mesa se liberó

source: Lead me to the swine!
es: ¡Solo apunta al cerdo!

source: That's... that's incredibly rude.
es: Eso es... Eso es muy grosero.

source: We might have a table that just opened up! If you don't mind sitting on someone else's cheek-prints...
es: ¡Podríamos tener una mesa que acaba de liberarse! Si no te importa que compartir la misma silla...

source: Umm... thanks, I guess...
es: Umm... Gracias, supongo...

source: I can tell you with utmost honesty that nobody will save your place in line.
es: Puedo decirte con la máxima honestidad que nadie va a guardarte un lugar en la fila.

source: But if you're lucky, you won't remember asking us? So it's sort of win/win.
es: Pero si tienes suerte, ¿puede que no recuerdes preguntarnos? Es como un ganar-ganar.

source: Yes, we'll save your place. ...But, sometimes the people in line won't believe you!
es: Sí, te guardamos el lugar en la fila. Pero, ¡a veces la gente no nos cree!

source: You might have to assertively force your way in and be rude to them after your meal.
es: Así que a veces usamos la fuerza asertivamente para empujarte a un lugar en la fila después de comer.

source: Look at all these customers!
es: ¡Mira todos estos clientes!

source: Wow! That line goes on forever.
es: ¡Wow! No se ve el fin de la cola.

source: Ahha ha ha. Remember when you complained that this place was "literally deserted?"
es: Jajaja. Recuerdas cuando te quejaste de que este lugar era un "literal desierto"?

source: I guess you feel pretty silly about that now.
es: Que bueno que el proyecto del desierto fue un gran acierto.

source: It WAS deserted
es: Agrupamiento

source: It IS desert-ed
es: Acepto

source: It IS dessert-ed
es: Divierto

source: I was wrong
es: Concierto

source: It WAS literally deserted, I wasn't wrong! It just became... less deserted since then.
es: Pero ahora hay mucho agrupamiento, con apartamentos y hasta aeropuertos.

source: That's an understatement! You're going to have to learn to cook faster.
es: Sí, me impresionó qué rápido construyeron todo esto.

source: If I cook faster, won't I be making it even MORE deserted?
es: El asentamiento de aposentos fue un completo afloramiento.

source: Hmm?
es: #player#, ¿puedes parar con las rimas malas?

source: You know... Because of all the new DESSERTS! Get it? Dessert-ed?
es: Me divierto con mi conocimiento sobre cubiertos.

source: It IS literally desert-ed! Think about it.
es: Acepto el aumento de almuerzos.

source: It's literally deserted, because we're LITERALLY in a desert. ...That's what literally is SUPPOSED to mean.
es: Recuerdo y acepto mi desconcierto.

source: Oh phew, I thought you meant like... "Dessert-ed", as in... ...
es: En serio, no me divierto con tus inexpertos... Espera...

source: Well if you think about it... It is literally dessert-ed!
es: Me divierto, ¡qué experto el dueño del emprendimiento!

source: You know... Because of all of our DESSERTS! Get it? Dessert-ed?
es: ¡Tu conocimiento me dejó boquiabierto, lo acepto!

source: I was wrong...
es: Recuerdo que Gilberto prometió un concierto...

source: Yes yes, don't feel bad. At some point, everybody but me is wrong. You'll get used to it~
es: Sí sí, no te sientas mal, eso fue hace meses.

source: But anyways, it is still literally deserted.
es: Que desconcierto el supuesto concierto, ¡que inexpertos!

source: Oh... Oh no. Desserts? Dessert QUEUE!?! What have I done!!
es: Oh... Oh no, ¿es contagioso? ¡No se qué hacer!

source: I'm going to be sick
es: Estoy enfermo

source: Don't feel bad
es: Solo fue un chiste

source: That's pretty funny
es: Fue divertido

source: You're right, it is a dessert queue! That's pretty funny~
es: ¡Por favor! Este local pasó por muchos chistes malos, un poco de rimas no hacen mal~

source: It's not funny, it's terrible. Horrifying! ...And... the pun was right there the whole time!?
es: Tienes razón, y es terrible. ¡Muchos chistes malos! ...Y... ¿¡Y ahora rimas!?

source: How many people did I put in danger through my... my unthinkable negligence? There were families. Children!!!
es: Imagínate qué pasaría en un futuro. ¡Musicales improvisados! Oh no, las familias que puedo arruinar. ¡¡Hay que pensar en los niños!!

source: Oh lighten up, Fat Sensei.
es: Oh, Fat Sensei, estás exagerando... Y mucho.

source: ...I'm afraid we need to shut down this location.
es: ...Me temo que necesitamos cerrar esta sucursal.

source: Eughhh, I think I'm going to be sick...
es: Eughhh, creo que estoy enfermo...

source: This is terrible. Horrifying! ...And... the pun was right there the whole time!?
es: Esto es terrible. Primero, muchos chistes malos, ¿y ahora rimas? ¿Qué siguen, musicales improvisados? ¡Oh no, los niños!

source: So many lives ruined...
es: ¡Alguien tiene que pensar en los niños!...

source: I'm afraid we need to burn down this location.
es: Me temo que necesitamos quemar esta sucursal.

source: It's for the best. I'll forge the necessary insurance paperwork...
es: Será lo mejor. Antes, voy a llenar los papeles necesarios para conseguir un seguro...

source: Oops! Well, umm... this sort of thing could happen to anyone. Don't feel bad about it...
es: Fat sensei, recuerda que este local pasó por muchos chistes malos, no creí que un chiste más te iba a afectar tanto...

source: Don't feel BAD about it!? This is terrible. Horrifying! ...And... the pun was right there the whole time!?
es: ¿¡Que no me afectaría!? ¡Los clientes acá solo cuentan chistes malos, y no estoy de humor para rimas incluso aún más malas!

source: So tell me more about this... Desert Q festival?
es: Así que, dime más sobre este... ¿Festival de la Ola del Desierto?

source: Aww man, Desert Q's not just a festival! It's a gathering of minds!
es: ¡Pero qué! ¡La ola del Desierto no es solo un festival! ¡Es una reunión de mentes!

source: The world's greatest creatives, all celebrating the spirit of Desert Q!
es: ¡Las mentes creativas más grandes del mundo celebrando el espíritu de la Ola del Desierto!

source: Desert Q!
es: ¡Ola del Desierto!

source: Yes but... What are you celebrating exactly? ...And how do you celebrate it?
es: Sí, pero... ¿Qué están celebrando exactamente? ...¿Y cómo lo celebran?

source: Pshh we're celebrating the spirit of the greatest minds! All gathering in the desert for seven days! C'mon.
es: Pshh, ¡Estamos celebrando el espíritu con las mentes más grandes! ¡Todos reunidos en el desierto por siete días! Entiéndelo.

source: Are there... bands? Or events?
es: Sí, pero hay... ¿Bandas? ¿O algún evento?

source: This isn't just like, some dumb concert here! It's the world's GREATEST minds we're talking about!
es: ¡Esto no es un tonto concierto! ¡Estamos hablando de las mentes MAS GRANDE del mundo!

source: We gather and umm... Like have you seen the line? It's a REALLY big line!
es: Nos reunimos y, umm... ¿Viste la cantidad de gente que hay esperando? ¡De verdad hay mucha gente!

source: Wait a minute Dreadhark, look outside! I think we lost our place!
es: Espera un momento Dreadhark, ¡Mira afuera! ¡Creo que perdimos nuestro lugar!

source: Aww what! Desert Q!!!
es: ¡Pero qué! ¡¡¡Ola del Desierto!!!

source: Desert Q!!!
es: ¡¡¡Ola del Desierto!!!

source: ...Umm! ...Tell your friends about us!?
es: ...¡Ummm! ...¿¡Cuéntenles a sus amigos sobre nosotros!?

source: What the heck!? Where did all these people come from!
es: ¿¡Pero qué...!? ¡De dónde salió toda esta gente!

source: Clearly they're here for... 'Desert Q'?
es: Claramente están acá por... ¿Ola del Desierto?

source: What's Desert Q? Some kind of big festival?
es: ¿Qué es la Ola del Desierto? ¿Alguna especie de festival?

source: This is your first Desert Q!? Well, think of it as a seven-day celebration with the world's greatest creatives...
es: ¿¡Es tu primera Ola del Desierto!? Bueno, es como una celebración de siete días con las grandes mentes creativas de todo el mundo...

source: A special gathering where we can all get together and celebrate the spirit of Desert Q!
es: ¡Una reunión especial donde todos podemos celebrar el espíritu de la Ola del Desierto!

source: Mmmm... can we get you something to eat while you wait?
es: Mmmm... ¿Podemos ofrecerte algo de comer mientras esperas?

source: Heck yeah let's grub up! Desert Q!!!
es: ¡Por supuesto, vamos a comer! ¡¡¡Ola del Desierto!!!

source: Desert Q! That's what I'm talkin' about.
es: ¡Ola del Desierto! A eso me refería.

source: Fat Sensei and #player# arrived at their new location in Poki Desert, ready to start their first day, but...
es: Fat Sensei y #player# llegaron a su nueva ubicación en Desierto Poki, listos para comenzar su primer día, pero...

source: Wait, THIS is Poki Desert!?
es: Espera, ¿¡ESTO es Desierto Poki!?

source: When you said 'desert' I assumed you meant 'Hot Place With People In It'... This place is literally deserted!
es: Cuando dijiste "desierto", yo asumí que decías "lugar caliente con gente"... ¡Este lugar es literalmente desierto!

source: Oh come now. LITERALLY deserted?
es: Oh vamos. ¿LITERALMENTE desierto?

source: Yes. LITERALLY DESERTED. There are NO people.
es: Sí. LITERALMENTE DESIERTO. Acá hay CERO personas.

source: Hmph, well WE'RE here, aren't we?
es: Hmph, NOSOTROS estamos aquí, ¿no es cierto?

source: You don't count as a person
es: Tú no cuentas como persona

source: Your pedantry is ever-helpful
es: Tu sabiduría es muy útil

source: Yay, our problems are solved
es: Yay, nuestros problemas están resueltos

source: You're right, our problems are solved! ...Are you hungry?
es: Tienes razón, ¡Nuestros problemas están resueltos! ...¿Tienes hambre?

source: Oh you don't count as a person. I was talking about customers! Unless... I don't suppose you're hungry?
es: Oh, tú no cuentas como una persona. ¡Aparte estaba hablando sobre clientes! A menos que... ¿tengas hambre?

source: Your pedantry is ever-helpful. I'm forever in debt to your priceless advice.
es: Tu sabiduría es muy útil. Estoy en deuda por tu infinita sabiduría y útiles consejos.

source: ...With that said, we still need customers. I don't suppose you're hungry?
es: ...Con eso dicho, todavía necesitamos clientes. ¿Tienes hambre?

source: Not really...
es: La verdad, no...

source: Wow! That's a big cactus.
es: ¡Wow! Ese es un cactus grande.

source: Don't change the subject!
es: ¡No cambies de tema!

source: That went pretty smoothly!
es: ¡Eso salió muy bien!

source: Mhm, it seems they've sort of got a handle on things around here. I suppose they could use a LITTLE extra help.
es: Sí, parece que ya tienen todo dominado por ahí. Aunque supongo que podríamos ofrecer un POQUITO de ayuda extra.

source: Not too much extra help but hmm...
es: No tanta ayuda, a ver, hmm...

source: How about you, Bart? You seem nonremarkable. Do you want to help out in the kitchen?
es: Bart, ¿y qué tal tú? Te vez como alguien no significante. ¿Necesitas ayuda en la cocina?

source: Hm. Kitchens, kitchens. ...Are there knives?
es: Hm. Cocina, cocina. ...¿Hay cuchillos?

source: I don't like when knives are left sitting around. I'm always nervous I'll get Final Destinationed.
es: No me gusta cuando hay cuchillos al rededor. Me pongo nervioso por si pasa como en Destino Final.

source: I mean... if Bart doesn't want to do it I'll do it! I can be unremarkable. Or I guess, "NON-remarkable"!
es: Pero bueno... Si Bart no quiere, ¡entonces yo puedo hacer! Puedo ser no significante. ¡O mejor dicho, "IN-significante"!

source: Nonremarkable? Oh you've already made quite a mark Alyssa.
es: ¿Insignificante? Creo que fuiste muy significante hasta ahora, Alyssa.

source: There was that time you called us rude for leaving during a council meeting! Or just now when you highlighted my poor grammar.
es: ¡De seguro te acuerdas cuando nos llamaste descortés en la reunión del consejo! Y ahora tienes que resaltar my gramática mala.

source: Your... your poor grammar? Oh come on, that's unfair! I didn't mean anything by it, I just didn't realize you had such thin skin.
es: ¿Tu... Tu gramática mala? ¡Pero eso no es justo! No tenía la intención de molestarte, no sabía que eras tan sensible.

source: Mhm mhm. I'm rude, with poor grammar, and unfair, and thin skinned. Did I miss any?
es: Mhm mhm. Soy descortés, mi gramática es mala, soy injusto y muy sensible. ¿Algo más?

source: Don't... Are you trying to memorize this? Please don't make a list!!!
es: Pero... ¿Estás tratando de memorizar todo esto? ¡¡¡Por favor, no hagas una lista!!!

source: Hey #player#! ...Just checking in on the business. Everything going alright?
es: ¡Hola #player#! ...Solo quería ver como va el negocio. ¿Cómo les está yendo?

source: It's great
es: Muy bien

source: It's so-so
es: Más o menos

source: It's a struggle
es: Es una lucha

source: Everything's going great in the kitchen! There's only a few customers, though...
es: ¡En la cocina nos está yendo bien! Solo que hay muy pocos clientes...

source: Hmm it's going fine, I guess! But there's only a few customers...
es: Hmm, ¡bien, supongo! Solo que hay muy pocos clientes...

source: Oh, we're struggling a little bit. There's only a few customers...
es: Oh, es una lucha. Es que hay muy pocos clientes...

source: Ah yes, it's just a steady trickle of customers. But at least it's better than no customers at all!
es: Ah sí, solo es una pizca de clientes. ¡Pero al menos es mejor que ningún cliente!

source: Hmm I see. So you'll probably be stuck with this 'steady trickle' thing for a while?
es: Hmm, ya veo. ¿Entonces te vas a quedar con esta "pizca" de clientes por mucho tiempo?

source: Oh it should pick up once word spreads! Any minute now.
es: ¡Oh, debería aumentar la clientela cuando sepan de nosotros! En cualquier minuto.

source: Oh that's cool.
es: Oh, que bien.

source: Sooooo how much longer is this gonna take? I have a date with a tennis player –
es: Entonces... ¿Cuánto más va a tardar? Tengo una cita con un jugador de tenis –

source: Well I can't do it if you're watching!
es: ¡No lo puedo hacer si me estás mirando!

source: Hurry up! I'm still hungry!!!
es: ¡Rápido! ¡¡¡Todavía tengo hambre!!!

source: You sure you're getting all this, Bart?
es: ¿Estás seguro que entendiste todo esto, Bart?

source: Yeah well, it seems simple. I mean cooking's just applied chemistry...
es: Sí, bueno, parece simple. O sea, cocinar es solo química aplicada...

source: ...And chemistry is just applied physics, which is just well, common sense.
es: ...Y química es solo física aplicada, que es solamente sentido común.

source: The only hard part for me is recognizing which people are sitting where.
es: La única parte difícil para mi es reconocer donde se sienta la gente.

source: I should have been more open about this up front, but I think I might be mildly faceblind.
es: Creo que debí de ser más abierto sobre esto, pero creo que tengo algo de ceguera facial.

source: You're not FACEBLIND, you just never LOOK at people!
es: ¡No tienes CEGUERA FACIAL, solo que nunca MIRAS a la gente!

source: Ha. An interesting segue... Is someone blind if they keep their eyes closed all the time?
es: Ah. Un seguimiento interesante... ¿Es alguien ciego si siempre mantuvo sus ojos cerrados?

source: Yes, definitely
es: Sí, por supuesto

source: Hmm, maybe
es: Hmm, tal vez

source: No, not really
es: No, no realmente

source: No, not at all
es: No, para nada

source: Yeah, that makes sense! ...If they can't see, they're blind. If their eyes are closed, that still counts.
es: ¡Sí, tiene sentido! ...Si no pueden ver, son ciegos. Si mantienen sus ojos cerrados, eso también cuenta.

source: Hmm kind of. I mean their eyes still work, they're just not using them. I guess they're kind of blind.
es: Hmm, casi. Si sus ojos funcionan y ellos deciden simplemente no usarlos, entonces serían ciegos, supongo.

source: Ohh they're not technically blind if their eyes still work. I don't think you can use that word.
es: Ohh, no son técnicamente ciegos si pueden ver con sus ojos. No creo que puedas usar esa palabra en ese escenario.

source: No, they're definitely not blind! Blindness is a medical thing, you can't use the word that way.
es: ¡No, definitivamente no son ciegos! La ceguera es una cosa médica, y no puedes usar esa palabra de esa forma.

source: You mean... If they just CHOOSE to keep their eyes closed? No they're not blind. They're just a MORON!
es: ¿Si ellos ELIGEN mantener sus ojos cerrados? No son ciegos, ¡Solo son unos IMBÉCILES!

source: Haha. "Moron". Touche I guess. Well, let's just call my condition selective faceblindness for now.
es: Jaja. "Imbéciles". Touché, supongo. Bueno, creo que por ahora podrías decir que tengo ceguera facial selectiva.

source: Anyway King Frungle Lumps III, your food is almost done.
es: Como sea, King Frungle Lumps III, tu comida está casi lista.

source: I'm going to plate it, and then take it to that other person over there.
es: La voy a poner en un plato, y se la voy a llevar a la persona que está por allá.

source: What!? They look nothing like me!! ...You really ARE face blind!
es: ¿¡Qué!? ¡¡No se parece en nada a mí!! ...¡De verdad tienes ceguera facial!

source: Nope, this one's for spite.
es: Nope, esto es por despecho.

source: Oh hey Alyssa! How'd your date go with the tennis player?
es: ¡Oh, hola Alyssa! ¿Cómo te fue con tu cita con el jugador de tenis?

source: Ohhhh you know how it goes. They're nice enough and all, but nobody wants to commit to commit, if that makes sense.
es: Ohhh, ya sabes. Estuvo todo bien y eso, pero no se comprometen a comprometerse, si eso tiene sentido.

source: Ahh yes, that's the problem with tennis players. Love means nothing to them.
es: Ahh sí, es el problema con los jugadores de tenis. El amor no significa nada para ellos.

source: Anyway, I'm sort of surprised you ended up here of all places.
es: Como sea, estoy sorprendido que, de todos los lugares, termines aquí.

source: I thought you'd be way too popular for a dumpy place like this, #player#!
es: ¡Pensé que eras más popular para un basurero como este, #player#!

source: You mean this island?
es: ¿Te refieres a la isla?

source: You mean this restaurant?
es: ¿Te refieres al restaurante?

source: You mean Fat Sensei?
es: ¿Te refieres a Fat Sensei?

source: A dumpy place like this? ...Are you talking about this island?
es: ¿Un basurero como este? ...¿Estás hablando de la isla?

source: Well yeah I mean what's here? You've got four nerds in a big banana. A popular chef like you, well-
es: Bueno, sí, me refiero a, ¿qué hay aquí? Tenemos cuatro nerds en una gran banana. Un chef popular como tú, bueno-

source: -I figured you'd be hitting bigger cities with wealthier clientele, things like that.
es: -Te imaginaba en una gran ciudad con una clientela razonable, cosas como esas.

source: A popular chef like me? ...Wait since when am I popular? I'm honestly surprised you've even heard of me.
es: ¿Un chef popular como yo? ...Espera, ¿desde cuándo soy popular? Honestamente estoy sorprendido que hayas escuchado acerca de mi.

source: A dumpy place like this? ...Are you talking about this restaurant?
es: ¿Un basurero como este? ...¿Estás hablando del restaurante?

source: What!? No!
es: ¿¡Qué!? ¡No!

source: Wow Alyssa! Turbo Fat? Dumpy?? ...That's an incredibly brash statement.
es: ¡Wow Alyssa! ¿¿Turbo Fat un basurero?? ...Lo que dijiste es algo muy feo.

source: Yeah, and since when am I popular? I'm honestly surprised you've even heard of me.
es: Sí, ¿y desde cuándo soy popular? Honestamente estoy sorprendido que hayas escuchado acerca de mi.
