Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: Not again! ...Can you clean this up using squish moves? Try to clear three lines.
es: ¡No otra vez! ...¿Puedes limpiar esto aplastando piezas? Intenta limpiar tres líneas.

source: Oops! Look at the mess you made. ...Can you clean this up using squish moves? Try to clear three lines.
es: ¡Ay! Mira este lío que hiciste. ...¿Puedes limpiar esto aplastando piezas? Intenta limpiar tres líneas.

source: Oh no, it keeps happening! Well, try to clear three lines. Remember your squish moves!
es: ¡Oh no, sigue sucediendo! Bueno, intenta limpiar tres líneas. ¡Recuerda aplastar piezas!

source: Oh no! Now you've done it. Look at how clumsy you are!
es: ¡Oh no! Mira lo que hiciste. ¡Mira lo torpe que eres!

source: That's okay. I'm sure you'll think of a clever way to clean this up, too.
es: Está bien. Estoy seguro que también vas a pensar una forma inteligente de limpiar esto.

source: Press again to exit
es: Tocar otra vez para salir

source: Today's Best
es: Mejor de Hoy

source: Click again to exit
es: Click otra vez para salir

source: All-time Best
es: Mejor de Todos

source: Just getting started
es: Acabamos de comenzar

source: Play this level in Career mode to unlock it!
es: ¡Juega este nivel en el modo Carrera para desbloquearlo!

source: Unknown
es: Desconocido

source: Very Easy
es: Muy Fácil

source: Easy
es: Fácil

source: Hard
es: Difícil

source: Very Hard
es: Muy Difícil

source: Expert
es: Experto

source: Very Expert
es: Muy Experto

source: Difficulty: %s
es: Dificultad: %s

source: Duration: %s
es: Duración: %s

source: New: %s
es: Nuevo: %s

source: Top: %s
es: Mejor: %s

source: Well, crap
es: Bueno, mierda

source: Play
es: Jugar

source: Stress Test
es: Prueba de Estrés

source: Level Select
es: Selección de Nivel

source: Credits
es: Créditos

source: Level
es: Nivel

source: Score 200 points as quickly as possible!
es: ¡Obtén 200 puntos lo más rápido posible!

source: Speed
es: Velocidad

source: So... I had some kind of problem loading your save data. Unfortunately, none of the backups worked either, so I don't really know how to fix it.
es: Este... Tuve unos problemas en cargar los datos de tu partida. Desafortunadamente, ninguna de tus copias de respaldo funcionan, así que no se cómo arreglarlo.

source: So... I had some kind of problem loading your save data, which means you're going to lose some progress.
es: Este... Tuve unos problemas en cargar los datos de tu partida, lo que significa que perderás algo de progreso.

source: There was a backup, so at least you'll only lose the last half-hour or so.
es: Hay una copia de respaldo, así que solo vas a perder el progreso de la última media hora, más o menos.

source: There was a backup, so at least you'll only lose the last hour or so.
es: Hay una copia de respaldo, así que solo vas a perder el progreso de la última hora, más o menos.

source: There was a backup, but you'll lose everything from the last few hours.
es: Hay una copia de respaldo, pero vas a perder el progreso lo de las últimas horas.

source: There was a backup, but you'll lose everything from the last day or so.
es: Hay una copia de respaldo, pero vas a perder el progreso de los últimos días, más o menos.

source: There was a backup, but it was pretty old. You'll lose everything from the last few days.
es: Hay una copia de respaldo, pero es algo vieja. Vas a perder el progreso de algunos días.

source: There was a backup, but it was very old. You'll lose everything from the last week or so.
es: Hay una copia de respaldo, pero es algo vieja. Vas a perder el progreso de la última semana, más o menos.

source: The invalid save data is available in the following path: %s (%s)
es: Los datos inválidos están disponibles en la siguiente ruta: %s (%s)

source: I'm really sorry.
es: Lo lamento mucho.

source: Advance further into career mode to unlock new areas!
es: ¡Avanza más en el modo Carrera para desbloquear nuevas areas!

source: Overall grade: %s
es: Grado General: %s

source: Promotion to %s: %.1f%%
es: Promoción a %s: %.1f%%

source: Total stars: %s
es: Estrellas Totales: %s

source: Completion: %.1f%%
es: Completado: %.1f%%

source: Replay this chapter to continue your adventure!
es: ¡Vuelve a jugar este capítulo para continuar tu aventura!

source: Clear every level to get to 100%!
es: ¡Termina todos los niveles para tener el 100%!

source: Overall rank: %s
es: Rango General: %s

source: Sound + Music
es: Sonido + Música

source: Graphics
es: Gráficos

source: Fullscreen
es: Pantalla Completa

source: Use Vsync
es: Usar Vsync

source: Creature detail
es: Detalle de Criatura

source: Feeding Animation
es: Animación al Comer

source: Ghost Piece
es: Pieza Fantasma

source: Soft Drop Lock Cancel
es: Cancelar Asegurado con Caída Lenta

source: Cheats
es: Trucos

source: Line Piece
es: Pieza Larga

source: Hold Piece
es: Sostener Pieza

source: Reset to Default
es: Por Defecto

source: Guideline
es: General

source: Custom
es: Personalizar

source: Move Piece
es: Mover Pieza

source: Left, Right
es: Izquierda, Derecha

source: Space, Up, Shift
es: Espacio, Arriba, Shift

source: Rotate Piece
es: Rotar Pieza

source: Swap Hold Piece
es: Intercambiar Pieza Sostenida

source: Move in Menus
es: Mover en Menú

source: Arrows, WASD
es: Flechas, WASD

source: Confirm in Menus
es: Confirmar en Menú

source: Back in Menus
es: Volver en Menú

source: Rewind Text
es: Rebobinar Texto

source: Move Piece Left
es: Mover Pieza a la Izquierda

source: Move Piece Right
es: Mover Pieza a la Derecha

source: Rotate Ccw
es: Rotar Sentido Contrarreloj

source: Rotate Cw
es: Rotar Sentido Reloj

source: Up in Menus
es: Arriba en Menú

source: Down in Menus
es: Abajo en Menú

source: Left in Menus
es: Izquierda en Menú

source: Right in Menus
es: Derecha en Menú

source: Size
es: Tamaño

source: Scheme
es: Esquema

source: Fat Finger
es: Dedo Gordo

source: Language
es: Lenguaje

source: Save Slot
es: Espacio de Guardado

source: Slot A
es: Espacio A

source: Open User Folder
es: Abrir Carpeta de Usuario

source: Copy to Clipboard
es: Copiar a Portapapeles

source: Copied!
es: ¡Copiado!

source: * Your settings will take effect in the next scene.
es: * Tus cambios tendrán efecto en la siguiente escena.

source: Confirm
es: Confirmar

source: Change save slot?
es: ¿Cambiar espacio de guardado?

source: Music
es: Música

source: Low
es: Bajo

source: High
es: Alto

source: %.1f hours
es: %.1f horas

source: Delete save data?
es: ¿Eliminar datos guardados?

source: Are you sure?
es: ¿Estás seguro?

source: Linear
es: Lineal

source: Bouncy
es: Rebote

source: Slowestest
es: Lentisisísimo

source: Slowest
es: Lentisísimo

source: Slower
es: Lentísimo

source: Slow
es: Lento

source: Default
es: Normal

source: Fast
es: Rápido

source: Faster
es: Rapidísimo

source: Fastest
es: Rapidisísimo

source: Fastestest
es: Rapidisisísimo

source: Save + Quit
es: Guardar + Salir

source: Sound + Graphics
es: Sonido + Gráficos

source: Gameplay
es: Jugabilidad

source: Controls
es: Controles

source: Touch
es: Tocar

source: Miscellaneous
es: Miscelaneo

source: Off
es: Apagado

source: Slim
es: Delgado

source: Plump
es: Regordete

source: Pudge
es: Rechoncho

source: Chonk
es: Gordo

source: Mute
es: Mudo

source: <Enter Key>
es: <Tecla>

source: Left, Right, Kp 4, Kp 6
es: Izquierda, Derecha, Numpad 4, Numpad 6

source: Down, Kp 2
es: Abajo, Numpad 2

source: Space, Up, Kp 8
es: Espacio, Arriba, Numpad 8

source: Space, Up, Kp 8, Shift
es: Espacio, Arriba, Numpad 8, Shift

source: Z, X, Kp 7, Kp 9
es: Z, X, Numpad 7, Numpad 9

source: Shift, C, Kp 0
es: Shift, C, Numpad 0

source: A, D, Kp 4, Kp 6
es: A, D, Numpad 4, Numpad 6

source: S, Kp 8
es: S, Numpad 8

source: W, Kp 5
es: W, Numpad 5

source: W, Kp 5, Kp Enter
es: W, Numpad 5, Numpad Intro

source: Left, Right, Kp 7, Kp 9
es: Izquierda, Derecha, Numpad 7, Numpad 9

source: Shift, Kp Enter
es: Shift, Numpad Intro

source: Bug
es: Error
