Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: ...Rock eggs?
es: ...¿Huevos de piedra?

source: ...Milkweed eggs?
es: ...¿Huevos de leche de alga?

source: We use real eggs.
es: Usamos huevos de verdad.

source: "Real Eggs?" Ohhhhhh so is that sort of like... like the "Impossible Burger" but for eggs?
es: "Huevos de Verdad"? Ohhhhh, es como la... ¿Como la "Hamburguesa Imposible" pero con huevos?

source: Oooh sounds tasty. I'll have that!
es: Ooooh, suena rico. ¡Voy a comer eso!

source: I feel so dirty...
es: Me siento tan sucio...

source: Don't worry. It gets easier every time~
es: No te preocupes. Cada vez se vuelve más fácil~

source: So what's your impression of Desert Q so far?
es: ¿Cuál es tu impresión de la Ola del Desierto hasta ahora?

source: I'm confused
es: Estoy confundido

source: It makes sense
es: Tiene sentido

source: It seems dumb
es: Parece tonta

source: I love it
es: Me encanta

source: It seems sort of... dumb. You just stand around in the desert for 7 days and don't actually do anything.
es: Parece medio... tonta. La gente solo se está parada en el desierto por 7 días sin hacer realmente nada.

source: Heh yeah! You're not alone, When I tell most people about it, they just think it seems dumb.
es: ¡Por supuesto! No estás solo, cuando le cuento a la gente sobre esto, mucha gente cree que esto es tonto.

source: I'm sort of... confused by it. It sounds like you just stand around for 7 days and don't actually do anything.
es: Estoy algo... confundido. Suena que solo se paran por 7 días y no hacen realmente nada.

source: Wait up really? A bunch of people standing in the desert for 7 days, and you're confused by that?
es: Espera, ¿en serio? Un montón de gente parada en el desierto por 7 días, ¿y estás confundido por eso?

source: 'Cause when I tell most people about it, they just think it just seems dumb.
es: Porque cuando le cuento a la gente sobre esto, la gente piensa que esto es tonto.

source: It makes sense to me. You hang out with your friends and do nothing! A big week-long party with no obligations.
es: Tiene sentido para mi. ¡Se reúnen con amigos y hacen nada! Una fiesta de una semana sin obligaciones.

source: Wait up really? A bunch of people standing in the desert doing nothing for 7 days, and that makes sense to you?
es: Espera, ¿en serio? Un montón de gente parada por 7 días, ¿y a eso le encuentras sentido?

source: It's great, I'd love to stand around outside with my friends for an entire week!
es: ¡Es genial, me encantaría estar parado afuera con mis amigos por una semana!

source: Wait up really? A bunch of people standing in the desert doing nothing for 7 days, THAT'S what you aspire to?
es: Espera, ¿en serio? Un montón de gente parada en el desierto haciendo nada por 7 días, ¿y ESO es lo que te inspira?

source: Goris, I'm like a thousand years old so EVERYTHING seems dumb.
es: Goris, yo tengo como mil años, así que TODO parece tonto.

source: But you're not hurting anyone and it seems like you're having fun.
es: Pero no están lastimando a nadie y parece que se están divirtiendo.

source: There comes a time in everyone's life when they're no longer fun enough to be dumb.
es: Después viene un momento en la vida de todos donde uno no es lo suficientemente divertido para ser tonto.

source: A time when you sit in a boring chair every day and you are very boring and you feel very smart.
es: Un momento donde te sientas en tu aburrida silla todos los días y te sientes muy aburrido y muy inteligente.

source: So, if you're still at the age where you're dumb enough to have fun, then well...
es: Así que, si todavía estás en la edad donde eres suficientemente todo para divertirte, entonces...

source: ...I think that in itself is worth celebrating. Go be dumb! Life is too short.
es: ...Creo que eso ya es suficiente como para celebrar. ¡Ve y se un tonto! La vida es corta.

source: Heck yeah thanks!
es: ¡Por supuesto, gracias!

source: Now if you'll pardon me, I'ma go dumb it up with my friends. Peace~
es: Ahora si me perdonas, voy a ser tonto con mis amigos. Paz, hermanos~

source: I'm still confused
es: Todavía estoy confundido

source: Have fun with your dumb friends
es: Diviértete con tus tontos amigos

source: It still makes sense
es: Todavía le encuentro sentido

source: I still love it
es: Todavía me encanta

source: Desert Q does seem dumb! Go have fun with your dumb friends.
es: ¡La Ola del Desierto en serio parece tonta! Ve y diviértete con tus tontos amigos.

source: Whoa! Where did THAT come from!?
es: ¡Whoa! ¿¡De dónde vino ESO?!

source: Whoaaaaaa that was out of line, #player#! You know, words can hurt sometimes.
es: ¡Whoaaaaa, eso fue muy grosero, #player#! Sabes, a veces las palabras pueden herir.

source: But... But I...
es: Pero... Pero yo...

source: Well, I'm still a little confused by it...
es: Bueno, yo todavía sigo confundido...

source: Maaaaaaan you're not supposed to understand it! It's just this dumb thing we all do once a year, ha ha.
es: ¡Pero! ¡Se supone que no debes entenderlo! Es solo una cosa tonta que hacemos una vez al año, jaja.

source: But don't worry about it! Fat Sensei gets it. And you, you got another year to figure it out. Take it easy~
es: ¡Pero no te preocupes! Fat Sensei entiende. En cuanto a ti, tienes un año más para entenderlo. Suerte~

source: Well, it still makes sense to me! I'd love to join you next year.
es: Bueno, ¡todavía tiene sentido para mi! Me encantaría unirme el año que viene.

source: Maaaaaaan it's not supposed to make sense! It's just this dumb thing we all do once a year, ha ha.
es: ¡Pero! ¡No se supone que le encuentres sentido! Es solo una cosa tonta que hacemos una vez al año, jaja.

source: I still love everything about Desert Q! I love the line... And I love the umm...
es: ¡Todavía me encanta todo sobre la Ola del Desierto! Me encanta la fila... Y también el umm...

source: There's just too many things to name! I love them all.
es: ¡Hay muchas cosas que me encantan! Me encanta todo.

source: Maaaaaaan you're not supposed to love it! It's just this dumb thing we all do once a year, ha ha.
es: ¡Pero! ¡No se supone que te encante! Es solo una cosa tonta que hacemos una vez al año, jaja.

source: Sooooo, did everyone enjoy their food?
es: Entonces, ¿disfrutaron de su comida?

source: Mmmmm, yeah that was delicious!
es: ¡Mmmmmm, sí, estuvo delicioso!

source: Soooo good. You can really taste the #vegan_food_1# #vegan_food_2#!
es: Muy bueno. ¡Muy sabroso! Mi nuevo ingrediente favorito: #vegan_food_2# de imitación de #vegan_food_1#!

source: smoke
es: humo

source: nuts
es: Nueces

source: Mmm, yes. W-wait. ...#vegan_food_1.capitalize# #vegan_food_2#?
es: Mmm, sí. E-espera. ...¿#vegan_food_2# de imitación de #vegan_food_1#?

source: It gets easier every time
es: Cada vez se vuelve más fácil

source: I need to be alone
es: Necesito estar solo

source: They pressured me
es: Me presionaron

source: Ha ha ha! Like you said, it gets easier every time...
es: ¡Jajaja! Como dijiste, cada vez se vuelve más fácil...

source: I... I think I need to be alone...
es: Yo... Creo que necesito estar un rato a solas...

source: It's... It's not my fault! ...They pressured me!
es: ¡Es que... No es mi culpa! ...¡Ellos me presionaron!

source: Ooh this fudge blondie looks good! And it doesn't have milk either, right?
es: ¡Ooh, este blondie de chocolate se ve muy bueno! Y esto tampoco tiene leche, ¿no?

source: Well it's not COW milk, it comes from umm...
es: Bueno, no es leche de VACA, es de umm...

source: Grass
es: Pasto

source: Nuts
es: Nueces

source: From nuts!
es: ¡De nueces!

source: Nut... milk?
es: ¿Leche... De nueces?

source: Y-yeah!
es: ¡S-sí!

source: Aww did you say nut milk? I'm allergic to nuts!
es: Aww, ¿dijiste leche de nuez? ¡Soy alérgico a las nueces!

source: N-no these aren't like... REGULAR nuts! These are special nuts made from um...
es: N-no usamos... ¡nueces REGULARES! Usamos una nuez ESPECIAL de um...

source: Fish
es: Pez

source: Goats
es: Cabra

source: Crabs
es: Cangrejo

source: From milkweed!
es: ¡De leche de alga!

source: weed
es: Alga

source: Milk.. weed... milk?
es: ¿Leche... de leche... de alga?

source: Aww did you say weed milk? I'm allergic to weeds!
es: Aww, ¿dijiste leche de alga? ¡Soy alérgico al alga!

source: N-no this isn't like... REGULAR milkweed! These is special milkweed grown from um...
es: N-no usamos... ¡alga REGULAR! Usamos un alga ESPECIAL de um...

source: From rocks!
es: ¡De piedras!

source: rocks
es: Piedras

source: Rock... milk?
es: ¿Leche... de piedras?

source: Aww did you say rock milk? I'm allergic to rocks!
es: Aww, ¿dijiste leche de piedras? ¡Soy alérgico a las piedras!

source: N-no these aren't like... REGULAR rocks! These are special rocks made from um...
es: N-no usamos... ¡piedras REGULARES! Usamos piedras ESPECIALES de um...

source: From pickles!
es: ¡De pickles!

source: Pickle... milk?
es: ¿Leche... de pickles?

source: Aww did you say pickle milk? I'm allergic to pickles!
es: Aww, ¿dijiste leche de pickle? ¡Soy alérgico a los pickles!

source: N-no these aren't like... REGULAR pickles! These are special pickles harvested from um...
es: N-no usamos... ¡pickles REGULARES! Usamos pickles ESPECIALES de um...

source: From grass!
es: ¡De pasto!

source: grass
es: Pasto

source: Grass... milk?
es: ¿Leche... de pasto?

source: Aww did you say grass milk? I'm allergic to grass!
es: Aww, ¿dijiste leche de pasto? ¡Soy alérgico al pasto!

source: N-no these aren't like... REGULAR pickles! This is SPECIAL grass harvested from um...
es: N-no usamos... ¡pasto REGULAR! Usamos pasto ESPECIAL de um...

source: From... goats? Well I mean... imitation goats. Of course.
es: De... ¿cabra? Ya saben... Imitación de cabra. Por supuesto.

source: goat
es: cabra

source: From... smoke? Well I mean... imitation smoke. Of course.
es: De... ¿humo? Ya saben... Imitación de humo. Por supuesto.

source: From... fish? Well I mean... imitation fish. Of course.
es: De... ¿pez? Ya saben... Imitación de pez. Por supuesto.

source: fish
es: pez

source: From... sand? Well I mean... imitation sand. Of course.
es: De... ¿arena? Ya saben... Imitación de arena. Por supuesto.

source: sand
es: arena

source: From... crabs? Well I mean... imitation crabs. Of course.
es: De... ¿cangrejo? Ya saben... Imitación de cangrejo. Por supuesto.

source: crab
es: cangrejo

source: Imitation #vegan_food_1# #vegan_food_2#? Oh that sounds healthy!
es: ¿#vegan_food_2# de imitación de #vegan_food_1#? ¡Oh, eso suena saludable!

source: ...It does? Well, I guess it kind of does...
es: ...¿Sí? Bueno, creo que si lo es...

source: This place is pretty nice! So you two, what, co-own it or something?
es: ¡Ese es un lindo lugar! Ustedes dos, qué, ¿con copropietarios o algo así?

source: Maybe... Who are you anyways?
es: Tal vez... Igualmente, ¿quién eres tú?

source: Oh sorry! I was just curious about your business. I'm Trudy, I handle the only payment system for Desert Q.
es: ¡Oh, perdón! Solo tengo curiosidad sobre el negocio. Soy Trudy, y yo manejo el sistema de pago de la Ola del Desierto.

source: Oh! We've heard about Desert Q...
es: ¡Oh! Escuchamos hablar sobre la Ola del Desierto...

source: Yes, yes -- some kind of... gathering of the greatest minds, something like that?
es: Sí, sí -- una especie de... reunión de las grandes mentes o algo así, ¿no?

source: Heck if I know! I just walk around and act important, and people give me money for doing nothing.
es: ¡Yo que se! Yo solo camino y actúo importante, y la gente me da dinero por hacer nada.

source: It's probably a lot like what you do here! People just show up and give you money, right?
es: ¡Es probablemente como lo que hacen aquí! La gente aparece y les da dinero, ¿no?

source: Well we... USUALLY bring them food... Hint, hint...
es: Bueno, nosotros... USUALMENTE le damos de comer... Guiño, guiño...

source: Hmm hmm, yes, bringing people food. That sounds like way too much work for me! Doing nothing's way easier.
es: Hmm hmm, sí, llevarles comida a la gente. ¡En mi opinión, eso suena como a mucho trabajo! Hacer nada es más fácil.

source: But then I do like the idea of having a building to stay cool in. Do you mind if I open my own business next door?
es: Pero luego pienso y me gusta la idea de tener un lugar para permanecer bajo sombra. ¿Les importa si abro mi propio negocio al lado?

source: Hmph well. It's a free cactus.
es: Hmph, bueno. Es un cactus libre.

source: Wait. What kind of business?
es: Espera. ¿Qué tipo de negocio?

source: Oh hey what are you doing here? No cutsies!
es: Oh, hey. ¿Qué están haciendo aquí? ¡No se cuelen!

source: We were just curious what you and Goris were up to. ...We didn't see you for a few days.
es: Queríamos saber dónde estaban ustedes dos. ...No los vimos por varios días.

source: Well you caught us just in time, my friend!
es: Bueno, ¡Nos agarraste justo a tiempo, mi amigo!

source: We were just enjoying our shining moment at the front before we grabbed a bite to eat.
es: Estábamos disfrutando de nuestro momento al frente de la fila antes de ir por algo de comer.

source: Yeah! Sucks we gotta get out of the desert line though.
es: ¡Sí! Quisiera disfrutar más de la Ola del Desierto, esto es lo mejor.

source: Dude, why you always callin' it a line? You know it's a queue. Desert QUEUE!
es: Ahora que lo pienso, ¿por qué siempre dices Ola del Desierto? Sabes que es una cola. ¡Cola del Desierto!

source: Aww my bad, ha ha! Desert QUEUE!
es: Aww, es cierto, ¡Jaja! ¡Cola del Desierto!

source: Desert QUEUE!?
es: ¿¡Cola del Desierto!?

source: I'm going to kill someone
es: Creo que voy a matar a alguien

source: There's nothing here?
es: ¿Entonces acá no hay nada?

source: Wait... This is the front of the line? There's nothing here!
es: Espera... ¿Este es el frente de la fila? ¡Acá no hay nada!

source: What do you mean there's nothing here? WE'RE here dude!
es: ¿A qué te refieres con eso? ¡NOSOTROS estamos acá!

source: Heck yeah we are!
es: ¡Sí, sí que lo estamos!

source: Wait, it's called desert QUEUE? Like a queue people wait in!?!
es: Espera, ¿se llama COLA del desierto? ¡¿¡Como una cola de espera!?!

source: I... I think I'm going to kill someone.
es: Creo... Creo que voy a matar a alguien.

source: I think this was like... the best Desert Q ever! So many memories...
es: Creo que esta fue... ¡La mejor Ola del Desierto! Cuantas memorias...

source: Getting in line with everyone... Going home... I can't wait for next year! Desert KYUUU!
es: Hacer cola con todos... Volver a casa... ¡No puedo esperar para el próximo año! ¡Ola del Desierto!

source: Desert Q!! Y'know, I heard someone saying there was once a FESTIVAL at the front of the queue.
es: ¡Ola del Desierto! Sabes, hasta escuché que alguien dijo que iba a haber un FESTIVAL al frente de la cola.

source: ...Must have been nice...
es: ...Hubiese estado lindo...

source: ...What if there was a restaurant at the front of the queue?
es: ...¿Y si hubiese un restaurante al frente de la cola?

source: Go on...?
es: Continua...

source: Imagine an ordered set of vertices...
es: Imagina un grupo ordenado de vértices...

source: A certain dining establishment?
es: ¿Un cierto negocio de comida?

source: Our restaurant
es: Nuestro restaurante

source: The term 'queue' is mathematically ambiguous, but let's imagine an ordered set of vertices...
es: El término "cola" es matemáticamente ambiguo, pero imagínense un grupo ordenado de vértices...

source: If the set were ordered by distance, they might converge on a point of interest, a notable location such as...?
es: Si el grupo estuviese ordenado por distancia, y pareciera que convergen a un punto de interés, una ubicación notable, tal es...

source: A certain dining establishment that might come to mind?
es: ¿Un cierto establecimiento de comida no se les viene a la cabeza?

source: ...OUR restaurant?
es: ...¿NUESTRO restaurante?

source: Turbo Fat. They mean Turbo Fat.
es: Turbo Fat. Se refiere a Turbo Fat.

source: I'm following, keep going?
es: Entiendo, continua...

source: If each participant is a point in a directed graph...
es: Si cada participante es un punto de un grafo dirigido...

source: The line could go to...?
es: ¿Esta cola podría ir a...?

source: This could be a line for Turbo Fat
es: Esta podría ser la cola para Turbo Fat

source: Ugh, I give up
es: Ugh, me rindo

source: If each member of the line is a point in a directed graph, we could redirect the graph without moving the points...
es: Si cada miembro de la cola es un punto de un grafo dirigido, podemos redirigir el grafo sin mover los puntos...

source: While the graph would directing its members to an arbitrary location, that arbitrary location could redefined... as...?
es: Mientras que el grafo podría dirigir sus miembros a una ubicación arbitraria, esta ubicación arbitraria podría redefinirse...

source: Riiight...? I think I'm with you?
es: ¿Síiiii...? ¿Creo que te entiendo?

source: You mean like... redirecting a semi-commutative digraph with an arbitrary terminal vertex? ...Keep going, what else?
es: Quieres decir... ¿Redirigir un dígrafo semi-conmutativo con un vértice terminal arbitrario? ...Entiendo, ¿qué más?

source: What if this line could go someplace... more interesting? A certain place to eat?
es: ¿Qué pasaría si la cola iría a un lugar... más interesante? ¿Un lugar específico para comer?

source: What if the line went to Turbo Fat?
es: ¿Y si la cola va a Turbo Fat?

source: I give up. Just... Ask Goris. I think they get it.
es: Me rindo. Solo... pregúntale a Goris. Creo que entendió.

source: Hmm, so I should ask someone... I think I'm with you. ...Keep going, what else?
es: Hmm, entonces debería de preguntar a alguien... Creo que te entiendo. ...Continúa, ¿qué más?

source: Just get everyone to follow me, you idiots...
es: Solo haz que todos me sigan, idiotas...

source: Alright! (claps) Bring it around everyone, the queue's going this way!!
es: ¡Está bien! (aplausos) ¡¡Gente, nos estamos moviendo, la cola se está moviendo para esta dirección!!

source: Fat Sensei, I was just serving those guests and they said Thursday is the last day of Desert Q!
es: Fat Sensei, estaba sirviendo a esos clientes, ¡Y dijeron que el jueves es el último día de la Ola del Desierto!

source: Interesting. ...You know, I was just serving THOSE guests and they said Monday is the Hamburglar's birthday!
es: Interesante. ...Sabes, yo estaba sirviendo a ESOS clientes, ¡y dijeron que el lunes es el cumpleaños de Hamburglar!

source: You don't seem concerned
es: No pareces preocupado

source: We might go out of business
es: Podríamos ir a la quiebra

source: No, that's Wednesday
es: No, eso es el miércoles

source: What? ...The Hamburglar's birthday isn't Monday, it's Wednesday!
es: ¿Qué? ...¡El cumpleaños de Hamburglar no es el lunes, es el miércoles!

source: You... don't seem very concerned.
es: Tú... No te ves muy preocupado.

source: Oh I'm very concerned! That's why I'm double-checking it on the internet...
es: ¡Oh, estoy muy preocupado! Por eso es que estoy confirmando la información en internet...

source: (tap, tap... tap type... swipe...)
es: (tap, tap... tap, escribe... desliza...)

source: We might go out of business... but at least we know the Hamburglar's birthday.
es: Podríamos ir a la quiebra... pero al menos sabemos del cumpleaños de Hamburglar.

source: Oh-ho ho, you might THINK that... But that's why I'm double-checking it on the internet...
es: Oh-oh oh, puedes PENSAR eso... Pero yo voy a confirmar la información en internet...

source: WHAT!? I can't believe I actually believed them. This is an outrage!!
es: ¿¡QUÉ!? No puedo creerlo, y lo realmente les creí. ¡¡Me mintieron!!

source: If you'll pardon me, I have to teach a toddler some VERY grown-up words.
es: Si me perdonas, tengo que enseñarle a un niño unas palabras MUY adultas.

source: I hope it's not the same toddler as last time...
es: Espero que no sea el mismo niño que la última vez...

source: Oh hey Lisk! What's going on, Desert Q's just seven days right? Didn't it end a few days ago?
es: ¡Hola Lisk! ¿Cómo estás, la Ola del Desierto eran solo siete días, no? ¿No terminó hace un par de días?

source: Oh you know how it is. Seven days became eight days, and a few of us missed our flights home.
es: Oh, bueno, ya sabes como es. Siete días se transformas en ocho días, y algunos de nosotros perdimos algunos vuelos.

source: Then we missed our makeup flights, and then we set up some tents outside.
es: Después coordinamos otros vuelos y también los perdimos, así que ahora pusimos algunas carpas para dormir.

source: You set up... tents?
es: Pusieron... ¿carpas para dormir?

source: And then a bunch of us kind of got hooked on the food here, which... Can you blame us?
es: También a un montón de nosotros nos gustó la comida de acá, lo cual... ¿puedes culparnos?

source: Anyway, I'll probably go home in a few weeks, or months, or... You know, whenever.
es: De cualquier forma, creo que voy a volver a casa en algunas semanas, o meses, o... Bueno, ya sabes.

source: That seems weird, don't you have...
es: Eso parece raro, es que no tienes...

source: Pets?
es: ¿Mascotas?

source: A significant other?
es: ¿Una pareja?

source: Friends?
es: ¿Amigos?

source: Responsibilities?
es: ¿Responsabilidades?

source: Don't you have pets?
es: ¿Es que no tienes mascotas?

source: Psh whatever. Don't YOU have pets?
es: Psh, como sea. ¿Acaso TÚ no tienes mascotas?

source: Don't you have friends?
es: ¿Es que no tienes amigos?

source: Psh whatever. Don't YOU have friends?
es: Psh, como sea. ¿Acaso TÚ no tienes amigos?

source: Don't you have a significant other?
es: ¿Es que no tienes pareja?

source: Psh whatever. Don't YOU have a significant other?
es: Psh, como sea. ¿Acaso TÚ no tienes pareja?

source: Don't you have responsibilities?
es: ¿Es que no tienes responsabilidades?

source: Psh whatever. Don't YOU have responsibilities?
es: Psh, como sea. ¿Acaso TÚ no tienes responsabilidades?

source: ...Umm. Touche?
es: ...Umm. ¿Touché?

source: Well, we do have other locations.
es: Bueno, nosotros tenemos otras sucursales.

source: That sounds like way too much work for me! Three vanilla puffs please.
es: ¡Eso a mi me suena a mucho trabajo! Tres brownies de vainilla por favor.

source: And gimme some extras, I'll take 'em home to my tent-mates.
es: Y dame algunos extras, de seguro mus compañeros de carpa van a querer.

source: Hooray! More customers!
es: ¡Hurra! ¡Más clientes!

source: I'm glad you're staying, but...
es: Me gusta que te quedes, pero...

source: This behavior seems obsessive
es: Este comportamiento parece obsesivo

source: This behavior seems obsessive! You can't upend your life just because you found a new favorite place to eat.
es: ¡Este comportamiento parece obsesivo! No puedes rehacer tu vida solo porque encontraste un lugar nuevo y favorito para comer.

source: I mean, I'm glad everyone's sticking around, but I'm worried it's for kind of the wrong reasons...
es: Digo, me gusta que estén acá, pero estoy preocupado de que sean por razones equivocadas...

source: Hooray! I wasn't sure if we'd survive without customers, but it sounds like they're here for good.
es: ¡Hurra! No estaba seguro de que podríamos sobrevivir sin clientes, pero suena a que se van a quedar por un buen rato.

source: They've even improvised some kind of a shanty town!
es: ¡Parece que hasta están improvisando unas cabañas de cactus!

source: Right? I wasn't expecting our food to provoke such in-tents cravings.
es: No entiendo lo de las carpas. ¿Cómo pueden dormir en un pez?

source: With a steady stream of customers in Poki Desert, Fat Sensei already had plans for a third location. But #player# was suspicious of their good fortune.
es: Incluso con la fila infinita de personas en el Desierto Poki, Fat Sensei ya tiene planes para una tercera sucursal. Pero #player# sospecha de su buena fortuna.
