Repository: Poobslag/turbofat
Catalog: project/assets/main/locale/*.po
Languages: es

source: But, the restaurant!
es: ¡Pero, el restaurante!

source: But, I like it here!
es: ¡Pero, me gusta aquí!

source: But, my new friends!
es: ¡Pero, mis nuevos amigos!

source: But, my girlfriend!
es: ¡Pero, mi novia!

source: But, my boyfriend!
es: ¡Pero, mi novio!

source: But-
es: ¡Pero-

source: -I know you don't want to! I don't want to either.
es: -¡Ya se que no quieres! Yo tampoco quiero irme.

source: But, we have to find new challenges. It'll be better for us in the long run.
es: Pero tenemos que encontrar nuevos retos. Será bueno para nosotros a la larga.

source: Okay...
es: Está bien...

source: Sorry, I should probably tell you - Fat Sensei and I aren't coming back to MerryMellow marsh for awhile.
es: Perdón, pero tengo que decírtelo - Fat Sensei y yo no volveremos a Ciénaga de Malvaviscos por un buen rato.

source: You're not coming back!? Wait! ...Today's your last day?
es: ¿¡No vas a volver!? ¡Espera! ...¿Hoy es tu último día?

source: No, not today. ...But, some day later this week.
es: No, hoy no. ...Pero algún día de esta semana.

source: Wow, oh no! We have to get married soon then.
es: ¡Wow, oh no! Tenemos que casarnos lo más rápido posible.

source: Well... no, we probably shouldn't.
es: Bueno... no, creo que no debemos.

source: Sorry, Bones. You're a special dog. And you'll always have a special place...
es: Perdón, Bones. Eres mi perro especial. Siempre tendrás un lugar especial...

source: In my potato
es: En mi cola

source: In my heart
es: En mi corazón

source: In my thoughts
es: En mis pensamientos

source: In my butt
es: En mi trasero

source: On a registry
es: En un registro

source: In my heart and thoughts
es: En mi corazón y pensamientos

source: You'll always have a special place in my heart.
es: Siempre tendrás un lugar especial en mi corazón.

source: Well... Thanks. I'm glad I'll always be close to your heart.
es: Bueno... Gracias. Me gusta saber que siempre estaré en tu corazón.

source: (You are no longer in a relationship with Bones.)
es: (Ya no tienes una relación con Bones)

source: You'll always have a special place in my thoughts.
es: Siempre tendrás un lugar especial en mis pensamientos.

source: Well... Thanks. I'm glad I'll always be close to your thoughts.
es: Bueno... Gracias. Me gusta saber que siempre estaré en tus pensamientos.

source: You'll always have a special place in my heart, and in my thoughts.
es: Siempre tendrás un lugar especial en mi corazón, y en mis pensamientos.

source: But... I want you to stay! I don't want hearts and thoughts. Hearts and thoughts, they fade. Fade away.
es: Pero... ¡Quiero que te quedes! No quiero ni corazones ni pensamientos. Los corazones y pensamientos se desvanecen.

source: Well. Thanks anyways. I'm glad I'll always be close to your heart, and your thoughts.
es: Bueno. Gracias de todas formas. Me gusta saber que siempre estaré en tu corazón y en tus pensamientos.

source: You'll always have a special place in my butt.
es: Siempre tendrás un lugar especial en mi trasero.

source: Well... Thanks. I'm glad I'll always be close to your butt.
es: Bueno... Gracias. Me gusta saber que siempre estaré en tu trasero.

source: You'll always have a special place in my potato.
es: Siempre tendrás un lugar especial en mi cola.

source: Well... Thanks. I'm glad I'll always be close to your potato.
es: Bueno... Gracias. Me gusta saber que siempre estaré en tu cola.

source: You'll always have a special place on a certain registry somewhere.
es: Siempre tendrás un lugar especial en algún lugar de un registro.

source: Well... Thanks. I'll think of you every time someone mentions that registry.
es: Bueno... Gracias. Pensaré en ti cada vez que alguien mencione ese registro.

source: Sorry, this is hard to say but we were only supposed to be here for one week. And that was like... several weeks ago.
es: Perdón, se que es difícil pero se supone que nos íbamos a quedar por una semana. Y eso fue hace... muchas semanas atrás.

source: Fat Sensei and I need to leave for awhile.
es: Fat Sensei y yo necesitamos irnos por un buen rato.

source: Wahhhh! What about us?
es: ¡Quéeee! ¿Y qué hay de nosotros?

source: "Us?"
es: ¿"Nosotros"?

source: Our relationship!
es: ¡Nuestra relación!

source: What? We have a... relationship?
es: ¿Qué? ¿Tenemos una... relación?

source: I could stay
es: Podría quedarme

source: You could come
es: Podrías venir

source: Long distance relationship?
es: ¿Relación a distancia?

source: We should break up
es: Es mejor terminar

source: I guess I could stay here!
es: ¡Supongo que podría quedarme!

source: Wh-what!?! ...But you said you were leaving!
es: ¡¿¡Qu-qué!?! ...¡Pero dijiste que te ibas!

source: Oh, you're right! I forgot.
es: ¡Ah, cierto! Me olvidé.

source: Well, well ummm... We could do the long distance thing, right?
es: Bueno, bueno ummm... ¿Podemos intentar con una relación a distancia, no?

source: Like maybe a relationship where we never talk, and we never see each other, and we can date other people...
es: Esas cosas donde en una relación nunca hablamos, nunca nos veremos, podemos salir con otra gente...

source: ...But we're still in a relationship and we still think about each other. What about that?
es: ...Pero seguimos estando en una relación y todavía pensamos en nosotros. ¿Qué te parece?

source: You could come with me!
es: ¡Podrías venir conmigo!

source: ...Come with you? That's a big step. Couldn't we start with a long-distance relationship?
es: ...¿Ir contigo? Eso es un gran paso. ¿Por qué no intentamos con una relación a distancia?

source: Ohh... I don't think that will work out.
es: Ohh... No creo que eso funcione.

source: What about a long-distance relationship where we never talk, and we never see each other, and we can date other people...
es: Que te parece una relación a distancia donde nunca hablamos, nunca nos veremos, podemos salir con otra gente...

source: I guess we could... try the long distance thing.
es: Creo que podemos intentar... la cosa a distancia.

source: Long distance? Hmm... So maybe, a relationship where we never talk, and we never see each other, and we can date other people...
es: ¿A distancia? Hmm... Entonces, una relación donde nunca hablamos, nunca nos veremos, podemos salir con otra gente...

source: ...But we're still in a relationship and we still think about each other. Something like that?
es: ...Pero seguimos estando en una relación y todavía pensamos en nosotros. ¿Algo como eso?

source: I guess we need to... break up.
es: Supongo que necesitamos... terminar.

source: Well what about a long-distance relationship?
es: Bueno, ¿qué te parece una relación a distancia?

source: I... what?
es: Yo... ¿Qué?

source: Or we break up
es: O podríamos terminar

source: That sounds awful
es: Suena muy raro

source: That sounds fine
es: Suena bien

source: That... sounds fine.
es: Eso... suena bien.

source: (You are no longer in a relationship with Skins.)
es: (Ya no tienes una relación con Skins.)

source: Or we can just break up.
es: O podríamos simplemente terminar.

source: Don't worry! I'll just long distance you. ...You don't have to long distance me back. Mowr!
es: ¡No te preocupes! Yo te pondré en relación a distancia. ...No tienes que ponerme a mi en relación a distancia. ¡Mowr!

source: No, that sounds awful.
es: No, eso suena muy raro.

source: So I don't know if you've heard, but -- Fat Sensei and I are leaving MerryMellow Marsh for awhile.
es: No se si escuchaste, pero -- Fat Sensei y yo dejaremos Ciénaga de Malvaviscos por un buen rato.

source: Oh. Yeah, it was only supposed to be a week, right? ...Well, sorry to see you go. This place will suck a little more without you.
es: Oh. Sí, supuestamente era solo por una semana, ¿no? ...Bueno, que lástima. Este lugar va a apestar un poco más sin ustedes.

source: Want to be manager?
es: ¿Quieres ser gerente?

source: You could leave
es: Podrías irte, ¿sabes?

source: It's not so bad
es: No es tan malo

source: It's pretty bad
es: Es muy malo

source: Do you want us to make you a manager? You could hire new staff or fix the culture here.
es: ¿Quieres que te hagamos gerente? Podrías contratar más gente o intentar arreglar los problemas.

source: Wow! Managing. ...I mean even if I hate it here, I don't know if I give enough of a crap to actually try and improve things. Ha ha.
es: ¡Wow! Gerente. ...Incluso si odio este lugar, no se si me importa lo suficiente como para mejorar algo. Jaja.

source: Yeah, I don't know. I'll probably just let it suck for awhile, see how that goes.
es: Sí, no se. Probablemente dejaré que apeste por un rato, a ver a dónde lleva.

source: You could find a new job if things are that bad here. I'm sure you'll land on your feet.
es: Podrías encontrar un nuevo trabajo si las cosas van mal. Estoy seguro que te las arreglarás.

source: Yeah, I don't know. Even if I hate it, I'm more the type to stick it out rather than lifting a finger to help myself. Ha ha.
es: Sí, no se. Incluso si odio este lugar, prefiero apegarme a un solo lugar antes que hacer algo para ayudarme. Jaja.

source: I'll probably just let it suck for awhile, see how that goes.
es: Probablemente dejaré que apeste por un rato, a ver a dónde lleva.

source: Yeah, sorry, it seems pretty bad. Do you think you'll keep working here?
es: Sí, perdón, se que es muy malo. ¿Piensas que seguirás trabajando aquí?

source: It doesn't seem so bad! I'm sure you'll get by.
es: ¡No es tan malo! Estoy seguro que te las arreglarás.

source: If you weren't happy here, you could change it you know.
es: Si no eres feliz aquí, sabes que puedes cambiarlo.

source: There are other jobs, easier jobs, better paying jobs. Jobs with less obnoxious coworkers.
es: Existen otros trabajos, más fáciles, con mejores salarios. Con compañeros de trabajo menos odiosos.

source: But, I think you're staying because you're happy here. I don't know what your reasoning is, it could be a few things.
es: Pero, creo que si te estás quedando, es porque eres feliz aquí. No se cuáles son tus razones, podrían ser algunas cosas.

source: Maybe you enjoy working for a small business, rooting for the underdog and trying to turn things around.
es: Puede que disfrutes trabajar para un negocio chico, apoyando a los perdedores e intentando mejorar las cosas.

source: Maybe you enjoy the attention from your obnoxious coworkers, even if you don't reciprocate it.
es: Tal vez disfrutas la atención de tus compañeros de trabajo odiosos, incluso si no es recíproco.

source: Maybe you enjoy being the most competent employee in a sea of idiots, having people turn to you or view you as a figure of responsibility.
es: Tal vez disfrutas ser el empleado más competente en este mar de idiotas, que la gente te mire y vea una figura de responsabilidad.

source: Well. What I'm saying is I'm pretty sure you're happier than you think.
es: Bueno. Lo que digo es que estoy seguro que eres más feliz de lo que crees.

source: You need to remind yourself you're happy sometimes. ...You can hurt yourself if you forget that sort of thing.
es: Necesitas recordar que a veces eres feliz. ...Podrías lastimarte si olvidas algo como eso.

source: ...Alright. If I'm ever happy, I'll be sure to let myself know.
es: ...Está bien. Si alguna vez soy feliz, voy a asegurarme de saberlo.

source: Well, I hate long goodbyes and I think this one's kind of run its course. Take care of yourself.
es: Bueno, odio las despedidas y creo que no voy a poder aguantar mucho. Cuídate.

source: You too
es: Tú también

source: See you around
es: Nos vemos

source: Stay in touch
es: Suerte

source: Stay in touch!
es: ¡Suerte!

source: See you around!
es: ¡Nos vemos!

source: You too!
es: ¡Tú también!

source: Any news?
es: ¿Alguna noticia?

source: So yeah, I mean... We're trying a few promotions to get people back, but I don't know.
es: Sí, bueno... Intentamos que algunos clientes vuelvan con algunas promociones, pero no se.

source: I HATE marketing, and I always sort of hoped word of mouth would be enough for a place like this?
es: ODIO el marketing, y ¿siempre pensé que con este tipo de lugar bastaría con el boca en boca de los clientes?

source: And I mean for a while things were going great! ... ...I don't really get what changed....
es: ¡Por un momento las cosas iban bien! ... ...Pero no entendí que fue lo que cambió...

source: Well, maybe people don't like the new name. ...Have you thought about changing it again?
es: Bueno, tal vez a la gente no le gusta el nuevo nombre. ...¿Pensaste en cambiarlo otra vez?

source: ....Wait, what?
es: ...Espera, ¿qué?

source: Switch it back to Butt Up Cafe!
es: ¡Cámbialo a Butt Up Café!

source: Shorten it to Butt Cafe!
es: ¡Acórtalo a Butt Café!

source: Oh, nevermind
es: Oh, no importa

source: You know, maybe people miss the old Butt Up cafe!
es: ¡Ya sabes, tal vez la gente extraña el viejo Butt Up Café!

source: S-sorry. What? I can't tell if that's a joke or if you're actually making a dig at me.
es: P-perdón. ¿Qué? No se si estás hablando en broma o si estás hablando en serio.

source: I'm not really in the right headspace to parse that right now.
es: Creo que no estoy en el correcto estado mental para analizar eso.

source: Ha ha. You'll figure it out.
es: Jaja. Ya vas a entender.

source: Maybe just call it The Butt Cafe this time! You know, shorter! Punchier!
es: ¡Y por qué no lo cambias a Butt Café! Ya sabes, ¡Corto e impactante!

source: Oh... nevermind.
es: Oh... No importa.

source: I had an inappropriate joke, but somehow inappropriate jokes seem inappropriate right now.
es: Tengo un chiste inapropiado, pero ahora hasta los chistes inapropiados parecen inapropiados.

source: Heh, thanks. ...Hey, keep in touch, okay?
es: Jeje, gracias. ...Hey, mantenganse en contacto, ¿sí?

source: Well... I guess we're out of here! It was nice meeting all of you.
es: Bueno... ¡Creo que nos vamos! Fue un placer conocer a todos.

source: Congratulations on the restaurant's success! All your hard work really paid off.
es: ¡Felicidades con el éxito del restaurante! Todo el trabajo duro rindió frutos.

source: Us? Heh what are you talking about! You two did all the work.
es: ¡Pero de qué estás hablando! Ustedes dos hicieron todo el trabajo.

source: Wait, you didn't do anything? ...We didn't do anything either! Did we?
es: Espera, ¿Ustedes no hicieron nada? ...¡Nosotros tampoco hicimos nada! ¿No?

source: Well, you and Fat Sensei got all these customers to come!
es: Bueno, ¡tú y Fat Sensei atrajeron a todos estos clientes!

source: Maybe? I talked to two or three of them at most! ...Were they all friends?
es: ¿Tal vez? ¡Le hablé a dos o a tres máximo! ...¿Tal vez son todos amigos?

source: You trained us to cook better! I bet that made a difference too.
es: ¡Nos entrenaste para cocinar mejor! Apuesto que eso también hace la diferencia.

source: You improved a lot
es: Mejoraron un montón

source: You didn't improve
es: No mejoraron nada

source: You got worse
es: Empeoraron

source: Yeah! Your cooking's gotten way better. That goes for all of you! I bet that's it.
es: ¡Sí! La cocina mejoró mucho. ¡Y eso va para todos! Apuesto que es eso.

source: I tried to train you but there's only so much I could teach you in such a short time!
es: ¡Intenté entrenarlos, pero no puedo enseñarles tanto en tan poco tiempo!

source: Sorry Skins, I think it was probably something else...
es: Perdón Skins, pero creo que fue algo más...

source: Skins, somehow your cooking actually got worse after our training. Now that you mention it,
es: Skins, de alguna forma tu técnica empeoró después de tu entrenamiento. Ahora que lo mencionas,

source: Something brought in even more customers to make up for the ones you drove away.
es: Algo hizo atraer a muchos más clientes para compensar los que tú ahuyentaste.

source: I heard the Buttercup Cafe shut down. ...Maybe we just got their leftovers?
es: Escuché que Battercup Café cerró. ...¿Tal vez agarramos sus sobras?

source: That's great!
es: ¡Qué bien!

source: That's interesting
es: Que interesante

source: That's too bad
es: Que mal

source: They did? Wow! Good riddens to bad restaurants. Did they finally go out of business?
es: ¿En serio? ¡Wow! Ganó el mejor restaurante. ¿Al final cerraron?

source: Yeah! They'd been bleeding customers for awhile now.
es: ¡Sí! Desde hace mucho tiempo estaban perdiendo clientela.

source: Oh, I didn't know that. ...Did they just go out of business or what?
es: Oh, no sabía eso. ...¿Simplemente cerraron o qué?

source: They did? Oh no! ...I didn't hear about that. Did something happen? Is Diota okay?
es: ¿En serio? ¡Oh no! ...No sabía nada de eso. ¿Cómo pasó? ¿Diota está bien?

source: Ehh you didn't know? They'd been bleeding customers for awhile now!
es: ¿No sabías? ¡Desde hace mucho tiempo estaban perdiendo clientela!

source: Pretty sure they burned through their savings and couldn't make rent, it's nothing weird.
es: Estoy seguro que los gastos se acumularon y no pudieron pagar la renta, no es nada raro.

source: ...Like I said before, going head to head the garbage food always wins!
es: ...Como dije antes, ¡si tienen que elegir, la comida basura siempre gana!

source: I mean the uhh... the GOURMET food! Our food.
es: Digo, la uhh... ¡La comida GOURMET! Nuestra comida.

source: Well, whatever it is... A win's a win! I say we take it.
es: Bueno, sea lo que sea... ¡Una victoria es una victoria!

source: Goodbye everyone! Thank you for treating my beloved restaurant with care.
es: ¡Adios a todos! Gracias a ustedes por tratar a mi amado restaurante con mucho cuidado.

source: Instead of spending a week in Merrymellow Marsh like they originally planned, Fat Sensei and #player# ended up staying for an entire month. ...But for some, even an entire month wasn't enough.
es: En lugar de quedarse una semana en Ciénaga de Malvaviscos como lo planearon, Fat Sensei y #player# se quedaron por un mes entero. ...Pero para algunos, incluso un mes no fue suficiente.

source: I still wish we could have stayed and helped longer. I was finally starting to feel like I belonged there.
es: Como desearía que nos podamos quedar y seguir ayudando. Ya me estaba sintiendo como si perteneciera ahí.

source: Well, a wise poet once wrote, "Two sofas diverged in a furniture store."
es: Bueno, un poeta sabio una vez escribió, "Dos sofás se bifurcan en una tienda de muebles."

source: "I chose the sofa less comfortable, and that has made all the difference."
es: "Elegí el sofá menos confortable, y esa acción hizo toda la diferencia."

source: I see
es: Ya veo

source: That's stupid
es: Que estúpido

source: You made that up
es: Lo inventaste

source: I see... And Merrymellow Marsh is like one of those big squishy beanbag chairs,
es: Ya veo... Y Ciénaga de Malvaviscos es como uno de esos sillones puffs super mullidos,

source: The kind where you almost pass out in them, and then you have trouble standing up afterwards.
es: Ese tipo de sillón donde mientras más tiempo te sientas, más te cuesta pararte.

source: Yes, something like that.
es: Sí, algo así.

source: Really? A wise poet wrote that?
es: ¿En serio? ¿Un sabio poeta escribió eso?

source: ...It sounds more like an excuse you made up after buying a crappy sofa.
es: ...Suena más a una excusa que harías después de comprar un sofá del que te arrepentiste.

source: Well that's stupid. Here's a better poem,
es: Bueno eso fue estúpido. Aquí hay un mejor poema,

source: "Buy some proper furniture and your butt will hurt less, you big wing wong."
es: "Compra un sofá apropiado y tu trasero dolerá menos, no seas tonto."

source: Well, besides that. Did we even do anything while we were there?
es: Bueno, aparte de eso. ¿Hicimos algo mientras estuvimos ahí?

source: We only finished with a handful of extra customers, and we still don't know why they came.
es: Aparecieron algunos clientes más, pero todavía no sabemos exactamente porqué vinieron.

source: They could stop showing up next week, and we'd be back to square one.
es: Podrían parar de ir la próxima semana, y volveríamos como estábamos antes.

source: Well. ...For now it's just a handful of customers, but that will change in time.
es: Bueno. ...Por ahora son pocos clientes, pero puede cambiar en cualquier momento.

source: There's an old saying, 'even the greatest avalanche starts with a single snowflake.'
es: Como dice el refrán, "Incluso la más grande avalancha comienza con un solo copo de nieve."

source: ...the GREATEST avalanche?
es: ...¿La avalancha MÁS GRANDE?

source: Three or four customers now will become thirty or forty.
es: Tres o cuatro clientes pueden transformarse en treinta o cuarenta.

source: And the snowflake becomes a snowball, and the snowball gets bigger...
es: Y el copo de nieve se transforma en bola de nieve, y se sigue haciendo más grande...

source: Just to be clear, you're using 'GREATEST' in the pejorative sense right? We're not... we're not pro-avalanche!
es: Solo para aclarar, estás usando "MÁS GRANDE" en sentido peyorativo, ¿no? Nosotros no... ¡Nosotros no queremos una avalancha!

source: ...until two or three years later, when our glorious restaurant will have the destructive force to level an entire city!
es: ...¡Hasta que en dos o tres años, nuestro glorioso restaurante tendrá la fuerza destructiva para arrasar una ciudad entera!

source: Ahha ha ha ha!
es: ¡Jajajajaja!

source: Okay, come on, seriously! ...Use a nicer metaphor! You're being all weird about this.
es: ¡Bueno, está bien, en serio! ...¡Usa una metáfora más linda! Te estás poniendo muy raro.

source: Even the greatest... PESTILENCE begins with a single cough!
es: ¡Incluso la... PESTILENCIA más grande comienza con un solo estornudo!

source: What!? No, we have a NICE restaurant! It's not a pestilence!
es: ¿¡Qué!? ¡No, tenemos un LINDO restaurante! ¡No es una pestilencia!

source: Even the greatest MASSACRE begins with...
es: Incluso la MASACRE más grande comienza con...

source: STOP! Augh!
es: ¡PARA! ¡Augh!

source: So how was that?
es: Bueno, ¿cómo lo hice?

source: I think you killed it!
es: ¡Creo que fue perfecto!

source: That was pretty good!
es: ¡Eso estuvo muy bien!

source: That was terrible! Are you kidding me?
es: ¡Eso fue terrible! ¿Estás bromeando?

source: Wow, I think you killed it! You have some real talent.
es: ¡Wow, eso fue perfecto! Tienes mucho talento.

source: Whoa, thanks!
es: Wow, ¡gracias!

source: Hey, that was pretty good! And y'know, with a little more training you'll get even better.
es: ¡Hey, eso estuvo muy bien! Sabes, con un poco más de práctica, podrías hacerlo incluso mejor.

source: Oh okay cool!
es: Oh, bueno, ¡genial!

source: That was terrible! Are you kidding me? ...Did you have any cooking experience before this?
es: ¡Eso fue terrible! ¿Estás bromeando? ...¿Tienes alguna experiencia en la cocina?

source: Uhh I mean like, Richie's been helping me figure out the kitchen stuff. ...Did I mess something up?
es: Uhh, bueno, Richie me estuvo ayudando mucho con el tema de la cocina. ...¿Hice algo mal?

source: Hmm. Yes! Pretty good. Your technique is ahhh... a little off though!
es: Hmm. ¡Sí! Muy bien. Tu técnica es ahhh... ¡un poco rara!

source: My... my technique?
es: Mi... ¿Mi técnica?

source: You should focus on the piece of food you're cooking. You don't need to flip all those other pieces beforehand.
es: Deberías concentrarte en la pieza con que estás cocinando. No necesitas girar todas las piezas de antemano.

source: But I have to keep them flipped the same way! Otherwise it makes my head all muddy.
es: ¡Pero necesito girar todas a la misma dirección! Si no, me hace doler la cabeza.

source: Well, flipping them slows you down.
es: Bueno, girarlas todas te hace más lento.
